OEVENTLUA[1101] = function ()
	Cls()

	if has_thing(222) then
		say("少爷已经回府了，有事你可以找少爷。", 1046, 0, "平阿四")
		dark()
		addevent(0, 100, 1, 1109, 1, 5166, 27, 20)
		light()

		return
	end

	if JY.Base.随从1 == 625 then
		say("家主不在，还请客人改日再来。", 1046, 0, "平阿四")
	else
		say("敢问可是胡大侠当面？", 0, 1)
		say("我是胡府老仆平四，老爷出门访友未归，敢问客人前来找我家老爷有何事？", 1046, 0, "平阿四")
		say("不知你家老爷何时归来？", 0, 1)
		say("老仆不知，少侠或可前往有间客栈打探消息，老爷往有间客栈去了有两日了。", 1046, 0, "平阿四")
		say("如此多谢！", 0, 1)
		addevent(3, 5, 1, 10705, 1, -2, -2, -2)
		addevent(3, 6, 1, 10705, 1, -2, -2, -2)
		addevent(3, 8, 1, 10705, 1, -2, -2, -2)
		addevent(3, 12, 0, 1103, 3, 0, -2, -2)
		addevent(3, 18, 0, 1103, 3, 0, -2, -2)
		addevent(3, 9, 0, 0, 0, 8246, -2, -2)
		addevent(3, 10, 0, 0, 0, 8624, -2, -2)
		addevent(3, 22, 0, 0, 0, 10146, -2, -2)

		JY.Person[4].佛学修为 = 1
		JY.Person[628].佛学修为 = 1
	end
end
OEVENTLUA[1103] = function ()
	Cls()
	dark()
	null(-2, 12)
	null(-2, 18)
	light()
	say("给我打！今天不还出钱来，就到地府寻你老爹去吧。", 1153, 0, "凤天南")
	say("老爷，你饶了小的吧。小的已经连吃饭都没有钱了。", 1095, 1, "麦小八")
	say("饶了你？那谁来还我的钱。", 1153, 0, "凤天南")
	say("给我使劲打！都是贱骨头，不打不服气。", 1153, 0, "凤天南")
	say("救命啊！（眼看被打得快没气了）", 1095, 1, "麦小八")
	dark()
	addevent(3, 11, 0, 0, 0, 8138, -2, -2)
	light()
	say("住手！（人群中闪出一个持刀汉子，只手中刀鞘一轮，就将几个悍仆打翻在地）", 345, 0, "胡一刀")
	say("怎么回事？青天白日的，这是要把人打死吗？", 345, 0, "胡一刀")
	say("哼，不打也行，这小子欠了我的钱，你要帮他还了也行，不然连你一起，我都拿到官府去。", 1153, 1, "凤天南")
	say("他欠你多少钱？", 345, 0, "胡一刀")
	say("不多，纹银500两。", 1153, 1, "凤天南")
	say("这...", 345, 0, "胡一刀")
	say("怎么？拿不出来？", 1153, 1, "凤天南")
	say("（胡一刀脸有难色，往人群里看来，当看见你时，眼睛一亮）这位" .. JY.Person[0].称呼 .. "，可愿仗义救助。", 345, 0, "胡一刀")
	say("（这位兄台武艺好高，是个汉子）好，拿去！", 0, 1)

	if instruct_31(500) == false then
		say("哼，小子，你这银两不够500两。", 1153, 1, "凤天南")
		say("我这里还有，加上就够了。", 345, 0, "胡一刀")

		JY.GOLD = 0
	else
		instruct_2(174, -500)
	end

	say("哼，小八，算你好命。", 1153, 1, "凤天南")
	null(-2, 10)
	null(-2, 22)
	say("多谢两位大侠救命之恩。", 1095, 1, "麦小八")
	say("究竟怎么回事？你年纪轻轻，如何会欠这么多银子？", 345, 0, "胡一刀")
	say("老爷有所不知，小人本是这有间客栈的少东主，那凤天南看上了这个客栈,", 1095, 1, "麦小八")
	say("不知怎么和官府勾连，就说我们客栈非法经营，不但要查封客栈，还罚了500两白银。", 1095, 1, "麦小八")
	say("老父不服，告上县衙，不想被当场打了20杀威棒。想是年纪大了，回来就一病不起，不久就去了。", 1095, 1, "麦小八")
	say("那凤天南得了客栈，还不满足，要小的接着还500两白银，说是官府判的，不还就要抓我进官府判刑。", 1095, 1, "麦小八")
	say("幸亏今日遇着两位老爷，不然...", 1095, 1, "麦小八")
	say("可恶，早知道刚才就一刀宰了这恶霸。", 345, 0, "胡一刀")
	say("我如今还有要事，没法抽出时间。你可有去处？", 345, 0, "胡一刀")
	say("小的还有个亲戚在京城附近，如今没法子，只能去投奔他了...", 1095, 1, "麦小八")
	say("也好，你且去吧，这个凤天南我早晚要处理。", 345, 0, "胡一刀")
	say("这位" .. JY.Person[0].称呼 .. "，你很不错。咱们有缘再见。", 345, 0, "胡一刀")
	dark()
	null(-2, 9)
	null(-2, 11)
	light()
	addevent(107, 40, 0, 1105, 3, -2, -2, -2)
	addevent(107, 37, -2, -2, -2, 8246, -2, -2)
	addevent(107, 38, -2, -2, -2, 5406, -2, -2)
	addevent(107, 39, -2, -2, -2, 5410, -2, -2)

	JY.Base.随从1 = 625
end
OEVENTLUA[1104] = function ()
	Cls()
	dark()
	null(-2, 2)
	null(-2, 19)
	null(-2, 30)
	light()
	instruct_44(22, 8130, 8136, 15, 8150, 8156)
	addevent(109, 19, 0, 0, 0, 8138, -2, -2)
	addevent(109, 30, 0, 0, 0, 8158, -2, -2)
	say("好刀法！", 3, 1, "苗人凤")
	say("好剑法！", 345, 0, "胡一刀")
	say("咱们再来！", 3, 1)
	meet_self(3)
	say("（那个使刀的是有间客栈的那个汉子！这两人武功好俊，使刀的如猛虎下山，使剑的似凤凰飞舞，只是一刚一柔，各擅胜场，看来谁也胜不了谁。）", 0, 1)
	say("苗兄，经过这四天的切磋，你我的武功相互都已了然於胸。这样吧，我使苗家剑法，你使胡家刀法，咱俩再决胜负。不论谁胜谁败，都不损了威名。", 345, 0, "胡一刀")
	say("好主意！", 3, 1)
	dark()
	null(-2, 19)
	null(-2, 30)
	light()
	instruct_44(22, 8130, 8136, 15, 8150, 8156)
	say("啊！", 345, 0, "胡一刀")
	say("啊！", 3, 1)
	addevent(109, 19, 0, 0, 0, 8138, -2, -2)
	addevent(109, 30, 0, 0, 0, 8158, -2, -2)
	say("（只见两人酣战之中突然分开，胡一刀的左臂被划了一个口子，苗人凤却被踢中了腰间的京门穴）", 0, 1)
	say("胡兄，我出刀时固然略有容让，但即令砍下你的左臂，你这一腿仍能致我死命。这场比试是你赢了。", 3, 1)
	addevent(109, 19, 0, 0, 0, 10224, -2, -2)
	say("咦....胡兄？胡兄，你怎么了？", 3, 1)
	say("（不对！看胡一刀脸颊深紫，分明是中了剧毒！我要上前帮忙吗？）", 0, 1)

	if yesno("要帮忙吗？") then
		instruct_37(1)
		say("苗大侠别慌，待我来看看。", 0, 1)
		My_Enter_SubScene(109, 27, 30, 2)
		say("原来这刀上抹了毒....幸好伤口不深，还有救！", 0, 1)
		instruct_37(1)
		dark()
		light()
		say("臭小子，坏我好事！", 72, 0)
		addevent(109, 39, 0, 0, 0, 8892, -2, -2)

		if WarMain(3, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("原来是那个小人在搞鬼！这位少侠，胡兄就拜托你照顾了！", 3, 1)
		dark()
		null(-2, 30)
		null(-2, 39)
		addevent(107, 41, 1, 1114, 1, 2528, -2, -2)
		light()
		say("（胡大侠余毒未清，还是快点把他送到客栈休息吧。）", 0, 1)
		null(-2, 19)
		My_Enter_SubScene(107, 48, 39, 0)
		say("胡大侠，你感觉怎么样？", 0, 1)
		say("这次多亏了小兄弟你出手相助，胡某才不至于丧于奸人之手。", 345, 0, "胡一刀")
		say("胡大侠客气了，可惜我医术不精，未能根除余毒....，请胡大侠安心在此疗伤，等我去城里寻得医师为大侠治疗。", 0, 1)
		say("好，那就有劳小兄弟了。", 345, 0, "胡一刀")
		addevent(107, 56, 1, 1106, 1, 5168, 6, 43)
	else
		instruct_37(-5)
		dark()
		addevent(109, 39, 0, 0, 0, 8892, -2, -2)
		light()
		say("恭喜苗兄手刃大敌。", 72, 0)
		addevent(109, 30, 0, 0, 0, 9128, -2, -2)
		say("田归农！是你搞的鬼？", 3, 1)
		say("做大事者不拘小节，这胡一刀武功高强，如果不动点手脚怎么能报我们祖上之仇。", 72, 0)
		say("我和胡兄的比武原本光明正大，你竟然下毒害了他，苗某一时不察害了胡兄性命。田归农，我如今就要拿你祭奠英灵！", 3, 1)
		say("苗兄，请冷静一下！", 72, 0)
		say("哪里走！", 3, 1)
		dark()
		null(-2, 30)
		null(-2, 39)
		light()
		say("怎么都走了，待我上前看看胡一刀有没有值钱的遗物....", 0, 1)
		My_Enter_SubScene(109, 27, 30, 2)
		say("有了，有把好刀，还有几本书。", 0, 1)
		addthing(202, 1)
		addthing(247, 1)
		addthing(136, 1)
		instruct_37(-5)
		dark()
		light()
		say("小子，把东西交出来！", 4, 0)
		addevent(109, 21, -2, -2, -2, 1372, -2, -2)
		say("（突然从树林窜出一个蓝衣蒙面人来，劈手就打出一片彩色烟雾）", 0, 1)
		say("不好！（措不及防之下，你吃了一惊，急忙捂住口鼻。只觉得手中一松，手中书已经被人一把抢去）", 0, 1)
		say("哪里走？（你头晕了一下，急忙追了上去）", 0, 1)
		null(-2, 21)

		for iter_3_0 = 0, CC.HeadNum do
			if inteam(iter_3_0) then
				JY.Person[iter_3_0].内力 = JY.Person[0].内力 - 1000

				if JY.Person[iter_3_0].内力 < 0 then
					JY.Person[iter_3_0].内力 = 0
				end

				JY.Person[iter_3_0].中毒程度 = 40
				JY.Person[iter_3_0].体力 = 40
			end
		end

		if WarMain(1, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		addthing(136, -1)
		say("啊，那本刀法被抢走了！可恶....", 0, 1)
		say("哪里走！", 0, 1)
		null(-2, 102)
		My_Enter_SubScene(107, 42, 18, 0)
		instruct_30(42, 18, 42, 15)
		null(109, 19)
		dark()
		light()
		say("可恶，钻什么地方去了？", 0, 1)
		dark()
		light()
		say("应该跑不远，我周围再找找看。", 0, 1)
		dark()
		light()
		say("听说胡家后人掌握着一个宝藏的关键，现在胡一刀已死，也不知道还有没有人知道这个宝藏的下落。晚点再去找找那位胡斐小子吧。", 0, 1)
	end

	JY.Person[3].好感度 = 51

	addevent(3, 103, 0, 1165, 3, -2, 40, 23)
	addevent(3, 17, 1, 1166, 1, 9434, 38, 18)
	addevent(3, 23, -2, -2, -2, 10154, 39, 18)
end
OEVENTLUA[1105] = function ()
	Cls()
	dark()
	null(-2, 40)
	light()

	local var_4_0 = 0
	local var_4_1 = JY.Person[0].性别 == 1 and "小姐" or "老爷"

	say("把宝甲交出来，饶你不死。", 203, 1, "五虎门帮众")
	say("啊，救命啊...", 1095, 0, "麦小八")
	say("小八？怎么是你？这是怎么回事？", 0, 1)
	say(var_4_1 .. "，我无意中得到一件宝甲，没想到被五虎门发现了，一路追杀，我大舅也被他们杀了。", 1095, 0, "麦小八")
	say(var_4_1 .. "，小人请" .. var_4_1 .. "主持公道啊!", 1095, 0, "麦小八")
	say("小贼，以为来了帮手就能跑掉吗？大家上，干掉这个家伙好快点回去交差。", 203, 1, "五虎门帮众")

	if WarMain(305) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	null(-2, 38)
	null(-2, 39)
	say("多谢" .. var_4_1 .. "救命之恩。小人别的不会，可从小喜爱马匹，会些驱车打探消息之类的活计。", 1095, 0, "麦小八")
	say("从今日起，愿意追随" .. var_4_1 .. "，为" .. var_4_1 .. "车前马后，必定给" .. var_4_1 .. "行途安排得妥当。", 1095, 0, "麦小八")
	say("哦？你还有这一手本事？", 0, 1)
	say(var_4_1 .. "，小人绝无妄言。另外，这是我得的宝甲，刀枪不入，愿意献于老爷。", 1095, 0, "麦小八")
	addthing(62, 1)
	say("也好，你我也算有缘，你就跟着我吧。", 0, 1)
	say("是，" .. var_4_1 .. "。", 1095, 0, "麦小八")
	say("听说苗大侠和胡大侠在京城决战，你知道在什么地方吗？", 0, 1)
	say("知道知道，听说在京郊皇家猎场。小人这就给" .. var_4_1 .. "去准备马车。", 1095, 0, "麦小八")

	JY.Base.随从1 = 625

	say("（麦小八随队行动）", 0, 2)
	null(-2, 37)
	dark()
	light()
	addevent(109, 2, 0, 1104, 3, 0, -2, -2)
	addevent(109, 19, 0, 0, 0, 8138, -2, -2)
	addevent(109, 30, 0, 0, 0, 8158, -2, -2)
end
OEVENTLUA[1106] = function ()
	Cls()
	say("老丈可是医师？", 0, 1)
	meet_self(4)
	say("正是，若是买药，自己看看柜台上药品，若是瞧病，今日已经挂完号，明日再来！", 4, 0)
	say("老丈，急着救人，得罪了。", 0, 1)
	say("（施展轻功，片刻间将医生带到刚才的房间内。）", 0, 1)
	say("哎，年轻人，你要干什么？", 4, 0)
	dark()
	My_Enter_SubScene(107, 49, 40, 0)
	null(-2, 56)
	addevent(107, 51, 1, 1107, 1, 5168, 48, 39)
	light()
	say("老丈，快帮我看看，我这位朋友中了毒，还请赶快施救。", 0, 1)
	say("哎，现在的年轻人啊，都这么风风火火的。我看看...", 4, 0)
	dark()
	light()
	say("哎，你这朋友似乎是中的苗疆的混毒。这却难了...", 4, 0)
	say("老丈，可有什么办法？", 0, 1)
	say("办法嘛倒是有，我这有解混毒的配方，不过却缺少了一位主药做药引。", 4, 0)
	say("如果你能到药王庄取到七心海棠，尽快赶回来，还来得及救。", 4, 0)
	say("可是我这位朋友如此伤重...", 0, 1)
	say("无妨，我暂时帮你照顾，你快去快回。", 4, 0)
	say("好，多谢老丈。", 0, 1)
	dark()
	null(-2, 104)
	light()
	say("胡大侠如此景况! 胡家离此不远，我得赶快告诉胡家家人。再请他们快马一同赶去药王庄。", 0, 1)
	addevent(0, 100, 1, 1109, 1, 5166, 27, 20)
end
OEVENTLUA[1107] = function ()
	Cls()
	say("取到七心海棠了吗？", 4, 0)
end
OEVENTLUA[1109] = function ()
	Cls()
	null(107, 41)
	null(107, 51)
	meet_self(1)

	if has_thing(202) then
		say(JY.Person[0].称呼 .. "到此寒天雪地，不知有何指教？", 1, 0)
		say("我游历北方，无意间路过此地，敢问兄台尊姓大名？", 0, 1)
		say("在下胡斐。", 1, 0)
		say("哦？就是人称\"雪山飞狐\"的胡斐吗？", 0, 1)
		say("不敢，正是在下。", 1, 0)
		say(JY.Person[0].称呼 .. "远道而来，本该好生接待，只是胡某还有要事，真是遗憾。", 1, 0)
		say("敢问胡兄这是要？", 0, 1)
		say("家父前几日约了人外出，好几日了也没有回来，我准备前去有间客栈看看是不是出了什么事情。", 1, 0)
		say("这事我却是知道一点，听说胡大侠和金面佛约了在京郊比斗。", 0, 1)
		say("原便准备往京城一行，便与胡兄一同前去，略尽绵薄之力。", 0, 1)
		say("既然如此，恭敬不如从命。", 1, 0)
		say("少爷，老仆愿与少爷同往，给公子打探消息。", 1046, 0, "平阿四")
		say("四叔，辛苦你了。", 1, 0)
		say(JY.Person[0].称呼 .. "，咱们这就赶去京城。", 1, 0)

		if instruct_20() then
			Cls()
			say("你的队伍已满。", 1, 0)

			return
		end

		instruct_10(1)
		say("（平四随队行动）", 0, 1)
		addevent(107, 105, 1, 1110, 1, 9376, 6, 45)
	else
		say(JY.Person[0].称呼 .. "到此寒天雪地，不知有何指教？", 1, 0)
		say("敢问这位兄弟是胡大侠什么人？", 0, 1)
		say("在下胡斐，胡大侠正是家父。", 1, 0)
		say("胡大哥，胡大侠与苗人凤比斗，不想中了剧毒，如此如此......", 0, 1)
		dark()
		light()
		say("父亲，孩儿这就去救你。", 1, 0)
		say("且慢，胡大哥，我已经请了京中名师疗伤，只是缺了一味主药，需要尽快到药王庄取到才可。", 0, 1)
		say("这......，多谢" .. JY.Person[0].称呼 .. "。不如这样，我去京城寻找家父，然后到药王庄与你汇合。", 1, 0)
		say("不知" .. JY.Person[0].称呼 .. "可愿先赶到药王庄寻得解药，若是我这儿耽搁了，小兄弟拿到药材只管赶往京城。", 1, 0)
		say("如此也好。", 0, 1)
		say(JY.Person[0].称呼 .. "，大恩不言谢。", 1, 0)
		say("少爷，老爷如今生死未知，老仆愿与少爷同往，给公子打探消息。", 1046, 0, "平阿四")
		say("四叔，辛苦你了。", 1, 0)
		say(JY.Person[0].称呼 .. "，咱们这就出发吧。", 1, 0)
		addevent(49, 8, 1, 1111, 1, 8684, -2, -2)
	end

	dark()
	null(-2, 100)
	null(-2, 6)
	null(49, 1)
	null(49, 4)
	null(49, 6)
	light()
end
OEVENTLUA[1110] = function ()
	Cls()
	say("这位兄弟，请问最近有胡大侠和苗人凤在京郊比武，你可知道...？", 0, 1)
	dark()
	null(-2, 105)
	light()
	say("刚问两句就跑了，一定有问题，追！", 1, 0)
	My_Enter_SubScene(107, 46, 39, 0)
	say("刚跑到这附近不见了！", 1, 0)
	say("跑不远，附近我们再找找。", 0, 1)
	dark()
	light()
	addevent(107, 106, 1, -2, 1, 5186, 41, 41)
	say("少爷，我在京城瞧见一个人，是当年的闫医生。", 20, 1, "平阿四")
	My_Enter_SubScene(107, 46, 39, 2)
	say(" 是他？在什么地方？", 1, 0)
	say("少爷，我这就带你过去。", 20, 1, "平阿四")
	say("老仆还听见他们说什么药王庄什么的？似乎要去抢什么药书和剧毒之物。", 20, 1, "平阿四")
	say("药书和剧毒之物？只怕和我爹这次中的毒有些关系。", 1, 0)
	say("这...，" .. JY.Person[0].称呼 .. "，不知我可能将一件事托付与你？", 1, 0)
	say("胡大哥有事尽管开口，你我一见如故，有事定当帮忙。", 0, 1)
	say("我想请" .. JY.Person[0].称呼 .. "，先赶到药王庄阻止此事，如是可能，打听这些人有什么阴谋。", 1, 0)
	say("如此也好。胡大哥，我这便去了。", 0, 1)
	say("好。四叔，带我去吧，我们先找到我爹爹再与少侠汇合。", 1, 0)
	say("少爷，老仆从闫基那儿偷到了这本书。", 20, 1, "平阿四")
	instruct_35(1, 0, 67, 600)

	JY.Person[1].耍刀技巧 = JY.Person[1].耍刀技巧 + 20
	JY.Person[1].攻击力 = JY.Person[1].攻击力 + 20
	JY.Person[1].轻功 = JY.Person[1].轻功 + 20
	JY.Person[1].修炼物品 = 136

	dark()
	null(-2, 106)
	light()
	instruct_21(1)
	addevent(49, 8, 1, 1111, 1, 8684, -2, -2)
end
OEVENTLUA[1111] = function ()
	Cls()
	meet_self(2)
	say("这位姑娘，请问这里是药王庄吗？", 0, 1)
	say("你到药王庄干吗？", 2, 0)

	if has_thing(202) then
		say("听闻药王前辈医术超绝，在下前来求取一些解毒药物。", 0, 1)
	else
		say("我有位朋友中了毒，我们特地来求药王赐些解药，请姑娘指点途径。", 0, 1)
	end

	say("你到那边粪池去装小半桶粪，到溪里加满清水，帮我把这块花浇一浇。", 2, 0)
	say("（这姑娘说话怎么毫不客气，罢了，帮她挑一担粪又有何妨。）好。", 0, 1)
	dark()
	light()
	say("这时夕阳已落到山坳，金光反照，射在一大片蓝花之上，辉煌灿烂，甚是华美", 0, 2)
	say("只见那姑娘站在花丛中，面色娇美，丽若朝霞", 0, 2)
	say("（你不由呆了一呆！） 这些花当真好看！", 0, 1)
	say("那边有株药草，我够不着，你帮我采来吧。", 2, 0)
	say("好。", 0, 1)
	say("算了，他们就要来了，你别动。", 2, 0)
	say("啊？", 0, 1)
	dark()
	addevent(-2, 14, 0, 0, 0, 5298, -2, -2)
	addevent(-2, 13, 0, 0, 0, 6786, -2, -2)
	addevent(-2, 12, 0, 0, 0, 6786, -2, -2)
	addevent(-2, 15, 0, 0, 0, 6786, -2, -2)
	light()
	say("嘿嘿，小丫头警觉性倒高，你就是无嗔那贼秃的小徒弟？", 1043, 0, "石万嗔")
	instruct_0()
	say("程师妹，见了师叔怎不快磕头？", 1016, 1, "慕容景岳")
	instruct_0()
	say("咱们哪里钻出师叔来啦？没听见过。", 2, 0)
	instruct_0()
	say("毒手神枭的名字听过没有？你师父难道从来不敢提我吗？", 1043, 1, "石万嗔")
	instruct_0()
	say("这名字倒听见过的。我师父说他从前确是有过一个师弟，只是他滥用毒药害人，不守门规，早给师祖逐出门墙了。石前辈，那便是你么？", 2, 0)
	instruct_0()
	say("臭丫头，敬酒不吃吃罚酒！", 1043, 1, "石万嗔")
	say("小心！", 0, 1)

	if WarMain(306) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	instruct_37(1)
	say("使钩中之一人眼见不敌，竟向那姑娘扑去", 0, 2)
	say("姑娘小心！", 0, 1)
	addevent(-2, 5, 1, -2, 1, 8372, -2, -2)
	say("却见门外突然扑出一人，身法迅快至极，一闪就到了姑娘面前，左手一推，右手大刀一横", 0, 2)
	say("只听一声闷哼，然后扑通一声", 0, 2)
	say("却是那人已经被一刀劈得飞跌出去。你定睛一看，刚才抢出的却是胡斐胡少侠", 0, 2)
	say("居然来这么多帮手，走！小姑娘，我还会再来的。", 1043, 0, "石万嗔")
	dark()
	null(-2, 15)
	null(-2, 12)
	null(-2, 13)
	null(-2, 14)
	light()
	say("胡大哥，你来得正好。", 0, 1)
	addevent(-2, 5, 1, 1112, 1, 8342, -2, -2)
	say("所幸没让那奸人得逞。这位姑娘是？", 1, 0)
	say("多谢两位少侠今番相助。", 2, 1)
	say("我是程灵素。毒手药王是我师父。", 2, 1)

	if JY.Base.畅想编号 == 2 then
		say("连名字都是一样，真是好生奇异。", 0, 1)
	end

	if has_thing(202) then
		say("我们打听得有人要到药王庄抢夺毒物和医书，因此赶来相助。", 1, 0)
		say("幸好来得及时。", 0, 1)
		say("多谢两位少侠。那是我本门师叔石万嗔，因为常用毒药害人，被师父赶出了师门。", 2, 0)
		say("几年前偷走了断肠草，现在听说师父去世了，又要来抢走本门至宝七心海棠和师父留下的宝典。", 2, 0)
		say("听说和天龙门的人混在一处，只怕又是要去害人。", 2, 1)
		say("天龙门？田归农？只怕这还是要对付我胡家。" .. JY.Person[0].称呼 .. "，我们回京城再打探打探，刚才几人定然还会去京城与人汇合。", 1, 0)
		say("好，姑娘，这便告辞了。", 0, 1)
		say("等等，胡大哥，我愿和你们同去京城。石万嗔是本门叛徒，如今又要去害人，却是不能不管。", 2, 0)
		say("如此正好，事不宜迟，我们这就赶回京城吧。", 0, 1)
	else
		say("程姑娘，不知药王前辈可在，我爹爹中了剧毒，还请药王救治。", 1, 0)
		say("我师父已经过世了。", 2, 0)
		say("那这该如何是好？", 0, 1)
		say("我跟师父学医10余年，倒也知道些使毒解毒的法子。", 2, 0)
		say("既然是胡大哥父亲有难。小女愿意跟胡大哥前去救治。", 2, 0)
		say("如此正好，事不宜迟，我们这就赶回京城吧。", 0, 1)
	end

	addevent(49, 8, 1, 1113, 1, 8684, -2, -2)
	addevent(107, 23, 1, 1115, 1, -2, -2, -2)
	addevent(107, 24, 1, 1115, 1, -2, -2, -2)
	addevent(107, 25, 1, 1115, 1, -2, -2, -2)

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 1, 0)

		return
	end

	instruct_10(1)
	null(-2, 5)
	say("胡斐加入队伍", 0, 2)

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 2, 0)

		return
	end

	instruct_10(2)
	say("程灵素加入队伍", 0, 2)
	null(-2, 8)
end
OEVENTLUA[1112] = function ()
	Cls()
	say("咱们走吧。", 1, 0)

	if instruct_20() then
		Cls()
		say(JY.Person[0].称呼 .. "，你的队伍已满。", 1, 0)

		return
	end

	instruct_10(1)
	say("胡斐加入队伍", 0, 2)
	null(-2, 5)
end
OEVENTLUA[1113] = function ()
	Cls()

	if inteam(1) then
		say("胡大哥，咱们走吧。", 2, 0)

		if instruct_20() then
			Cls()
			say(JY.Person[0].称呼 .. "，你的队伍已满。", 2, 0)

			return
		end

		instruct_10(2)
		say("程灵素加入队伍", 0, 2)
		null(-2, 8)
	else
		say("胡大哥一看就是好男儿。", 2, 0)
	end
end
OEVENTLUA[1115] = function ()
	say("金面佛苗大侠这次做了好大的事情，听说丐帮范帮主被大内高手抓了去。", 1099, 1, "酒客")
	say("苗大侠一怒之下杀入大内救人。将大内18高手连杀了11人才安然退走。", 1099, 0, "酒客")
	say("好厉害，不知最后救得范帮主没有？", 1093, 1, "酒客")
	say("那就不知道了。苗大侠英雄无敌，当真当得这天下无敌的称号。", 1099, 0, "酒客")
	say("这还不算什么。听说苗大侠杀了胡一刀胡大侠，跟着又杀入天龙门杀了天龙门门主田归农。当真是不得了。", 1099, 1, "酒客")
	say("这等豪气！不知我何时能有苗大侠这般本领。", 1093, 0, "酒客")
	say("你说什么？苗人凤杀了胡一刀胡大侠？", 0, 1)
	say("正是。听说苗大侠与胡大侠相约比斗，斗了几日也不分胜负，两人彼此都很佩服，因此相约交换武器，在京城祭天台附近继续比试。", 1099, 0, "酒客")
	say("斗了半日，苗大侠一刀划伤了胡大侠手臂，同时也被胡大侠的后着踢倒在地，不想不知怎的刀上喂了剧毒，胡大侠才会毒发死亡。真是可惜一代大侠...", 1099, 1, "酒客")
	say("只怕这事与天龙门田归农脱不了关系！不然何以苗大侠比武后这般追杀与他。", 1093, 0, "酒客")
	say("有理，有理！", 1099, 1, "酒客")

	if inteam(1) then
		say("爹爹！我定为你报仇！", 1, 0)

		if has_thing(202) then
			say("胡大哥，我来助你。", 0, 1)
		else
			say("怎么会！我将胡大侠托付给了那京城医师，难道没有能拖延一下毒性？", 0, 1)
			say("这个虽然不知，不过你说的那个京城医师已经不见了。", 20, 0, "平阿四")
			say("胡兄，这事却是我鲁莽了，害了令尊。", 0, 1)
			say("这事须怪不得你。你当时是做的最妥当的法子。我们总会找到这医师，知道这是怎么回事的。", 1, 0)
		end

		dark()
		addevent(107, 110, 1, -2, 1, 5186, 25, 42)
		light()
		say("少爷，我打探得一帮武林人士往玉笔山庄去了，说是要去探闯王宝藏。", 20, 1, "平阿四")
		say("许多的武林人士，还有大内总管刘大人，天龙门诸人，听说苗人凤也赶去了。", 20, 1, "平阿四")
		say("玉笔山庄？", 0, 0)
		say("那是东北极寒之地的一个避世山庄，少侠，可愿与我同去玉笔山庄看看？这些人与我爹爹的死只怕都脱不了关系。", 1, 1)
		say("好，胡大哥的事就是我的事。", 0, 0)

		local var_12_0 = 0
		local var_12_1 = JY.Person[0].性别 == 1 and "小姐" or "老爷"

		if JY.Base.随从1 == 625 then
			say(var_12_1 .. "，小人这就给" .. var_12_1 .. "去准备马车。", 1095, 1, "麦小八")
		end

		null(-2, 110)
		instruct_39(120)
		addevent(120, 99, 0, 1116, 3, -2, 26, 48)
	end
end
OEVENTLUA[1116] = function ()
	Cls()

	if inteam(1) then
		dark()
		addevent(120, 100, 1, -2, 1, 7140, 22, 35)
		addevent(120, 101, 1, -2, 1, 9136, 23, 35)
		light()
		say("范兄，你如何在这里，你逃出来了？", 3, 0)
		say("正是。苗兄，我刚逃出来，就听说你为了救我大闹京城，苗兄高义啊！", 1154, 1, "范帮主")
		say("你我兄弟，你被鹰爪抓了，我自然要赶去相救。这却不提，今日相逢，却是要为范兄庆祝一下。", 3, 0)
		say("正当如此，今日是要借杜庄主宝地一用了，走。", 1154, 1, "范帮主")
		dark()
		addevent(120, 101, 1, -2, 1, 5212, 23, 35)
		light()
		say("啊~，范兄，你干什么？", 3, 0)
		say("苗兄，我们等你很久了。", 1009, 1, "刘大人")
		addevent(120, 102, 1, -2, 1, 6778, 27, 37)
		addevent(120, 103, 1, -2, 1, 6778, 25, 34)
		addevent(120, 110, 1, -2, 1, 6778, 25, 37)
		say("却见那范帮主从苗人凤后面突然使出了鹰爪擒拿手，死死抓住苗人凤双肩穴道。", 0, 1)
		say("几个大内高手从四处闪出，将苗人凤团团围住。", 0, 1)
		say("无耻小人！", 1, 0)
		say(JY.Person[0].称呼 .. "，我绕到后面包抄，你去相助苗大侠。你看可好？", 1, 0)
		say("好，胡大哥，就如此办。", 0, 1)
		instruct_21(1)
		null(70, 5)
		instruct_21(2)
		null(70, 6)
		say("那苗人凤果然厉害，纵是受了暗算，仍是勇猛异常，转眼将大内高手打飞几人，眼见剩下完好的也没有几人了。", 0, 2)
		say("苗人凤似也受伤不轻，站在那儿一动不动，你急忙赶将上去。", 0, 2)
		say("一群无耻小人，今日都留在这儿吧！", 0, 1)
		My_Enter_SubScene(120, 25, 38, 0)

		if WarMain(307) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		null(-2, 99)
		null(-2, 100)
		null(-2, 101)
		null(-2, 102)
		null(-2, 103)
		null(-2, 110)
		instruct_37(1)
		addevent(120, 104, 0, 1117, 3, -2, 26, 20)
		addevent(120, 109, 0, 1117, 3, -2, 27, 20)
		addevent(120, 105, 1, 1118, 1, 5166, 25, 9)
		addevent(120, 108, 1, 1120, 1, 8684, 25, 11)
		addevent(120, 107, 1, 1119, 1, 6298, 27, 9)
		addevent(120, 106, 1, 1119, 1, 9138, 25, 13)
	end
end
OEVENTLUA[1117] = function ()
	Cls()
	dark()
	null(-2, 104)
	null(-2, 109)
	light()
	say(JY.Person[0].称呼 .. "，我在这儿。", 1, 0)
	instruct_30(26, 20, 26, 17)
	say("这位姑娘是？", 0, 1)
	say("见过少侠，我是苗若兰。多谢刚才少侠救了我爹爹！", 353, 0, "苗若兰")
	say("胡大哥，你怎么和苗姑娘在一块儿？", 0, 1)
	say("此事说来话长。苗大侠，我是胡一刀的儿子胡斐。", 1, 0)
	say("你是来找我报仇的么？", 3, 1, "苗人凤")
	say("我爹爹是因为你才死的，自然是要找你报仇。", 1, 0)
	say("胡大哥！", 353, 1, "苗若兰")
	say("不过若兰已经和我讲了比武时的情况，其中还有隐情，待我查清了所有原委再来找你。", 1, 0)
	say("程姑娘，苗大侠受伤不轻，不知你可能留在这儿为苗大侠治疗？", 1, 0)
	say("我看看。", 2, 1)
	dark()
	light()
	say("苗大侠受了些内伤，不妨事，待我照看几天就可好了。", 2, 1)
	say(JY.Person[0].称呼 .. "，玉笔山庄来了不少武林人士，现在应该都往闯王宝藏去了，咱们也过去看看吧。", 1, 0)
	say("真的有闯王宝藏？", 0, 1)
	say("自然是有的，并且就在这玉笔山庄脚下，咱们赶快过去吧。", 1, 0)
	dark()
	addevent(120, 108, 1, 1119, 1, 6298, 25, 11)
	addevent(120, 107, 1, 1120, 1, 8684, 27, 9)
	instruct_39(84)
	addevent(84, 14, 0, 1153, 3, -2, -2, -2)
	light()

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 1, 0)

		return
	end

	instruct_10(1)
	say("胡斐加入队伍", 0, 2)
	null(-2, 105)
end
OEVENTLUA[1118] = function ()
	Cls()
	say("胡兄。", 1, 0)

	if instruct_20() then
		Cls()
		say(JY.Person[0].称呼 .. "，你的队伍已满。", 1, 0)

		return
	end

	instruct_10(1)
	say("胡斐加入队伍", 0, 2)
	null(-2, 105)
end
OEVENTLUA[1119] = function ()
	Cls()
	say("父亲，你这伤", 353, 0, "苗若兰")
	say("不用担心，这点小伤还要不了我的命。", 3, 1, "苗人凤")
end
OEVENTLUA[1120] = function ()
	Cls()
	say("苗大侠，你喝了这些药，最近先不要练功了。", 2, 0)
	say("好好，只是突然闲下来有些不习惯。", 3, 1, "苗人凤")
	say("爹爹，你听程姑娘的话，先将身体调养好才好。", 353, 0, "苗若兰")
end
OEVENTLUA[1150] = function ()
	if inteam(1) and has_thing(202) == false then
		dark()
		null(-2, 8)
		null(-2, 99)
		light()
		say("这儿就是当年闯王埋下的宝藏了，本来是准备留备以后起事，可惜", 1, 0)
		say("这儿有个机关。", 1, 0)
		dark()
		light()
		instruct_14()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_17(-2, 1, 21, 21, 0)
		instruct_17(-2, 1, 20, 20, 3694)
		instruct_17(-2, 1, 20, 21, 4064)
		Cls()
		instruct_13()
	elseif has_thing(202) then
		say("这儿有个机关，正好可以插进闯王军刀。", 0, 1)
		dark()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_17(-2, 1, 21, 21, 0)
		instruct_17(-2, 1, 20, 20, 3694)
		instruct_17(-2, 1, 20, 21, 4064)
		null(-2, 99)
		null(-2, 8)
		addevent(84, 110, 1, -2, 1, 8322, 24, 22)
		light()
		say(JY.Person[0].称呼 .. "，我有个疑惑不知你可否给解答一下？", 1, 0)
		My_Enter_SubScene(84, 20, 22, 1)
		say("什么事？胡大哥。", 0, 1)
		say("你说过我爹爹的事你都是听说的，不知你可曾见过我爹爹？", 1, 0)
		say("自然是没有。", 0, 1)
		say("那么你身上的闯王宝刀从何而来？闯王宝刀乃是我胡家家传宝物，我爹爹随身佩带的。", 1, 0)
		say("......这，胡大哥，那是我无意中得到的。", 0, 1)
		say("那不知你身上的四象步法和胡家刀法从何而来？", 1, 0)
		say("......你，你翻看过我的包裹？", 0, 1)
		say("我自然是没有翻看过，不过你当日去看比武时被人看见了，而四叔又打探到了这个消息。", 1, 0)
		say("我就怀疑你主动接近我是为什么？果然一探就发现了你的底细。", 1, 0)
		say("我爹爹是你杀死的？（胡斐的眼光炯炯看着你）", 1, 0)
		say("绝无此事，你爹爹确实是中毒而亡。", 0, 1)
		say("那我爹爹身上的东西如何到了你这里？", 1, 0)
		say("......这，胡大哥，我当时不知那是你爹爹，只是想贪个小便宜。", 0, 1)
		say("（目光炯炯的看着你）道不同不相为谋，你好自为之。", 1, 0)
		instruct_21(1)

		if inteam(2) then
			instruct_21(2)
			null(70, 6)
		end

		if inteam(632) then
			say("可恶。", 331, 0)
			instruct_21(632)
			null(70, 6)
		end

		if inteam(54) then
			say("我真是看错你了，道不同不相为谋。", 54, 0)
			dark()
			light()
			instruct_21(54)
			null(70, 51)
		end

		null(-2, 110)
		say("远处似乎传来一阵隆隆的声音，响了半饷", 0, 2)
		addevent(84, 102, 1, -2, 1, 3774, 17, 46)
		addevent(84, 103, 1, 1158, 1, 3774, 18, 46)
		addevent(84, 104, 1, -2, 1, 3774, 19, 46)
		say("离开就离开吧，宝藏啊到手也。", 0, 1)
	else
		say("一扇巨大厚重的铁门挡住了去路", 0, 2)
	end

	null(120, 107)
	null(120, 106)
	null(120, 108)
	addevent(120, 109, 0, 1168, 3, -2, 27, 20)
	addevent(120, 104, 0, 1168, 3, -2, 26, 20)
	addevent(0, 101, 0, 1169, 3, -2, 26, 26)
	addevent(0, 103, 1, -2, 1, 8684, 25, 20)
	addevent(0, 104, 1, -2, 1, 6298, 26, 20)
	addevent(0, 105, 1, -2, 1, 9138, 25, 22)
	addevent(0, 106, 1, -2, 1, 5186, 24, 21)
end
OEVENTLUA[1151] = function ()
	instruct_14()
	instruct_13()
	say("呼啊~", 213, 0)
	say("什么东西？", 0, 1)

	if WarMain(5, 0, 1, 1) == false then
		instruct_15()
		Cls()
		Cls()

		return
	end

	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
end
OEVENTLUA[1152] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3496, 3496, 3496, -2, -2, -2)
	Cls()
	instruct_2(16, 1)
	Cls()
	Cls()
end
OEVENTLUA[1153] = function ()
	dark()
	null(-2, 14)
	light()
	say("漆黑的通道里突然窜出几个黑影", 0, 2)
	say("呼啊~", 213, 0)
	say("什么东西？", 0, 1)

	if WarMain(6, 0) == false then
		instruct_15()
		Cls()
		Cls()

		return
	end

	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	dark()
	light()

	if inteam(1) then
		say("慢，有点不对。咱们进来这么久了，怎么还没看见前面进来的人？即便他们武功再高，也不能经过刚才的雪人聚集地而不留下痕迹。", 1, 0)
		say(JY.Person[0].称呼 .. "反应不错啊，动手！", 1043, 0, "石万嗔")
	end

	dark()
	addevent(84, 6, 1, 0, 1, 7034, -2, -2)
	light()
	say("几位小兄弟，我们跟在你们后面很久了。", 1009, 0, "刘大人")

	for iter_21_0 = 0, CC.TeamNum do
		if inteam(iter_21_0) then
			JY.Person[iter_21_0].内力 = JY.Person[iter_21_0].内力 - 1000
			JY.Person[iter_21_0].中毒程度 = 60
			JY.Person[iter_21_0].体力 = 20
		end
	end

	if WarMain(308, 0) == false then
		instruct_15(0)
		instruct_0()

		do return end

		Cls()
	end

	null(84, 6)
end
OEVENTLUA[1154] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	instruct_2(174, 5000)
	instruct_2(16, 1)
	Cls()
	Cls()
end
OEVENTLUA[1155] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(158, 1)
	instruct_2(174, 4000)
	Cls()
	Cls()
end
OEVENTLUA[1156] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	instruct_2(174, 5000)
	Cls()
	Cls()
end
OEVENTLUA[1157] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	instruct_2(145, 1)
	instruct_2(174, 2000)
	addevent(3, 5, 1, 1170, 1, -2, -2, -2)
	addevent(3, 6, 1, 1170, 1, -2, -2, -2)
	addevent(3, 8, 1, 1170, 1, -2, -2, -2)
	addevent(107, 24, 1, 1170, 1, -2, -2, -2)
	addevent(107, 25, 1, 1170, 1, -2, -2, -2)
	addevent(107, 23, 1, 1170, 1, -2, -2, -2)
	addevent(107, 113, 1, 1172, 1, 9196, 37, 40)
	addevent(107, 114, 1, -2, 1, 6094, 36, 39)
	addevent(107, 115, 1, -2, 1, 6094, 38, 39)
	addevent(40, 0, 0, 1171, 3, -2, -2, -2)
	addevent(40, 1, 1, -2, 1, 5168, -2, -2)
	addevent(40, 2, 1, -2, 1, 9052, -2, -2)
end
OEVENTLUA[1158] = function ()
	Cls()
	dark()
	light()
	say("（只见一块巨石将山洞入口牢牢堵住，一丝缝隙都没有。）", 0, 1)
	say("（这是，你大惊失色，转瞬明白，只怕是胡斐出去后用巨石将洞口封死。）", 0, 1)
	say("（他最后说好自为之，是说我若当时和他一同出洞即可离去？）", 0, 1)
	say("（不由一阵沮丧）如今怎么是好？", 0, 1)
	dark()
	light()
	say("......一天时间过去了......", 0, 1)
	addtime(1)
	addevent(84, 105, 1, 1159, 1, 3774, 18, 46)
end
OEVENTLUA[1159] = function ()
	Cls()
	dark()
	light()
	say("（你在洞里四处探查，然而四处都没有出口。）", 0, 1)
	say("(难道今天要死在这儿？)", 0, 1)
	say("......又一天时间过去了......", 0, 1)
	dark()
	light()
	addtime(1)
	addevent(84, 106, 1, 1160, 1, 3774, 18, 46)
end
OEVENTLUA[1160] = function ()
	Cls()
	dark()
	light()
	say("（洞里虽有一些冰水可以解渴，然而什么吃的都没有。）", 0, 1)
	say("（摊在地上），不行了，不行了，要饿死了。", 0, 1)
	say("......又一天时间过去了......", 0, 1)
	dark()
	light()
	addtime(1)
	addevent(84, 107, 1, 1161, 1, 3774, 18, 46)
end
OEVENTLUA[1161] = function ()
	Cls()
	dark()
	light()

	local var_29_0 = 0
	local var_29_1 = JY.Person[0].性别 == 1 and "大姐姐" or "大哥"

	if has_thing(222) then
		addevent(84, 108, 1, 1162, 1, 9434, 18, 47)
		say(var_29_1 .. "，你在里面吗？", 327, 0, "田青文")
		say("青文妹子，是你吗？", 0, 1)
		say(var_29_1 .. "，是我，你没事吧？", 327, 0, "田青文")
		say("青文妹子，快把洞口弄开让我出去，我快不行了。", 0, 1)
		say(var_29_1 .. "，你别着急，我这就放你出来。", 327, 0, "田青文")
		say("（接着传来咔咔的挖掘声，......断断续续响了一夜）", 0, 1)
		say("......又一天时间过去了......", 0, 1)
		dark()
		light()
		addtime(1)
		dark()
		null(-2, 103)
		null(-2, 105)
		null(-2, 106)
		null(-2, 107)
		light()
		say(var_29_1 .. "，你还好吧？", 327, 0, "田青文")
		say("只见田青文一身都是泥水，脸也脏的和花猫也似", 0, 2)
		say("虽然神色很是疲惫，然而看见了你却露出放心的笑容", 0, 2)
		say(var_29_1 .. "!", 327, 0, "田青文")
		say("青文妹子，我没事，谢谢你。", 0, 1)
		say(var_29_1 .. "!（只是看着你温柔的笑）", 327, 0, "田青文")
		say("青文妹子，我们走吧，都快饿死了。", 0, 1)
		say(var_29_1 .. "，我想去京城找我爹爹。", 327, 0, "田青文")
		say("好，我带你去。", 0, 1)

		if instruct_20() then
			Cls()
			say(var_29_1 .. "，你的队伍没位置了。", 327, 0)
		else
			instruct_10(633)
			null(-2, 108)
			null(3, 17)

			JY.Person[633].好感度 = 70
		end
	else
		say("完了，那老头还说我是天命之人，有被饿死的天命之人吗？", 0, 1)
		say("完蛋了......", 0, 1)
		dark()
		light()
		say("你不是因为闯王宝藏第一个被困死的人，也不是最后一个", 0, 2)
		instruct_15(0)
		instruct_0()
	end
end
OEVENTLUA[1162] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，我想去京城找我爹爹。", 327, 0, "田青文")
	say("好，我带你去。", 0, 1)

	if instruct_20() then
		Cls()
		say("你的队伍没位置了。", 327, 0)

		return
	end

	instruct_10(633)
	null(-2, 108)
	null(3, 17)

	JY.Person[633].好感度 = 70
end
OEVENTLUA[1165] = function ()
	Cls()
	dark()
	null(-2, 103)
	light()
	say("你离我远点。", 327, 0, "田青文")
	say("你跟不跟我走？", 1061, 0, "陶子安")
	say("你若不肯跟我走，休得怪我动手了！", 1061, 0, "陶子安")
	meet_self(633)
	say("住手！", 0, 1)

	if WarMain(309) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("哼，又是你的姘头吗？别以为他保得了你。", 1061, 0, "陶子安")

	JY.Person[633].好感度 = 60

	null(-2, 23)
end
OEVENTLUA[1166] = function ()
	Cls()
	say("姑娘你没事吧。", 0, 1)
	say("我没事，多谢少侠！（微微低着头，凝脂般的雪肤之下，隐隐透出一层胭脂之色）", 327, 0, "田青文")
	say("（不由抬头仔细望去，只见她双睫微垂，一股女儿羞态，娇艳无伦，不由得胸中一荡）", 0, 1)
	say("刚才那是？", 0, 1)
	say("让少侠见笑了，那是我师兄。", 327, 0, "田青文")
	say("哦，这...", 0, 1)
	say("虽然是我师兄，不是少侠相帮的话，不知道事情会变怎样。", 327, 0, "田青文")
	say("那就好，姑娘这是要去往何处？", 0, 1)
	say("我从小就没出过远门，最近父亲出去办事，我便偷偷跟着跑出来啦！", 327, 0, "田青文")
	say("不知少侠可愿意陪我到雪林走走，在南方就没有这样的雪景。", 327, 0, "田青文")
	say("好。", 0, 1)
	null(-2, 104)
	addevent(3, 107, 1, -2, 1, 9434, 3, 26)
	My_Enter_SubScene(3, 4, 26, 0)
	say("（但见白雪皑皑，松林在雪中傲然挺立，每当有风吹过，一片片迷茫的雪雾便飘然在林间飘散开来。）", 0, 1)
	say("好美，能常住在北方就好了，每天都能看这样的美景。", 327, 0, "田青文")
	say("要每天都住在这里，这样的景色你就会看腻了。", 0, 1)
	say("会么？（但见她笑靥如花，红唇微微颤动，露出一口玉石般的牙齿，不由呆了）", 327, 0, "田青文")
	say("（天色将晚，空气微微有些泛凉）", 0, 1)
	say("好了，雪景也看过了，我有些乏了，要回客栈去休息了。", 327, 0, "田青文")
	say("少侠，我还要在这附近待几天，咱们有缘再见。", 327, 0, "田青文")
	null(-2, 107)
	addevent(3, 17, 1, 1167, 1, 9434, 38, 18)
	dark()
	light()
	say("过了一晚上", 0, 2)
	addtime(1)
end
OEVENTLUA[1167] = function ()
	Cls()

	local var_33_0 = 0
	local var_33_1 = JY.Person[0].性别 == 1 and "大姐姐" or "大哥"

	if has_thing(222) then
		say(var_33_1 .. "，你还没有走啊。", 327, 0, "田青文")
		say(var_33_1 .. "可原陪我出去转转？", 327, 0, "田青文")
		say("恭敬不如从命！", 0, 1)

		if inteam(91) then
			say("哼，算我看错你了。", 91, 0)
			instruct_21(91)
			null(70, 109)
		end

		dark()
		light()
		say("一天过去", 0, 2)
		addtime(1)
	else
		say("姑娘，你还在这儿啊！", 0, 1)
		say(var_33_1 .. "。（微微低着头，脸又有些红了）", 327, 0, "田青文")
		say("不知姑娘还要去往何处，若是同路，不妨同行。", 0, 1)
		say("多谢少侠。只是我要在这等我爹爹，等他办完事就一块回家。", 327, 0, "田青文")
		say("如此，不知何时才能与姑娘再次相见！敢请教姑娘芳名？", 0, 1)
		say("我叫田青文，我爹爹是天龙门田归龙。", 327, 0, "田青文")
		say("田归龙，我似乎听过这个名字。", 0, 1)
		say(var_33_1 .. "，你若见了我爹爹，烦请告诉我爹爹一声我在有间客栈等他。", 327, 0, "田青文")
		say("好，我叫你青文妹子可好，希望我们能有缘再见。", 0, 1)
		say(var_33_1 .. "，...，这个手绢送给你，做个纪念。", 327, 0, "田青文")
		say("多谢青文妹子，我走了。", 0, 1)

		if inteam(91) then
			say("哼，不知羞。", 91, 0)
		end

		addthing(222, 1)
		dark()
		My_Enter_SubScene(3, 20, 28, 3)
		light()
	end
end
OEVENTLUA[1168] = function ()
	dark()
	null(-2, 104)
	null(-2, 109)
	light()
	say("人都到哪去了？", 0, 1)
end
OEVENTLUA[1169] = function ()
	Cls()
	dark()
	null(120, 104)
	null(120, 109)
	null(-2, 101)
	light()

	if has_thing(202) then
		say("胡斐呢？他在哪儿？", 0, 1)
		say("胡斐在此！", 1, 0)
		dark()
		addevent(0, 107, 1, -2, 1, 5166, 27, 20)
		addevent(0, 105, 1, -2, 1, 9132, 25, 22)
		light()
		say("你居然能出来？了不起，我记得闯王宝藏没有其他的密道了啊？", 1, 0)
		say("胡兄，！你把我害的好苦。", 0, 1)
		say("你待怎样？", 1, 0)
		say("江湖儿女，自然是有恩报恩，有仇报仇。", 0, 1)
		say("好，我们出去解决！", 1, 0)
		instruct_35(1, 0, 67, 999)
		instruct_35(1, 1, 44, 999)
		instruct_48(1, 700)
		instruct_46(1, 2000)
		instruct_45(1, 100)
		instruct_47(1, 100)
		instruct_43(1, 100)
		AddPersonAttrib(1, "耍刀技巧", 100)
		AddPersonAttrib(1, "御剑能力", 50)

		JY.Person[1].中毒程度 = 0

		if WarMain(310) == false then
			instruct_15(0)
			instruct_0()

			do return end

			Cls()
		end

		say("住手，休得伤我家少爷！（却是平阿四眼见胡斐危机，跳上来替胡斐挡了这一击）", 20, 0, "平阿四")
		dark()
		null(-2, 106)
		light()
		say("好凶狠的小辈！", 3, 0, "苗人凤")
		say("胡大哥，我们来帮你。", 2, 1)
		say("天下无敌苗大侠，好大的名头，我看也不怎么样嘛。", 0, 1)
		instruct_46(2, 1000)
		instruct_48(2, 300)
		instruct_45(2, 30)
		instruct_47(2, 30)
		instruct_46(632, 1000)
		instruct_48(632, 500)
		instruct_45(632, 40)
		instruct_47(632, 40)

		if WarMain(311) == false then
			instruct_15(0)
			instruct_0()

			do return end

			Cls()
		end

		instruct_37(-10)
		null(-2, 103)
		null(-2, 104)
		null(-2, 105)
		null(-2, 107)
		say("可惜了，可惜了，一代大侠埋骨于此，何苦呢。", 0, 1)

		if has_thing(136) == false then
			addthing(136, 1)
		end

		if has_thing(117) == false then
			addthing(117, 1)
		end
	elseif inteam(1) then
		addevent(0, 107, 1, -2, 1, 5166, 25, 21)
		say("苗大侠，你怎么样了？", 0, 1)
		say("药王传人果然名不虚传，我已经好多了。", 3, 0, "苗人凤")
		say("苗姑娘，你可还好？", 1, 1)
		say("多谢胡大哥挂怀。", 353, 0, "苗若兰")
		say("少爷，我找到老爷的遗骨了，葬在了胡家后山。", 20, 1, "平阿四")
		say("爹爹！(不由留下两行泪来)", 1, 0)
		say("胡大哥，咱们一会去拜祭胡大侠。", 0, 1)
		say("哎，我对不起胡兄弟，贤侄，你动手吧。", 3, 0, "苗人凤")
		say("苗大侠，我虽然敬重你的为人，然而父仇不能不报。", 1, 1)
		say("哎，我这些年都在后悔当年失手杀了胡大哥。", 3, 0, "苗人凤")
		say("胡大哥！", 353, 1, "苗若兰")
		say("胡大哥！", 2, 0)
		say("杀了我后你们再去杀了那个叫闫基的医生，当年就是他和田归农狼狈为奸，在刀上抹了剧毒。", 3, 1, "苗人凤")
		say("如今田归农已经被我杀了，你再杀了闫基这仇就报全了。", 3, 1, "苗人凤")
		say("动手吧。", 3, 1, "苗人凤")
		say("好！（将到高高举起，像苗人凤头上砍去）", 1, 0)
		say("只见苗人凤神色平静，不但不惧，反而隐隐有释然之色", 0, 2)
		say("爹！胡大哥！", 353, 1, "苗若兰")
		say("（忽然将刀停下,道）苗大侠，你也算是被人陷害，倒也罪不至死。（不由左右为难）", 1, 0)
		instruct_30(26, 26, 26, 24)
		say("胡大哥，这事不能全怪苗大侠，他也是被人陷害。", 0, 1)
		say("如今胡大侠已经去了，不如由苗大侠守墓三年，向胡大侠赔罪，你看可好？", 0, 1)
		say("也好，苗大侠可愿意？", 1, 0)
		say("我杀错了胡兄弟，不要说守墓3年，就是10年，也是轻的了。", 3, 1, "苗人凤")
		say("胡大哥！你不杀我爹爹了？", 353, 0, "苗若兰")
		say("我爹和你爹惺惺惜惺惺，我想他若在的话，也不会想我下手的。", 1, 1)
		Cls()
		dark()
		light()
		say("两天后的早晨", 0, 2)
		addtime(2)
		say("苗大侠，不知可能指点我等后辈武学？", 0, 1)
		say("我当年和你爹比试了数日，对胡家刀法也算了解透彻，便给你们演练一番。", 3, 0, "苗人凤")
		addtime(10)

		if JY.Person[0].耍刀技巧 == 99 then
			say("前辈，最近我练功毫无寸进，还请前辈指点。", 0, 1)
			say(JY.Person[0].称呼 .. "，来，我给你看看。", 51, 0)
			dark()
			light()
			say("原来如此，多谢前辈指点。", 0, 1)
			write_nump(3, 1)

			JY.Person[0].耍刀技巧 = 100
		end

		if JY.Person[0].品德 > 80 then
			say("今日我将苗家剑法也传授与你，望你行走江湖，记得多行*侠仗义。", 3, 0, "苗人凤")
			say("多谢苗叔。", 1, 1)
			say("你和这位少侠都是良才美玉，我这正是所授得人，我这些年来细思，苗家剑法快捷如风，出招严谨迅疾。", 3, 0, "苗人凤")
			say("而胡家刀法到极处则以慢缚快，奇诡无比，正是天生的相依相合，今日便都讲给你们听吧。", 3, 0, "苗人凤")
			addthing(117, 1)

			if JY.Person[0].御剑能力 == 99 then
				say("前辈，最近我练功毫无寸进，还请前辈指点。", 0, 1)
				say(JY.Person[0].称呼 .. "，来，我给你看看。", 51, 0)
				dark()
				light()
				say("原来如此，多谢前辈指点。", 0, 1)
				write_nump(2, 1)

				JY.Person[0].御剑能力 = 100
			end
		end

		if has_thing(136) == false then
			addthing(136, 1)
		end

		instruct_35(1, 0, 67, 200)
		stop_ng(1)
		instruct_35(1, 1, 44, 50)

		JY.Person[1].修炼物品 = 117

		AddPersonAttrib(1, "耍刀技巧", 10)
		AddPersonAttrib(1, "御剑能力", 10)
		say("多谢苗叔。", 1, 0)
		say("多谢苗大侠。", 0, 1)
		say("胡兄，如今诸事已毕，你我一身本事，不如一同闯荡江湖，行侠仗义，不枉一身所学。", 0, 0)
		say("我也有此意，不过我父刚去，我要去后山为先父守丧，随后我再去小村寻你。", 1, 1)
		say("如此也好。", 0, 0)
		say("胡大哥，我陪你一起去。", 2, 1)
		null(-2, 107)
		null(-2, 103)
		null(0, 106)
		instruct_21(1)
		say("爹，我陪你去后山。", 353, 0, "苗若兰")
		null(0, 104)
		null(0, 105)
		instruct_3(70, 5, 1, 0, 1251, 0, 0, 5166, 5166, 5166, -2, -2, -2)
		instruct_3(70, 6, 1, 0, 1253, 0, 0, 8684, 8684, 8684, -2, -2, -2)
	else
		say("苗大侠，你怎么样了？", 0, 1)
		say("药王传人果然名不虚传，我已经好多了。", 3, 0, "苗人凤")
	end
end
OEVENTLUA[1170] = function ()
	say("知道天下掌门人大会吧。", 109, 0, "酒客")
	say("这等消息，天下还有谁人不知。当朝两广总督，兵部尚书、总管内务府大臣，", 203, 0, "酒客")
	say("福康安福大人广发武林帖，邀请当今天下各大武林门派掌门齐聚京城。", 203, 0, "酒客")
	say("要给个门派定个名次。", 203, 0, "酒客")
	say("也不知道这名次要如何定法？", 109, 0, "酒客")
	say("这等大事，咱们自然是要去瞧瞧。", 323, 0, "酒客")
	say("正是，干！", 203, 0, "酒客")
	say("好，干！", 323, 0, "酒客")
end
OEVENTLUA[1171] = function ()
	Cls()
	dark()
	null(-2, 0)
	light()
	say("(只听一人道) 大师，我自感罪孽深重，愿拜入佛门，往后年年，在佛前忏悔己罪。", 4, 0)
	say("阿弥陀佛...", 1155, 1, "老和尚")

	if has_thing(202) then
		say("自今以后，我就不叫闫基，我是宝树和尚。", 4, 0)
		say("哦，你就是闫基。", 0, 1)
		say("（闫基猛听此话，惊得跳了起来） 我不是，我不是，我是宝树和尚。", 4, 0)
		say("江湖上都说你和田归农联手，毒死了胡一刀胡大侠，原来是真的。", 0, 1)
		say("哎，施主，我年轻时做了错事，深至后悔。", 4, 0)
		say("听说你使毒还不错，不如加入我吧，你要真有些本事，我保你荣华富贵。", 0, 1)
		say("就凭你？", 4, 0)
		say("哦，看不起我啊。", 0, 1)

		if WarMain(312, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("如何？跟我走吧。", 0, 1)
		say("（面色忽青忽白，变化不定）真能保我荣华富贵？", 4, 0)
		say("(斜眼看着他，眼神寒冷)", 0, 1)
		say("好，少侠武功是我仅见,今日我就拼这一把。但是苗人凤要是找上来，你需得替我担了此事。", 4, 0)
		say("好，哈哈哈 (一阵大笑)", 0, 1)
		say("施主，你刚才说加入佛门？", 1155, 0, "老和尚")
		say("不加了，不加了，老和尚对不住啊。", 4, 1)
		null(-2, 1)
		say("~~~", 1155, 0, "老和尚")
		dark()
		light()

		if instruct_20() then
			Cls()
			say("你的队伍已满，真没有诚意啊。", 4, 0)
			null(-2, 0)
			null(-2, 2)

			return
		end

		instruct_10(4)
		instruct_35(4, 0, 67, 400)
		null(-2, 0)
		null(-2, 2)
	else
		say("原来是你，你就是京城那个医师。", 0, 1)
		say("你究竟将胡大侠怎么样了？", 0, 1)
		say("诸位施主，我年轻时做了错事，深至后悔，今日拜入佛门，从此洗心革面，此后便叫做宝树和尚了。", 4, 0)
		say("管你宝树宝马，今日纳命来吧。", 0, 1)

		if WarMain(312, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("大师，救命啊。", 4, 1)
		say("阿弥陀佛，施主且住，所谓放下屠刀，离地", 1155, 0, "老和尚")
		say("(啪，你一下将老和尚敲晕过去)", 0, 1)
		null(-2, 2)
		say("手起刀落，一刀将闫基头砍了下来，只见一股热血喷了老高，将地面染得湿透。", 0, 1)
		null(-2, 1)
		say("哈哈，哈哈，痛快。", 0, 1)
		instruct_37(2)
		addthing(190, 1)

		if has_thing(247) == false then
			addthing(247, 1)
		end

		if has_thing(136) == false then
			addthing(136, 1)
		end
	end
end
OEVENTLUA[1172] = function ()
	Cls()
	dark()
	instruct_21(633)
	null(3, 17)
	light()
	say("（只见此人生的玉面朱唇，一身贵气，果然是翩翩浊世佳公子）", 0, 1)
	say("少侠请了。", 1011, 0, "福康安")
	say("这位公子请了。", 0, 1)
	say("少侠气度如此不凡，我与少侠一见如故，不如同饮一杯如何？", 1011, 0, "福康安")
	say("（见他沉稳大度，神色又极真诚） 好，如此叨扰了。", 0, 1)
	say("（当下点了酒菜，一同畅饮，席间甚为融洽）", 0, 1)
	dark()
	light()
	addtime(1)

	if inteam(633) then
		addevent(107, 116, 1, -2, 1, 9434, 36, 41)
		say("天色已晚，我该告辞了。", 1011, 0, "福康安")
		say("告辞，有缘再见。", 0, 1)
		say("公子，有缘再见！", 327, 0, "田青文")
		dark()
		null(-2, 113)
		null(-2, 114)
		null(-2, 115)
		light()
		say("青文，我们也休息吧。", 0, 1)
		dark()
		null(-2, 116)
		My_Enter_SubScene(107, 48, 38, 2)
		light()
		say("(一夜过去)", 0, 1)
		addtime(1)
		say("睡得一夜好觉，小八，青文哪去了？", 0, 1)
		say("少夫人出去买早点去了，说完了在周围逛逛，一会儿就回来了。", 1095, 0, "麦小八")
		say("我回来了。（脸色绯红，想是冻的）", 327, 0, "田青文")
		say("（不由有些怜惜）以后让小八帮你买早餐，自己不要这么早出去了。", 0, 1)
		say("嗯。", 327, 0, "田青文")
		addevent(107, 113, 1, 1173, 1, 9196, 17, 30)
		addevent(107, 114, 1, -2, 1, 6094, 16, 29)
		addevent(107, 115, 1, -2, 1, 6094, 18, 29)
	else
		say("少侠不妨在京城多逛逛，你我有缘，或会再见。", 1011, 0, "福康安")
		say("正该如此。", 0, 1)
		dark()
		null(-2, 113)
		null(-2, 114)
		null(-2, 115)
		addevent(107, 5, 0, 1174, 3, -2, -2, -2)
		addevent(107, 6, 0, 1174, 3, -2, -2, -2)
		light()
	end
end
OEVENTLUA[1173] = function ()
	Cls()
	dark()
	light()

	local var_39_0 = 0
	local var_39_1 = JY.Person[0].性别 == 1 and "小姐" or "老爷"

	say("少侠，你我果然是有缘，这么快就又见面了。", 1011, 0, "福康安")
	say("公子这是？", 0, 1)
	say("无事出来逛逛，我看少侠似乎对京城还不太熟悉，不如我带少侠去热闹处逛逛，若何？", 1011, 0, "福康安")

	if inteam(633) then
		say("好啊好啊，大哥，我到京城还没有出去逛过那。（青文向你望过来，目光若水一般）", 327, 0, "田青文")
		say("好好好，今日就左右逛逛，叨扰公子了。", 0, 1)
		say("(一天过去)", 0, 1)
		dark()
		null(-2, 116)
		instruct_21(633)
		null(-2, 113)
		null(-2, 114)
		null(-2, 115)
		My_Enter_SubScene(107, 48, 38, 2)
		light()
		addtime(1)
		say("(一夜好睡)", 0, 1)
		say("青文，青文！这一大早的，又跑哪里去了？", 0, 1)
		say("小八，青文又哪去了？", 0, 1)
		say("少夫人出去买早点去了，说完了在周围逛逛，一会就回来了。", 1095, 0, "麦小八")
		dark()
		light()
		say("怎么还不回来？不会出啥事了吧？", 0, 1)
		say(var_39_1 .. "休急，我这就出去找找。", 1095, 0, "麦小八")
		say("这么晚还没有出来，只怕出什么事了，小八，咱们一块出去找吧。", 0, 1)
		say("啊，是，" .. var_39_1 .. "。", 1095, 0, "麦小八")
	else
		dark()
		light()
		addtime(1)
		say("(一天过去)", 0, 1)
		dark()
		null(-2, 116)
		instruct_21(633)
		null(-2, 113)
		null(-2, 114)
		null(-2, 115)
		My_Enter_SubScene(107, 48, 38, 2)
		light()
		say("(一夜好睡)", 0, 1)
	end

	addevent(107, 5, 0, 1174, 3, -2, -2, -2)
	addevent(107, 6, 0, 1174, 3, -2, -2, -2)
end
OEVENTLUA[1174] = function ()
	Cls()
	null(-2, 5)
	null(-2, 6)
	dark()
	addevent(107, 116, 1, -2, 1, 8764, 22, 40)
	addevent(107, 117, 1, -2, 1, 6780, 21, 37)
	addevent(107, 118, 1, -2, 1, 6780, 22, 35)
	light()
	say("哪里走？", 1233, 0, "大内高手")
	say("休得走了逆贼！", 1233, 0, "大内高手")
	say("（忽见一人往这边急冲了过来，后面两人急追。）", 0, 1)
	say("（前面那人虽然急奔，但后面两人轻功着实高明，只两三步便追上来，刀剑齐加。）", 0, 1)
	say("（那人便被砍倒在地，眼见不活了。)", 0, 1)
	say("(只见刚才那人倒在地上，依稀有些面熟，也不知道在哪里见过)", 0, 1)
	say("两位，这是？", 0, 1)
	say("官家办案，休要多管闲事！", 1233, 0, "大内高手")
	null(-2, 116)
	null(-2, 117)
	null(-2, 118)

	if JY.Person[633].好感度 >= 60 then
		say("(想了一会，似乎是当日那个田青文的师兄，不由甚是担心)", 0, 1)
	end

	addevent(107, 130, 0, 1175, 3, -2, 44, 11)
	addevent(107, 121, 1, -2, 1, 6082, 47, 8)
	addevent(107, 120, 1, -2, 1, 6080, 46, 8)
	addevent(107, 122, 1, -2, 1, 6094, 45, 9)
	addevent(107, 123, 1, -2, 1, 6094, 48, 9)
end
OEVENTLUA[1175] = function ()
	Cls()
	dark()
	My_Enter_SubScene(107, 46, 11, 0)
	null(3, 17)
	instruct_21(633)
	light()

	local var_41_0 = 0
	local var_41_1 = JY.Person[0].性别 == 1 and "大姐姐" or "大哥"

	if JY.Person[633].好感度 == 70 then
		say("青文？(声音发颤，简直不敢相信自己的眼睛)", 0, 1)
	elseif JY.Person[633].好感度 == 60 then
		say("青文？(只见田青文依偎在那俊朗公子怀里，你简直不敢相信自己的眼睛)", 0, 1)
	end

	say("少侠，你我果然是有缘，又见面了。", 1011, 0, "福康安")
	say("是你？", 0, 1)
	say("大胆，此乃是当朝两广总督，兵部尚书、总管内务府大臣福康安福大人！", 1233, 0, "大内高手")
	say("还不快快跪拜！", 1233, 0, "大内高手")
	say("（从你进来，福康安面色都没有任何变化，只是微微带着笑容看着你）", 0, 1)
	say("居然是福康安，若是得罪了他，只怕寸步难行。若是顺了他，以我的本事，到时候也必能一人之下，千万人之上。", 0, 1)

	if yesno("要跪拜吗？") then
		dark()
		light()
		instruct_37(-10)
		say("小人愿意投效大人(我膝盖怎么弯不下去？这是怎么回事)", 0, 1)
		say("还不快快跪拜！", 1233, 0, "大内高手")
		say("小人，小人似乎没有这个功能。", 0, 1)
		say("大胆！", 1233, 0, "大内高手")
		say("好了，汉人都讲究气节，少侠，我就给你这个特权。", 1011, 0, "福康安")
		say("小人必不会让大人失望。", 0, 1)

		if JY.Person[633].好感度 > 50 then
			say("青文妹子，将这令牌给你师兄。", 1011, 0, "福康安")
			say("田青文从你进来后就一直不说话，如今听了福康安的吩咐，将令牌拿过来递到你手上", 0, 2)
			say("你...", 0, 1)
			say("田青文仍只偏着头不看你，一声不吭", 0, 2)
			say("福康安仔细的凝视着你们，嘴角露出微微的笑容", 0, 2)
		else
			say("这令牌给你。", 1011, 0, "福康安")
		end

		addthing(329, 1)

		JY.Person[0].清罪恶值 = 0

		say("很好。", 1011, 0, "福康安")
		say("你这几天就待在京城客栈，很快就有大事要你去办，你出去吧。", 1011, 0, "福康安")
		say("是。", 0, 1)

		if inteam(1) then
			say("我真是看错你了，道不同不相为谋。", 1, 0)
			dark()
			light()
			instruct_21(1)
			null(70, 5)
		end

		if inteam(2) then
			instruct_21(2)
			null(70, 6)
		end

		if inteam(632) then
			say("可恶。", 331, 0)
			instruct_21(632)
			null(70, 6)
		end

		if inteam(54) then
			say("我真是看错你了，道不同不相为谋。", 54, 0)
			dark()
			light()
			instruct_21(54)
			null(70, 51)
		end

		dark()
		addevent(107, 135, 1, 1185, 1, 6098, 43, 11)
		My_Enter_SubScene(107, 42, 14, 2)
		light()
	else
		say("福大人真是好大的威风。", 0, 1)

		if JY.Person[633].好感度 >= 70 then
			say("不过要抢我的女人，也不过是一条死路！", 0, 1)
		else
			say("不过就凭你，也想命令与我？那是休想。", 0, 1)
		end

		if WarMain(313, 0) == false then
			instruct_15(0)
			instruct_0()

			do return end

			Cls()
		end

		null(-2, 122)
		null(-2, 123)

		if JY.Person[633].好感度 > 50 then
			say("果然是好本事，（福康安抚掌大笑）难怪青文老说你武功高强。", 1011, 0, "福康安")
			say("我如今身边正缺得力之人，不如你来帮我，你我兄弟共享荣华富贵。", 1011, 0, "福康安")
			say("你手轻拂去剑上血迹，朝福康安走去", 0, 2)
			say(var_41_1 .. "，你不能杀他。", 327, 0, "田青文")
			say("哦？我不能杀他？（不由气急想笑，却是不理，继续行去）", 0, 1)
			say("(田青文拦在你面前，只是不让，仍然道)你不能杀他！", 327, 0, "田青文")
		else
			say("果然是好本事，（福康安抚掌大笑）。", 1011, 0, "福康安")
			say("我如今身边正缺得力之人，不如你来帮我，你我兄弟共享荣华富贵。", 1011, 0, "福康安")
			say("你手轻拂去剑上血迹，朝福康安走去", 0, 2)
		end

		addevent(107, 124, 1, -2, 1, 8870, 45, 9)
		addevent(107, 125, 1, -2, 1, 8914, 48, 9)
		addevent(107, 135, 1, 1185, 1, 6098, 43, 11)
		say("（便在这时，两个老者抢在福康安前面)休得伤了福大人！", 1034, 0, "周铁鹪")
		say("跟着源源不断的窜出侍卫来，瞬间将你团团围住", 0, 2)
		say("好了，都住手。（虽然还是坐着不动，身上却慢慢透出一股铁血尊贵气势）", 1011, 0, "福康安")
		say("少侠，我刚才话依然有效，若是愿意，我在京城等你消息。", 1011, 0, "福康安")
		say("你要是要女人的话，跟我做事，什么样的没有，你且慢慢想想。", 1011, 0, "福康安")
		say("少侠！请了。", 1043, 0, "汪铁鹗")
		dark()
		My_Enter_SubScene(107, 42, 14, 2)
		light()
		say("（隐隐听得福康安问到） 两位是？", 1011, 0, "福康安")
		say("拜见福大人，小人乃是浙江鹰爪雁行门的掌门周铁鹪，这是我师弟汪铁鹗。", 1034, 0, "周铁鹪")
	end

	null(-2, 130)
	addevent(107, 136, 0, 1177, 3, -2, 32, 20)
	addevent(107, 28, 1, 1176, 1, 8632, -2, -2)
	addevent(107, 19, 1, 1176, 1, 8632, -2, -2)
	addevent(128, 10, 0, 1182, 3, -2, -2, -2)
	addevent(128, 12, -2, -2, 1, 8622, -2, -2)
	addevent(128, 13, -2, -2, 1, 5190, -2, -2)
	addevent(128, 14, -2, -2, 1, 5190, -2, -2)
	addevent(128, 11, -2, -2, 1, -2, -2, -2)
end
OEVENTLUA[1176] = function ()
	Cls()
	say("站住，此乃福大帅府邸，闲人退避！", 222, 0, "官兵")

	if has_thing(329) then
		null(-2, 120)
		null(-2, 121)
		null(-2, 122)
		null(-2, 123)
		null(-2, 124)
		null(-2, 125)
		null(-2, 126)
		null(-2, 127)
		null(-2, 135)
		say("原来是少侠，福大人有令，少侠请进！", 222, 0, "官兵")
		dark()
		addevent(107, 137, 1, -2, 1, 9196, 32, 10)
		addevent(107, 138, 1, -2, 1, 8870, 30, 9)
		addevent(107, 139, 1, -2, 1, 8914, 33, 9)
		addevent(107, 144, 1, -2, 1, 8872, 30, 17)
		addevent(107, 145, 1, -2, 1, 8888, 32, 17)
		addevent(107, 146, 1, -2, 1, 8896, 34, 17)
		addevent(107, 147, 1, -2, 1, 8840, 30, 19)
		addevent(107, 148, 1, -2, 1, 8846, 32, 19)
		addevent(107, 149, 1, -2, 1, 8622, 34, 19)
		My_Enter_SubScene(107, 32, 20, 0)
		light()
	end

	if has_thing(330) then
		null(-2, 120)
		null(-2, 121)
		null(-2, 122)
		null(-2, 123)
		null(-2, 124)
		null(-2, 125)
		null(-2, 126)
		null(-2, 127)
		null(-2, 134)
		null(-2, 135)
		say("原来是掌门人到来，掌门人请进！", 222, 0, "官兵")
		addthing(330, -1)
		dark()
		addevent(107, 137, 1, -2, 1, 9196, 32, 10)
		addevent(107, 138, 1, -2, 1, 8870, 30, 9)
		addevent(107, 139, 1, -2, 1, 8914, 33, 9)
		addevent(107, 144, 1, -2, 1, 8872, 30, 17)
		addevent(107, 145, 1, -2, 1, 8888, 32, 17)
		addevent(107, 146, 1, -2, 1, 8896, 34, 17)
		addevent(107, 147, 1, -2, 1, 8840, 30, 19)
		addevent(107, 148, 1, -2, 1, 8846, 32, 19)
		addevent(107, 149, 1, -2, 1, 8622, 34, 19)
		My_Enter_SubScene(107, 32, 20, 0)
		light()
	end
end
OEVENTLUA[1177] = function ()
	Cls()
	dark()
	null(-2, 136)
	addevent(107, 191, 1, 1180, 1, -2, -2, -2)
	light()
	say("（只见得屋内怕不聚集了数百人，有的相互打着招呼，有的小声交谈）", 0, 1)
	say("知道鹰爪雁行门的掌门周铁鹪吧，不得了啊，现在乃是朝廷的记名总兵，汪铁鹗乃是实授副将，真是威风啊。", 1033, 0, "先天拳掌门")
	say("正是，周汪二人到得京城当日，正巧遇到福大人遇刺，二人当即挺身而出，惊退了贼人，这才得到福大人赏识。", 1034, 1, "神拳门掌门")
	say("真是好运气啊。（几人都有艳羡之色）", 1034, 0, "神拳门掌门")
	say("如今福大人召开大会，正是我等机会。", 1033, 1, "先天拳掌门")
	say("正是，正是。", 1035, 0, "鸭形门掌门")
	say("（半饷，有人喊道）有请四大掌门。", 0, 1)
	Cls()
	dark()
	addevent(107, 140, 1, -2, 1, 5376, 30, 13)
	addevent(107, 141, 1, -2, 1, 8904, 30, 15)
	addevent(107, 142, 1, -2, 1, 8432, 34, 13)
	addevent(107, 143, 1, -2, 1, 8960, 34, 15)
	light()
	null(-2, 136)
	say("只见陆续走上四人来，正是少林寺南门方丈大智禅师，武当山太和宫观主无青子道长，甘霖惠七省汤大侠，满洲英雄海兰弼海大人", 0, 2)
	say("（四人齐身向上拱手）福大人！", 0, 1)
	say("（众掌门人齐齐拱手）参见福大人！", 0, 2)
	say("（福康安命人斟了一杯酒，说道）各位武师来京，本帅给各位接风，干杯！（说着举杯而尽，群豪一齐干杯）", 1011, 0, "福康安")
	say("刚才皇上召见，赐了二十四只杯子，命本帅转赐给二十四位掌门人。", 1011, 0, "福康安")
	say("众人都不出声，心想，在座数百掌门，这二十四只杯子却如何分发？", 0, 2)
	say("本帅想请诸位各献绝艺，武功最强的四位分得四只玉杯，可与少林、武当、三才剑、黑龙门四门合称-玉龙八门-，是天下第一等的大门派。", 1011, 0, "福康安")
	say("其次八位掌门人分得八只金杯，那是-金凤八门-。再其次八位分得八只银杯，那是-银鲤八门-。从此各门各派分了等级，武林中便可少了许多纷争。", 1011, 0, "福康安")
	say("正是，正是，福大人此举大善（众掌门人齐齐拱手）", 0, 2)
	say("咱们今日以武会友，讲究点到为止。不过动手过招的当中，刀枪没眼，也保不定有什么失手，各位听真，在会上失手伤人的，不负罪责。", 1011, 0, "福康安")
	say("今日得了这二十四只御杯的，自然要好好的看管着。若是给别门别派抢了去、偷了去，那玉龙八门、金凤八门、银鲤八门，跟今日会中所定，却又不同了哇！", 1011, 0, "福康安")
	say("（众人心中不由忐忑，便听人喊道）比试开始！", 0, 1)
	dark()
	light()
	say("数场战斗后，死伤了数人", 0, 2)
	say("有人小声道，这是结下了死仇啊", 0, 2)
	say("好狠毒的手段，这是要挑起武林的争斗，从此后武林内斗不止啊。", 0, 1)

	if has_thing(329) == false then
		if inteam(1) then
			say("这是二桃杀三士的手段，却是得想个法子扰乱了会场才好。", 1, 0)
		end

		if inteam(2) then
			say("看我的。", 2, 0)
			say("（只见她拿出个小小的烟管，点着了火，悄悄到屋子两角个喷了几口烟）", 0, 1)
			say("好了，大家先屏住气，稍等片刻。", 2, 0)
			instruct_37(2)
		end
	end

	dark()
	light()
	dark()
	light()
	say("哎呦，肚子好疼。", 1034, 1, "神拳门掌门")
	say(" 哎呦！哎呦！（便听又有几人大叫肚子疼）", 1033, 0, "先天拳掌门")
	say("不好，狗贼下毒了。", 1035, 1, "鸭形门掌门")
	say("朝廷这是要将我们一网打尽啊，大家快跑啊！", 1150, 0, "金刚门掌门")
	dark()
	addevent(107, 150, 1, -2, 1, 5444, 34, 17)
	addevent(107, 151, 1, -2, 1, 5428, 30, 19)
	addevent(107, 152, 1, -2, 1, 5434, 32, 22)
	addevent(107, 153, 1, -2, 1, 5436, 34, 19)
	addevent(107, 154, 1, -2, 1, 4320, 32, 15)
	addevent(107, 155, 1, -2, 1, 4318, 30, 13)
	addevent(107, 156, 1, -2, 1, 4320, 32, 11)
	addevent(107, 157, 1, -2, 1, 4322, 28, 25)
	addevent(107, 158, 1, -2, 1, 4322, 35, 19)
	null(-2, 19)
	null(-2, 28)
	null(-2, 137)
	null(-2, 138)
	null(-2, 139)
	null(-2, 140)
	null(-2, 141)
	null(-2, 142)
	null(-2, 143)
	null(-2, 146)
	null(-2, 147)
	light()
	say("（顿时一阵大乱，有的人朝周围兵丁打去，有的急忙朝门外跑，有的还在原地犹豫不决）", 0, 1)
	say("（还有几个大胆的居然朝福康安冲去，又有人放起火来）", 0, 1)

	if has_thing(329) then
		say("少侠，我们挡住这些贼子，先护得福大人！", 1034, 0, "周铁鹪")

		if WarMain(314) == false then
			instruct_15(0)
			instruct_0()

			do return end

			Cls()
		end

		if WarMain(315) == false then
			instruct_15(0)
			instruct_0()

			do return end

			Cls()
		end

		null(-2, 144)
		null(-2, 145)
		null(-2, 148)
		null(-2, 149)
		say("贼子休跑！", 0, 1)
		say("师弟，你护得福大人！少侠，我们追！", 1034, 0, "周铁鹪")
		dark()
		light()
		My_Enter_SubScene(107, 20, 34, 3)
		instruct_30(20, 34, 20, 44)
		say("哼，迟早抓到你们~", 0, 1)
		addevent(107, 159, 0, 1181, 3, -2, 44, 11)
		addevent(107, 160, 1, -2, 1, 6082, 47, 8)
		addevent(107, 161, 1, -2, 1, 6080, 46, 8)
		addevent(107, 122, 1, -2, 1, 6094, 45, 9)
		addevent(107, 123, 1, -2, 1, 6094, 48, 9)
		addevent(107, 164, 1, -2, 1, 8872, 46, 10)
		null(-2, 133)
	else
		say("喂喂，别打了！大家先闯出去再说。", 0, 1)
		Cls()
		dark()
		My_Enter_SubScene(107, 38, 25, 2)
		light()

		if WarMain(316) == false then
			instruct_15(0)
			instruct_0()

			do return end

			Cls()
		end

		null(-2, 133)
		say("这儿打开了缺口，大家快从这里走。", 0, 1)
		null(-2, 144)
		null(-2, 145)
		null(-2, 148)
		null(-2, 149)
		dark()
		addevent(107, 167, 1, -2, 1, 8886, 20, 43)
		addevent(107, 168, 1, -2, 1, 8846, 21, 45)
		addevent(107, 169, 1, -2, 1, 8888, 20, 46)
		addevent(107, 170, 1, -2, 1, 8876, 19, 45)
		light()
		My_Enter_SubScene(107, 20, 45, 3)
		say("终于逃出来了，官府必会搜查，大家这就逃命去吧。", 0, 1)
		say("多谢少侠！", 1036, 1, "江湖高手")
		say("多谢少侠！有缘再会！", 1019, 1, "江湖高手")

		JY.Person[0].清罪恶值 = JY.Person[0].清罪恶值 + 100

		DrawStrBoxWaitKey("你勾结乱党，你被官府通缉了", C_ORANGE, CC.DefaultFont, 2)
		AddPersonAttrib(0, "声望", 10)
		null(-2, 167)
		null(-2, 168)
		null(-2, 169)
		null(-2, 170)
		instruct_37(3)
	end

	null(-2, 144)
	null(-2, 145)
	null(-2, 148)
	null(-2, 149)
	addevent(124, 5, 0, 1301, 3, -2, -2, -2)
	addevent(124, 1, 1, -2, 1, 8268, -2, -2)
	addevent(124, 19, 1, -2, 1, 8672, -2, -2)
	addevent(124, 20, 1, -2, 1, 8670, -2, -2)
	addevent(124, 21, 1, -2, 1, 8670, -2, -2)
	addevent(3, 5, 1, 9034, 1, -2, -2, -2)
	addevent(3, 6, 1, 9034, 1, -2, -2, -2)
	addevent(3, 8, 1, 9034, 1, -2, -2, -2)
end
OEVENTLUA[1178] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(16, 1)
	instruct_2(174, 3000)
end
OEVENTLUA[1179] = function ()
	Cls()
	null(-2, 43)
	instruct_2(144, 1)

	if inteam(632) then
		say(JY.Person[0].称呼 .. "，我该离开了。", 331, 0)
		say("离开？你要去哪儿？", 0, 1)
		say("贫尼圆性，感谢你们这段时间的陪伴。", 331, 0)

		if inteam(1) then
			say("胡斐眼神微微黯淡了一下，却什么也没有说", 0, 2)
		end

		instruct_21(632)
		say("可惜。", 0, 1)
	end

	null(70, 12)
end
OEVENTLUA[1180] = function ()
	Cls()
	say("密道在这儿。", 0, 1)
	dark()
	My_Enter_SubScene(107, 42, 7, 1)
	light()
end
OEVENTLUA[1181] = function ()
	Cls()
	dark()
	light()
	say("查出来了吗？究竟是什么人在捣乱？", 1011, 0, "福康安")
	say("禀大帅，查到红花会派人混入了会场，必是他们在会场放了毒。", 1034, 1, "周铁鹪")
	say("又是他们。（微一沉吟）", 1011, 0, "福康安")
	say("少侠，你到的正好。红花会近些年不知道做了多少恶事，我想请你到回疆一行，铲除了这红花会。", 1011, 0, "福康安")
	say("是。", 0, 1)
	say("我早先已派出御林军骁骑营佐领张召重对付这红花会，结果到如今还办不好。今日我就任命你为御林军骁骑营剿匪特使，", 1011, 0, "福康安")
	say("他在明，你在暗。此次一定要红花会覆灭。不要让我失望。", 1011, 0, "福康安")
	say("是，必不辱命。", 0, 1)
	say("好，你去吧。", 1011, 0, "福康安")

	JY.Person[0].清罪恶值 = 0

	dark()
	addevent(107, 135, 1, 1185, 1, 6098, 43, 11)
	My_Enter_SubScene(107, 42, 14, 2)
	null(-2, 159)
	light()
end
OEVENTLUA[1182] = function ()
	Cls()
	dark()
	null(-2, 10)
	light()
	say("阿四嫂，休得到处污我，我何时杀你家孩儿了，那孩儿明明是你自家杀的。", 1153, 0, "凤天南")
	say("是你杀的，你杀的，呜呜，我苦命的孩儿啊。", 258, 1, "阿四嫂")
	say("成天疯疯癫癫的，你再到处污我，就锁你去见官去。我怜你刚失去孩儿，今日饶你一回。以后本分点过日子吧。", 1153, 0, "凤天南")
	dark()
	light()
	say("凤天南？你居然跑到福州来作威作福了？", 0, 1)
	say("哎呀，少侠，真是有缘，我们又见面了。", 1153, 0, "凤天南")
	say("少说废话，你这恶徒，今日饶你不得。", 0, 1)

	if yesno("要杀凤天南吗？") then
		if WarMain(317, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		null(-2, 13)
		null(-2, 14)
		say("凤天南，受死吧。", 0, 1)
		say("(忽然一阵劲风袭过)", 0, 1)
		dark()
		null(-2, 12)
		light()
		say("什么人？（只见一个紫色身影一闪而过）", 0, 1)
		say("啊啊，坏人来了，坏人来了，我苦命的孩儿，快躲起来，躲起来。", 258, 0, "阿四嫂")
		null(-2, 11)
		say("嗯？", 0, 1)
		say("凤天南，你运气倒是好，不过我想杀你，你跑哪都不行的。", 0, 1)
	else
		say("少侠，你我一见如故，又何必威胁我。", 1153, 0, "凤天南")
		say("哦？", 0, 1)
		say("不过我正是有事要找少侠，不想这就见到了。", 1153, 0, "凤天南")
		say("你找我？什么事？", 0, 1)
		say("少侠想是知道，我乃五虎门掌门，不过本门最近事务繁多，我实在是忙不过来，不知少侠是否愿意加入本门？", 1153, 0, "凤天南")
		say("你要我加入那个什么五虎门？（似笑非笑的看着凤天南）", 0, 1)
		say("少侠乃是天生豪杰，我这五虎门是小了点，让少侠见笑了。不过我愿意请少侠任客卿长老，一年供奉少侠3000两，不，5000两银子。", 1153, 0, "凤天南")
		say("少侠，咱们这是互利合作，你看如何？", 1153, 0, "凤天南")
		say("有点意思，我就任你们客卿长老也可，不过我经常在江湖闯荡，没法常驻五虎门的。", 0, 1)
		say("无妨无妨，本门只有发生重大之事才会麻烦少侠，不，长老大人的。", 1153, 0, "凤天南")
		say("哈哈哈（仰头大笑）", 0, 1)
		say("少侠，本门还有事忙，先行告辞了。", 1153, 0, "凤天南")
		dark()
		null(-2, 12)
		null(-2, 13)
		null(-2, 14)
		light()
		addthing(174, 5000)
		say("啊啊，坏人来了，坏人来了，我苦命的孩儿，快躲起来，躲起来。", 258, 1, "阿四嫂")
		null(-2, 11)
		say("（突然窗外传来一声女子的冷哼）哼，一丘之貉，狐鼠一窝。", 331, 0, "袁紫衣")
		say("什么人？（只见一个紫色身影闪过，一闪即逝）", 0, 1)

		if inteam(1) then
			say("我真是看错你了，道不同不相为谋。", 1, 0)
			dark()
			light()
			instruct_21(1)
			null(70, 5)
		end

		if inteam(2) then
			instruct_21(2)
			null(70, 6)
		end

		if inteam(632) then
			say("可恶。", 331, 0)
			instruct_21(632)
			null(70, 6)
		end

		if inteam(54) then
			say("我真是看错你了，道不同不相为谋。", 54, 0)
			dark()
			light()
			instruct_21(54)
			null(70, 51)
		end
	end

	addevent(121, 99, 0, 1183, 3, -2, 11, 34)
	addevent(121, 100, -2, -2, -2, 9010, 10, 37)
	addevent(121, 101, -2, -2, -2, 5172, 11, 36)
	addevent(121, 102, -2, -2, -2, 10490, 10, 39)
end
OEVENTLUA[1183] = function ()
	Cls()
	dark()
	null(-2, 99)
	light()
	say("六合刀法，精要全在虚、实、巧、打四字。你们这般笨劈蛮砍，还提什么韦陀门？什么六合刀？", 331, 0, "袁紫衣")
	say("众人既无异言，这掌门一席，自然是姑娘的了。", 1006, 1, "万鹤声")

	if inteam(1) then
		say("是你？你就是当日救走凤天南的那位姑娘。", 1, 0)
		say("你是谁？", 331, 1, "袁紫衣")
		say("在下胡斐。", 1, 0)
		say("你就是人称雪山飞狐的胡斐？赵叔叔总说你武功高强，我看却不见得。", 331, 1, "袁紫衣")
		say("让我试试你的功夫如何？", 331, 0, "袁紫衣")
	else
		say("是你？", 331, 0, "袁紫衣")
	end

	meet_self(632)
	null(-2, 100)
	null(-2, 101)

	if WarMain(318) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("敢问姑娘怎么称呼？", 0, 1)
	say("我是袁紫衣，你这小贼，是怎么找到我的？", 331, 0, "袁紫衣")
	say("这，姑娘你抢这掌门人位置这是？", 0, 1)
	say("自然是抢了这位置去参加掌门人大会。到时候拿出一把掌门人牌子，让人报上去，99家总掌门人到，这多威风。", 331, 0, "袁紫衣")
	say("...", 0, 1)

	if inteam(1) then
		say("好了，不和你多说了，我还有事，先走了。", 331, 0, "袁紫衣")
	else
		say("小贼，不要跟来。", 331, 0, "袁紫衣")
	end

	null(-2, 102)
	addevent(3, 113, 0, 1184, 3, -2, 40, 23)
	addevent(3, 114, -2, -2, -2, 8834, 39, 19)
	addevent(3, 115, -2, -2, -2, 5172, 40, 18)
	addevent(3, 116, -2, -2, -2, 10494, 38, 20)
end
OEVENTLUA[1184] = function ()
	Cls()
	dark()
	null(-2, 113)
	light()
	say("如何？我可能当八仙门的掌门人？", 331, 0, "袁紫衣")
	say("姑娘八仙剑法果然是出神入化，老朽佩服。", 1026, 1, "万鹤声")

	if inteam(1) then
		say("姑娘，又见面了。", 1, 0)
		say("胡大哥。", 331, 1, "袁紫衣")
		say("紫衣姑娘，你四处当这掌门人，想是要去参加掌门人大会。不如和我们一块去吧，大家也好结个伴。", 1, 0)
		say("也好。", 331, 1, "袁紫衣")

		if instruct_20() then
			Cls()
			say("你的队伍已满，真是没有诚意啊。", 331, 0)
			null(-2, 116)
			say("姑娘？", 1, 0)
			say("你们也是来抢这请帖的？罢了罢了，我这掌门人不当也罢。(说罢扔下一张请帖，竟自去了)", 1026, 1, "万鹤声")
			null(-2, 114)
			null(-2, 115)
			addthing(330)

			return
		end

		instruct_10(632)
		null(-2, 116)
		say("你们也是来抢这请帖的？罢了罢了，我这掌门人不当也罢。(说罢扔下一张请帖，竟自去了)", 1026, 1, "万鹤声")
		null(-2, 114)
		null(-2, 115)
		addthing(330)
	else
		say("慢着，这位姑娘，这张请帖我要了。", 0, 1)
		say("不行，这是我好不容易得来的。", 331, 0, "袁紫衣")
		say("如此，得罪了。", 0, 1)
		say("哼，总是依多为胜的家伙。", 331, 0, "袁紫衣")

		if WarMain(319) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("哼小贼，我记住你了。", 331, 0, "袁紫衣")
		null(-2, 116)
		say("罢了罢了，我这掌门人不当也罢。(说罢扔下一张请帖，竟自去了)", 1026, 1, "万鹤声")
		null(-2, 114)
		null(-2, 115)
		addthing(330)
	end

	addevent(61, 48, 0, 12827, 3, -2, -2, -2)
	addevent(61, 47, 1, -2, 1, 10410, -2, -2)
	addevent(61, 46, 1, -2, 1, 10292, -2, -2)
end
OEVENTLUA[1185] = function ()
	Cls()
	say("站住！没有主人召见，不可入内。", 234, 0, "官兵")
end
OEVENTLUA[1250] = function ()
	say("胡大哥，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(1)
	instruct_3(70, 5, 1, 0, 1251, 0, 0, 5166, 5166, 5166, -2, -2, -2)
end
OEVENTLUA[1251] = function ()
	Cls()

	if JY.Person[0].耍刀技巧 == 99 then
		say("你刀法似乎可以更进一步了，需要我帮忙吗？", 1, 0)
		say("还请胡大哥指点。", 0, 1)
		dark()
		light()
		say("原来如此。", 0, 1)
		say("你只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(3, 1)

		JY.Person[0].耍刀技巧 = 100

		return
	end

	say("有需要我帮忙的地方吗？", 1, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(1)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 1, 0)
		Cls()

		return
	end
end
OEVENTLUA[1252] = function ()
	say("灵姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(2)
	instruct_3(70, 6, 1, 0, 1253, 0, 0, 8684, 8684, 8684, -2, -2, -2)
end
OEVENTLUA[1253] = function ()
	if has_thing(193) == false and JY.Person[0].用毒能力 >= 20 then
		say("灵姑娘，我想和你学习一下使毒的本事，不知？", 0, 1)
		say("好啊，我正说师父的一身本事不要被我耽误了呢。", 2, 0)
		addthing(193)

		return
	end

	if has_thing(231) then
		say("你身上这个火蟾是个珍贵药材，我可以用它炼制强力的驱寒丹。", 2, 0)

		if yesno("要把火蟾给程灵素吗？") then
			say("好。", 0, 1)
			addthing(231, -1)
			say("你等等，我准备一下药材。", 2, 0)
			dark()
			light()
			addtime(1)
			say("好了。", 2, 0)
			addthing(344, 10)

			return
		else
			say("这个我还有其它用途。", 0, 1)
		end
	elseif has_thing(194) then
		say("你身上这个冰蚕是个珍贵药材，我可以用它炼制强力的祛火丹。", 2, 0)

		if yesno("要把冰蚕给程灵素吗？") then
			say("好。", 0, 1)
			addthing(194, -1)
			say("你等等，我准备一下药材。", 2, 0)
			dark()
			light()
			addtime(1)
			say("好了。", 2, 0)
			addthing(346, 10)

			return
		else
			say("这个我还有其它用途。", 0, 1)
		end
	end

	say("有需要我帮忙的地方吗？", 2, 0)
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(2)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 2, 0)
		Cls()

		return
	end
end
OEVENTLUA[1254] = function ()
	say("闫基，你先回小村，有需*要时，我再去找你。", 0, 4)
	Cls()
	instruct_21(4)
	instruct_3(70, 33, 1, 0, 1255, 0, 0, 5168, 5168, 5168, -2, -2, -2)
end
OEVENTLUA[1255] = function ()
	if has_thing(190) == false and JY.Person[0].医疗能力 >= 30 then
		say("闫基，让我看看你的医疗书籍。", 0, 1)
		say("好说好说。", 4, 0)
		addthing(190)

		return
	end

	say("有需要我帮忙的地方吗？", 4, 0)
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(4)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 2, 0)
		Cls()

		return
	end
end
OEVENTLUA[1256] = function ()
	say("袁姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(632)
	instruct_3(70, 12, 1, 0, 1257, 0, 0, 10490, 10490, 10490, -2, -2, -2)
end
OEVENTLUA[1257] = function ()
	say("有需要我帮忙的地方吗？", 331, 0, "袁紫衣")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(632)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 331, 0, "袁紫衣")
		Cls()

		return
	end
end
OEVENTLUA[1258] = function ()
	say("青文，你先回客栈，我忙完琐事再去找你。", 0, 1)
	Cls()
	instruct_21(633)
	addevent(3, 23, 1, 1259, 1, 9432, -2, -2)
end
OEVENTLUA[1259] = function ()
	say(JY.Person[0].称呼 .. "，带我去京城找我爹爹吧。", 327, 0, "田青文")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(633)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 327, 0, "田青文")
		Cls()

		return
	end
end
