OEVENTLUA[1301] = function ()
	Cls()
	dark()
	light()
	say("啊？", 0, 1)
	say("这是美女在洗澡，让我给碰上了？", 0, 1)
	say("世上怎么可能有这么美的美女？妈呀！这荒山野岭的，不会是什么精怪吧？", 0, 1)
	say("忽喇一声，那少女的头在花树丛中钻了起来，青翠的树木空隙之间，露出皓如白雪的肌肤", 0, 2)
	say("漆黑的长发散在湖面，一双像天上星星那么亮的眼睛凝望过来", 0, 2)
	say("凡人必无如此之美，不是水神，便是天仙了。", 0, 1)
	say("你是谁？到这里来干吗？", 344, 0, "喀丝丽")
	say("......，喂？", 344, 0, "喀丝丽")
	say("你走开，让我穿衣服！", 344, 0, "喀丝丽")
	dark()
	My_Enter_SubScene(124, 36, 41, 3)
	light()
	say("过路的大哥你回来~，为什么口不开？~逃得快？~", 344, 0, "喀丝丽")
	addevent(124, 7, 1, 1302, 1, 8268, -2, -2)
	null(-2, 1)
	null(-2, 5)

	JY.Person[151].佛学修为 = 1
	JY.Person[154].佛学修为 = 1
	JY.Person[153].佛学修为 = 1
end
OEVENTLUA[1302] = function ()
	Cls()
	say("喂，你是在偷看我洗澡吗？", 344, 0, "喀丝丽")
	say("啊？", 0, 1)
	say("只见她舒雅自在地站在湖边，明艳圣洁，几乎不信是凡人", 0, 2)
	say("白衣倒映水中，落花一瓣一瓣地掉在她头上、衣上、影子上", 0, 2)
	say("姑娘你不要误会，我行路途中，见这有一片绿洲，想进来看看，无意中撞见姑娘洗澡，绝非有意。", 0, 1)
	say("那就是看见了？我还以为你是个好人呢！", 344, 0, "喀丝丽")
	DrawStrBoxWaitKey("只见她的眼睛像天上星星般明亮，如秋水般柔情，现在很认真的看着你", C_ORANGE, CC.DefaultFont, 2)
	say("啊？我就是个好人。真正地好人。", 0, 1)
	say("你是要去什么地方？", 344, 0, "喀丝丽")
	say("我（她似乎是回族人？）现下要去回疆。", 0, 1)
	say("回疆要从这儿往西再走10余日，我带你去吧。", 344, 0, "喀丝丽")
	say("多谢姑娘，不敢姑娘辛劳。", 0, 1)
	say("呵呵，我是回族的香香公主，你不去回疆我也是要回去的。羊儿啊，咱们该回去了。", 344, 0, "喀丝丽")
	say("多谢姑娘。", 0, 1)
	say("对了，那边山上的雪莲花好漂亮的，如今要走了，咱们再去看看吧，你想去看看嘛？", 344, 0, "喀丝丽")
	say("好。", 0, 1)
	dark()
	light()
	addevent(124, 104, 1, 1303, 1, 8268, 31, 56)
	null(-2, 7)
end
OEVENTLUA[1303] = function ()
	Cls()
	say("喂，你看那边峭壁上的雪莲花，漂亮吗？", 344, 0, "喀丝丽")
	DrawStrBoxWaitKey("只见两朵碗大的雪莲花在峭壁上含怒绽放，雪白的花瓣在风中摇曳生辉", C_ORANGE, CC.DefaultFont, 2)
	say("真漂亮。", 0, 1)
	say("是吧？（看着雪莲花，微微有些出神）", 344, 0, "喀丝丽")
	say("见她头发上、脸上、手上、衣上都是淡淡的阳光，只看了一眼，心忽然剧烈跳动起来", 0, 2)
	say("想到：这样天仙似的美女，也只有这雪山的雪莲花才能陪衬她的美丽了", 0, 2)
	say("将身一纵，提起轻功往崖上掠去", 0, 2)
	say("哎呀，小心。", 344, 0, "喀丝丽")
	DrawStrBoxWaitKey("那花长在笔直的峭壁中间，中间绝无可以攀爬之处，又兼之崖上都是积年冰雪，几乎不能借力", C_ORANGE, CC.DefaultFont, 2)
	My_Enter_SubScene(124, 24, 57, 1)
	say("呼，终于采到了。", 0, 1)
	null(-2, 8)
	dark()
	My_Enter_SubScene(124, 32, 57, 2)
	light()
	say("终于采到了，给你。", 0, 1)
	say("刚才好危险，你不怕摔死吗？", 344, 0, "喀丝丽")
	say("你喜欢这花，我就采来给你，摔死了也没有什么。", 0, 1)
	say("那少女伸出一双纤纤素手来接住了，手微微颤动，抬头望她脸时", 0, 2)
	say("只见珍珠般的眼泪滚了下来，有几滴泪水落在花上，轻轻抖动，明澈如朝露", 0, 2)
	say("（忽然展颜一笑，道）这花有两朵，正好咱们两人一人一朵。", 344, 0, "喀丝丽")
	addthing(18, 1)
	say("我们走吧。", 344, 0, "喀丝丽")
	say("好，我们走。", 0, 1)
	DrawStrBoxWaitKey("香香公主随队行动", C_ORANGE, CC.DefaultFont, 2)
	dark()
	null(-2, 20)
	null(-2, 21)
	null(-2, 22)
	null(-2, 104)
	light()
	instruct_39(17)
	addevent(17, 99, -2, 1304, 3, -2, 24, 38)
	instruct_3(17, 4, 0, 0, 0, 0, 0, 7046, 7046, 7046, -2, -2, -2)
	instruct_3(17, 10, 0, 0, 0, 0, 0, 6806, 6806, 6806, -2, -2, -2)
	instruct_3(17, 12, 0, 0, 0, 0, 0, 6806, 6806, 6806, -2, -2, -2)
	instruct_3(17, 23, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 22, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 21, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 20, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 19, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 18, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 17, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 16, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 15, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
	instruct_3(17, 14, 0, 0, 0, 0, 0, 6778, 6778, 6778, -2, -2, -2)
end
OEVENTLUA[1304] = function ()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_30(24, 39, 24, 32)
	Cls()
	say("此书乃我回教圣物，决不允许外人拿走。", 74, 0)
	Cls()
	say("这是当今皇上的圣旨，谁敢不从！", 208, 0, "官兵")
	Cls()
	say("Ｌ＜原来是官兵……＞", 0, 1)
	Cls()
	meet_self(74)
	say("哼，我们远在回疆，向来独立，皇帝是你们的，与我回人何干？我们回人但有一口气在，也要誓死保护自己的圣物。", 74, 0)
	Cls()
	say("哼，臭丫头，敬酒不吃吃罚酒，那就别怪我们不客气了。", 208, 1, "官兵")
	Cls()
	say("姐姐。", 344, 0, "喀丝丽")
	Cls()
	say("喀丝丽，这些坏蛋要抢咱们回部的圣物可兰经，你先到后面帐里去。", 74, 1)
	Cls()
	say("这些坏蛋...", 344, 0, "喀丝丽")
	Cls()
	DrawStrBoxWaitKey("香香公主离开队伍", C_ORANGE, CC.DefaultFont, 2)
	say("别担心，有我在，不会有事的。", 0, 1)
	dark()
	light()
	instruct_37(2)
	say("你们这些官兵，总是欺压老百姓，我早就看不过眼了，回族弟兄们莫慌，我来助你们。", 0, 1)
	Cls()
	say("哪来的不开眼的家伙，活的不耐烦了！", 208, 0, "官兵")
	Cls()

	if WarMain(141, 0) == false then
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 13, 0, 0, 0, 0, 0, 6094, 6094, 6094, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	Cls()
	instruct_13()
	say("唉呦，唉呦，……轻点……", 208, 0, "官兵")
	Cls()
	say("多谢" .. JY.Person[0].称呼 .. "助我族人保护圣物。", 74, 0)
	Cls()
	say("路见不平，拔刀相助，姑娘太客气了。刚才听姑娘说，这圣物是一本书？", 0, 1)
	Cls()
	say("不瞒恩公，这是回教的圣经《可兰经》。", 74, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 7006, 7006, 7006, -2, -2, -2)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 5972, 5972, 5972, -2, -2, -2)
	instruct_3(-2, 29, 0, 0, 0, 0, 0, 6056, 6056, 6056, -2, -2, -2)
	instruct_3(-2, 31, 0, 0, 0, 0, 0, 6068, 6068, 6068, -2, -2, -2)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 5890, 5890, 5890, -2, -2, -2)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 6784, 6784, 6784, -2, -2, -2)
	Cls()
	instruct_13()
	say(JY.Person[0].称呼 .. "好身手！", 75, 0)
	Cls()
	say("过奖，这位公子怎样称呼？", 0, 1)
	Cls()
	say("在下姓陈，名家洛。这是我们红花会的众位兄弟。", 75, 0)
	Cls()
	meet_self(75)

	if has_thing(329) then
		say2("（原来这就是红花会的匪徒，在香香公主面前，却不好动手，待我探听一下他们的行址再做打算！）", 0, 1)
	end

	say("原来是红花会陈当家。久仰红花会大名，今日一见，果然英雄了得。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "过奖。", 75, 0)
	Cls()
	say("却不知红花会群豪为何来此？", 0, 1)
	Cls()
	say("我们的红花会的四当家文泰来被官兵所擒，我们一路跟踪这群官兵而来。适才本要出手相助，但见" .. JY.Person[0].称呼 .. "身手不凡，我们也就不必多此一举了。", 75, 0)
	Cls()
	say("原来陈公子也是要助我回部，霍青桐在此谢过。", 74, 1)
	Cls()
	say("总舵主，我们搜查一遍，没发现文四弟。", 152, 0)
	Cls()
	meet_self(152)
	say("把那个带头的官兵抓来问问。", 75, 1)
	Cls()
	say("是。快说，你们把文四弟藏到哪了？", 152, 0)
	Cls()
	say("唉呦，唉呦，……轻点……，我说，我说，那位文，文……，文大侠已经被我们张大人押往东北边密林的死囚牢了。", 222, 1, "官兵")
	Cls()
	say("哪个张大人？", 75, 0)
	Cls()
	say("是，是，张，张召重，张大人。", 222, 1, "官兵")
	Cls()
	say("这张召重武功非比寻常，一路柔云剑术出神入化，我们需得小心行事。", 153, 0)
	Cls()
	say("哼，那正好，我要和他比比剑法！", 152, 1)
	Cls()
	say("我们还有要事在身，就不在此打扰了，这位" .. JY.Person[0].称呼 .. "，还有霍姑娘，在下告辞了。", 75, 0)
	Cls()
	say("既是红花会有事，我也愿相助搭救文四当家。", 0, 1)
	Cls()
	say("是啊，我也愿相助，陈公子，让我和你一起去吧。", 74, 0)
	Cls()
	say("好。", 75, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_39(8)
	instruct_3(8, 20, 1, 0, 1306, 0, 0, 7006, 7006, 7006, -2, -2, -2)
	instruct_3(8, 19, 1, 0, 1306, 0, 0, 5972, 5972, 5972, -2, -2, -2)
	instruct_3(8, 16, 1, 0, 1306, 0, 0, 6056, 6056, 6056, -2, -2, -2)
	instruct_3(8, 17, 1, 0, 1306, 0, 0, 6068, 6068, 6068, -2, -2, -2)
	instruct_3(8, 18, 1, 0, 1306, 0, 0, 5890, 5890, 5890, -2, -2, -2)
	instruct_3(8, 22, 1, 0, 1306, 0, 0, 6784, 6784, 6784, -2, -2, -2)
	instruct_3(8, 28, 1, 0, 1306, 0, 0, 7004, 7004, 7004, -2, -2, -2)
	instruct_3(8, 8, 1, 0, 0, 0, 0, 6292, 6292, 6292, -2, -2, -2)
	instruct_3(8, 3, 1, 0, 0, 0, 0, 8658, 8658, 8658, -2, -2, -2)
	instruct_3(8, 0, 1, 0, 0, 0, 0, 6092, 6092, 6092, -2, -2, -2)
	instruct_3(8, 1, 1, 0, 0, 0, 0, 6092, 6092, 6092, -2, -2, -2)
	instruct_3(8, 2, 1, 0, 0, 0, 0, 6092, 6092, 6092, -2, -2, -2)
	instruct_3(8, 13, 1, 0, 0, 0, 0, 8630, 8630, 8630, -2, -2, -2)
	instruct_3(8, 14, 1, 0, 0, 0, 0, 8630, 8630, 8630, -2, -2, -2)
	instruct_3(8, 15, 1, 0, 0, 0, 0, 8630, 8630, 8630, -2, -2, -2)
	null(-2, 99)
	addevent(17, 3, 1, 1305, 1, 8268, -2, -2)
	instruct_13()
end
OEVENTLUA[1305] = function ()
	Cls()
	say("姐姐跟红花会的众位英雄走了，我很担心她。", 344, 0, "喀丝丽")
	say("不用担心，有我呢。", 0, 1)
	say("你愿意去帮姐姐？", 344, 0, "喀丝丽")
	say("你的姐姐就是我的姐姐，放心吧，过几天我就将你姐姐带回来了。", 0, 1)
	say("谢谢你。", 344, 0, "喀丝丽")
end
OEVENTLUA[1306] = function ()
	say("陈当家，你好。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "，你来啦。", 75, 0)
	Cls()
	say("营救文四哥还顺利么？", 0, 1)
	Cls()
	say("这张召重果然名不虚传，有*他在，救人还真不容易。", 75, 0)
	Cls()
	say("这样吧，咱们兵分两路，你*来缠住他，我们绕到后*面去救文四哥。", 75, 0)
	Cls()

	if yesno("要帮助红花会吗？") then
		say2("好。", 0, 1)
		instruct_37(2)
		addevent(8, 3, 1, 1309, 1, 8658, 22, 29)

		if has_thing(329) then
			JY.Person[601].好感度 = 40
		end
	else
		say2("好。", 0, 1)
		say2("（嘿嘿，待他们拼个两败俱伤我再出手！嘿嘿嘿）", 0, 1)
		instruct_37(-2)
		addevent(8, 5, 0, 1310, 3, -2, -2, -2)
	end

	instruct_14()
	instruct_3(-2, 0, 1, 0, 1308, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 1, 1, 0, 1308, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	null(-2, 28)
	Cls()
	instruct_13()
end
OEVENTLUA[1307] = function ()
	say("朝廷重地，闲人回避！", 208, 0, "官兵")
	Cls()
end
OEVENTLUA[1308] = function ()
	say("朝廷重地，闲人回避！", 208, 0, "官兵")
	Cls()

	if instruct_5() == false then
		Cls()

		return
	end

	if WarMain(141, 0, 1, 1) == false then
		Cls()
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
end
OEVENTLUA[1309] = function ()
	instruct_26(60, 8, 1, 0, 0)
	instruct_26(60, 9, 1, 0, 0)
	instruct_26(60, 7, 1, 0, 0)
	Cls()
	say("什么人？敢擅闯朝廷重地。", 80, 0)
	Cls()
	meet_self(80)
	say("你就是臭名昭着的张召重吗*？", 0, 1)
	Cls()
	say("你是何人？", 80, 0)
	Cls()
	say("我是红花会的朋友，想和你*商量点事。", 0, 1)
	Cls()
	say("哼，想救文泰来？陈家洛呢*？无尘呢？他们有本事就来*啊。怎么让你这么个小毛孩*子来送死！", 80, 0)
	Cls()
	say("救不救文泰来，那是红花会*的事。我今天来，是因为听*说张大人的柔云剑术出神入*化，想来领教一二。", 0, 1)
	Cls()
	say("飞蛾扑火，不自量力！", 80, 0)
	Cls()
	say("张大人可别太自信喽。", 0, 1)
	Cls()
	say("那你就划下道来吧。是单挑*，还是群殴？", 80, 0)
	Cls()
	say("单挑，你一个挑我们一帮；*群殴，我们一帮殴你一个。*公平吧？", 0, 1)
	Cls()
	say("哈哈哈，原来你是来消遣老*夫的。左右，给我拿下。", 80, 0)
	Cls()

	if WarMain(142, 0) == false then
		Cls()
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_14()
	instruct_17(8, 1, 15, 28, 0)
	null(-2, 27)
	instruct_13()
	say("张大人，不好了，那要犯被*人救走了。", 208, 0, "官兵")
	Cls()
	say("什么？好啊，原来你是在跟*我使稳君计！", 80, 0)
	Cls()
	say("你才知道啊，晚喽。", 0, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 9012, 9012, 9012, -2, -2, -2)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 6068, 6068, 6068, -2, -2, -2)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 5970, 5970, 5970, -2, -2, -2)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 6784, 6784, 6784, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 7006, 7006, 7006, -2, -2, -2)
	Cls()
	instruct_13()
	say("四哥，你终于……", 154, 0)
	Cls()
	say("放心，四哥没事。多谢少当*家、众家兄弟，还有这位" .. JY.Person[0].称呼 .. "。", 151, 1)
	Cls()
	say("文四爷客气了。", 0, 0)
	Cls()
	say("姓张的，咱们的帐是不是该*算算了！", 151, 1)
	Cls()
	say("哼，你们人多势众，又连使*诡计，我今天认栽了。这笔*帐我迟早会讨回来的。我和*别人还有约，恕不奉陪了！", 80, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("狗贼别跑。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "不必追赶。", 75, 0)
	Cls()
	say("难道就这么放过他？", 0, 1)
	Cls()
	say("张召重毕竟是武当名宿，我们红花会不好越俎代庖，五哥，你着人通知武当派大师兄马真，看他如何处理。", 75, 0)
	Cls()
	say("既然如此，那就告辞了。", 0, 1)
	Cls()
	say("文四哥伤势未愈，红花会还*有些事情要安排。" .. JY.Person[0].称呼 .. "请先*走一步，有缘江湖再见。", 75, 0)
	Cls()
	say("好，告辞。", 0, 1)
	Cls()
	say("感谢" .. JY.Person[0].称呼 .. "救我夫君。这是我*家传的鸳鸯刀法，就赠与" .. JY.Person[0].称呼 .. "吧。", 154, 0)
	Cls()
	addthing(162, 1)
	Cls()

	if instruct_16(77) then
		say("萧家妹子，我看你似乎学过鸳鸯刀法，但有些地方用的还不纯熟，让我来指点你一二如何？", 154, 1)
		say("好啊，那就谢谢骆姐姐了。", 77, 0)
		dark()

		JY.Person[77].武学常识 = JY.Person[77].武学常识 + 10

		instruct_35(77, 0, 54, 50)
		light()
		say(JY.Person[0].姓名 .. "，萧家妹子是难得一见的好妹子，你可要好好珍惜。", 154, 0)
		say("知道了。", 0, 1)
		DrawStrBoxWaitKey("萧中慧领悟了鸳鸯刀绝技，暴怒时攻击会触发特效", C_RED, CC.DefaultFont, nil, C_GOLD)
		DrawStrBoxWaitKey("萧中慧的武学常识提高了", C_GOLD, CC.DefaultFont, nil, LimeGreen)
	end

	instruct_14()
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	null(17, 3)
	addevent(17, 3, 1, 1318, 1, 6810, -2, -2)
	addevent(124, 9, 0, 1313, 3, -2, -2, -2)
	addevent(124, 15, 1, -2, 1, 7046, -2, -2)
	addevent(124, 16, 1, -2, 1, 7050, -2, -2)
	addevent(124, 108, -2, -2, -2, 9006, 30, 32)
	addevent(124, 109, -2, -2, -2, 9166, 31, 32)
	addevent(124, 110, -2, -2, -2, 9164, 33, 34)

	JY.Person[75].好感度 = 70

	Cls()
	instruct_13()
end
OEVENTLUA[1310] = function ()
	null(-2, 5)
	instruct_26(60, 8, 1, 0, 0)
	instruct_26(60, 9, 1, 0, 0)
	instruct_26(60, 7, 1, 0, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 7034, 7034, 7034, -2, -2, -2)
	instruct_3(-2, 13, 1, 0, 238, 0, 0, 8208, 8208, 8208, -2, -2, -2)
	instruct_3(-2, 14, 1, 0, 238, 0, 0, 6092, 6092, 6092, -2, -2, -2)
	instruct_3(-2, 15, 1, 0, 238, 0, 0, 6092, 6092, 6092, -2, -2, -2)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 6068, 6068, 6068, -2, -2, -2)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 5970, 5970, 5970, -2, -2, -2)
	addevent(-2, 25, 1, -2, 1, 7004, -2, -2)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 6784, 6784, 6784, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 7006, 7006, 7006, -2, -2, -2)
	instruct_13()
	Cls()
	say("姓张的，咱们的帐是不是该*算算了！", 151, 1)
	Cls()
	say("哼，你们人多势众，又连使*诡计，我今天认栽了。这笔*帐我迟早会讨回来的。我和*别人还有约，恕不奉陪了！", 80, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	null(-2, 3)
	null(-2, 14)
	null(-2, 15)
	instruct_13()
	say("狗贼别跑。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "不必追赶。", 75, 0)
	Cls()
	say("（都受伤不轻啊，嘿嘿）", 0, 1)
	say("难道就这么放过他？", 0, 1)
	Cls()
	say("张召重和王维扬相约恒山决斗，他注重名声，必定会去。", 75, 0)
	Cls()
	say("张召重毕竟是武当名宿，我们红花会不好越俎代庖，五哥，你着人通知武当派大师兄马真，看他如何处理。", 75, 0)
	Cls()
	say("（终于该我出场了）", 0, 1)
	Cls()
	say("兄弟，你这是？", 152, 0)
	Cls()
	say("陈公子，我对你另有安排，对不住了。", 0, 1)
	instruct_37(-2)
	Cls()

	if WarMain(139, 0) == false then
		instruct_15()
		Cls()

		return
	end

	Cls()
	null(-2, 2)
	null(-2, 13)
	null(-2, 24)
	null(-2, 26)
	say("陈公子，小心。", 74, 0)
	null(-2, 23)
	Cls()
	say("可恶，你...（她是香香公主的姐姐，我终究不能对她动手，只是可惜跑了红花会的反贼）", 0, 1)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	null(-2, 25)

	if inteam(1) then
		say("我真是看错你了，道不同不相为谋。", 1, 0)
		dark()
		light()
		instruct_21(1)
		null(70, 5)
	end

	if inteam(2) then
		instruct_21(2)
		null(70, 6)
	end

	if inteam(54) then
		say("我真是看错你了，道不同不相为谋。", 54, 0)
		dark()
		light()
		instruct_21(54)
		null(70, 51)
	end

	Cls()
	instruct_14()
	instruct_3(38, 1, 0, 0, 0, 0, 1312, 0, 0, 0, -2, -2, -2)
	instruct_3(38, 0, 0, 0, 0, 0, 0, 7034, 7034, 7034, -2, -2, -2)
	instruct_3(38, 7, 0, 0, 0, 0, 0, 7050, 7050, 7050, -2, -2, -2)
	instruct_3(38, 3, 0, 0, 0, 0, 0, 5970, 5970, 5970, -2, -2, -2)
	instruct_3(38, 4, 0, 0, 0, 0, 0, 6058, 6058, 6058, -2, -2, -2)
	instruct_3(38, 5, 0, 0, 0, 0, 0, 6786, 6786, 6786, -2, -2, -2)
	instruct_3(38, 6, 0, 0, 0, 0, 0, 5892, 5892, 5892, -2, -2, -2)
	instruct_3(38, 2, 0, 0, 0, 0, 0, 5454, 5454, 5454, -2, -2, -2)
	Cls()
	instruct_13()
end
OEVENTLUA[1312] = function ()
	dark()
	null(-2, 1)
	light()
	say("红花会的人？对了，他们说张召重要和什么王维扬比斗来着，就在这里。", 0, 1)
	Cls()
	say("众位兄弟，这便是威震河朔的王维扬王老英雄，张召重连使诡计，要把王老英雄至于死地。", 75, 0)
	Cls()
	say("哼，这张召重甘为鹰犬，为祸武林，我们先把他拿下再说。", 1235, 1, "王维扬")
	Cls()
	say("你们仗着人多势众，张某不服，有本事和张某单挑。", 80, 0)
	Cls()
	say("你以为你今日还能全身而退么？", 1235, 1, "王维扬")
	instruct_14()
	addevent(38, 99, 1, -2, 1, 8234, 33, 35)
	instruct_13()
	Cls()
	say("住手！", 253, 0, "马真")
	Cls()
	say("马道长！", 75, 1)
	say("各位朋友，我这师弟犯下滔天罪业，实是该杀。只是也有我武当教养不严之罪！", 253, 0, "马真")
	say("今日我代武当给各位英雄赔罪了！（说着当下向众人跪了下来）", 253, 0, "马真")
	Cls()
	say("众人面面相觑，不知如何是好，陈家洛急忙去扶", 0, 2)
	say("还望各位饶了他死罪，待我带回武当好好管教，从此不出江湖。", 253, 0, "马真")
	Cls()
	say("道长既如此说，自无不可。", 75, 1)
	Cls()
	say("师弟，还不赶快给众位好汉赔罪！", 253, 0, "马真")
	Cls()
	say("各位，往日对不住了。", 80, 1)
	Cls()
	say("各位保重，师弟，我们走吧。", 253, 0, "马真")
	instruct_14()
	null(-2, 99)
	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 5318, 5318, 5318, -2, -2, -2)
	Cls()
	instruct_13()
	Cls()
	say("陈当家，各位英雄，救命之恩，如同再造。我过去有对不起各位英雄的地方，还望见谅。", 1235, 0, "王维扬")
	Cls()
	say("王老英雄不必客气。", 75, 1)
	Cls()
	say("过去的事，我们也有不对的地方，还望王老英雄海涵。", 75, 1)
	Cls()
	say("从今日起，我金盆洗手，退出武林，回家养老啦。各位，告辞了。", 1235, 0, "王维扬")
	Cls()
	instruct_14()
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	instruct_14()
	Cls()
	instruct_13()
	say("（帮手都走了？嘿嘿嘿，该我出场了）", 0, 1)
	My_Enter_SubScene(38, 32, 34, 3)
	say("陈当家的，好巧，我们又见面了。", 0, 1)
	Cls()
	say("可恶的小贼，你究竟是什么人？", 75, 0)
	say("不是什么人，就是看你不顺眼。", 0, 1)

	if WarMain(140, 0) == false then
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	say("呼，终于解决了。咿，这是什么书？《书剑恩仇录》？怎么在陈家洛身上，待我有空看看。", 0, 1)
	addthing(152, 1)
	addthing(103, 1)
	Cls()
	say("（这下把翠羽黄衫也搭上了，可怎么和香香公主交待？哎，待先回去见了她再想办法。）", 0, 1)
	addevent(107, 18, 1, 1336, 1, -2, -2, -2)
	addevent(107, 20, 1, 1336, 1, -2, -2, -2)
	addevent(107, 24, 1, 1335, 1, -2, -2, -2)
	addevent(107, 25, 1, 1335, 1, -2, -2, -2)
	addevent(107, 26, 1, 1335, 1, -2, -2, -2)

	if has_thing(329) then
		dark()
		addevent(38, 100, 1, -2, 1, 5956, 37, 36)
		light()
		say("恭喜少侠，手刃红花会反贼。", 1044, 0, "大内密探")
		say("你是什么人？", 0, 1)
		say("小人是福大帅手下密探，得大帅命令，看少侠是否有需要相助的地方。", 1044, 0, "大内密探")
		say("少侠武功高强，今次立了大功，回去必定加官进爵。", 1044, 0, "大内密探")
		say("你来的正好，将这一干红花会的人头都带回去给福大帅，我随后就到。", 0, 1)
		say("是，小人遵命。", 1044, 0, "大内密探")
		dark()
		null(-2, 100)
		light()
		say("（这福大帅果然还是不放心我啊。）", 0, 1)
		say("赶快回去看看香香公主。", 0, 1)
	end

	addevent(17, 3, 1, 1318, 1, 6810, -2, -2)
end
OEVENTLUA[1313] = function ()
	Cls()
	null(-2, 9)
	say("咦，前方似乎有人打斗？", 0, 1)
	My_Enter_SubScene(124, 40, 34, 2)
	say("是翠羽黄衫和陈家洛，咦，翠羽黄衫似乎受了重伤？", 0, 1)
	say("漠北六魔，我将你们从狼群中救出来，你们就是这么报答我的？", 75, 0)
	say("六魔？嘿嘿，我们现在可只有三魔了。一个被这小丫头杀了，两个被你红花会杀了。", 1150, 1, "大魔")
	say("老大，和他们废话做什么？现在小丫头受了重伤，这小子独木难支，一口气杀了他们，为老三老五老刘报仇啊。", 1160, 0, "二魔")
	say("住手！", 0, 1)
	say("糟糕，来了帮手，快动手。", 1160, 0, "二魔")

	if WarMain(321, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	dark()
	null(-2, 109)
	My_Enter_SubScene(124, 33, 35, 2)
	light()
	say("我和你们拼了！", 1160, 0, "二魔")
	say("（二魔拼着受了陈家洛一拳扑倒霍青桐旁边，一刀砍去）", 0, 1)
	say("（只听叮的一声，却是霍青桐早有防备，一滚身躲了开去，那一刀就砍在石壁上）", 0, 1)
	say("青桐！（陈家洛早红了眼，拔出身边匕首刺了过去，二魔不闪不避，这一匕首刺在他肩胛骨上，二魔一扭身，只听呲的一声，匕首应声而断）", 75, 0)
	say("死！", 1160, 0, "二魔")
	say("去死吧！", 0, 1)
	say("啊！", 1160, 0, "二魔")
	dark()
	null(-2, 110)
	light()
	say("还有一个，你也死吧！", 0, 1)
	say("少侠，等等，这位不是坏人，不要杀他。", 75, 0)
	say("哎，多谢陈当家不杀之恩。今次我来回疆却是来错啦！", 1149, 1, "四魔")
	say("各位，告辞。", 1149, 1, "四魔")
	dark()
	null(-2, 108)
	light()
	say("多谢少侠相助。", 75, 0)
	say("不用客气！青桐姑娘怎么样了？", 0, 1)
	say("我不妨事，你们看看这匕首？（却是刚才那匕首以为折断了的，却是刀身里面还藏着一把小一点的匕首，原本的刀身就似乎是第二层刀鞘）", 74, 0)
	say("这个刀身里有东西，似乎是个地图。", 74, 0)
	say("这个地图，咦，这地形形状有些像旁边这座山的，真是有些巧了，我们看看去。不过这样的直壁如何能上去？", 75, 1)
	say("那个柱子口有些异常，我们过去看看？", 0, 0)
	say("好。", 75, 1)

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 74, 0)
		null(124, 15)
		instruct_3(124, 17, 1, 0, 1314, 0, 0, 7046, 7046, 7046, -2, -2, -2)
	else
		null(124, 15)
		instruct_10(74)
	end

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 75, 0)
		null(124, 16)
		instruct_3(124, 18, 1, 0, 1315, 0, 0, 7050, 7050, 7050, -2, -2, -2)
	else
		null(124, 16)
		instruct_10(75)
	end

	addevent(124, 10, 1, 1380, 1, -2, -2, -2)
end
OEVENTLUA[1314] = function ()
	say2("有需要我帮忙的地方吗？", 74, 0, "霍青桐")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(74)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 74, 0, "霍青桐")
		Cls()

		return
	end
end
OEVENTLUA[1315] = function ()
	say2("有需要我帮忙的地方吗？", 75, 0, "陈家洛")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(75)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 75, 0, "陈家洛")
		Cls()

		return
	end
end
OEVENTLUA[1318] = function ()
	Cls()

	if JY.DAY == 10 and JY.Base.百年标记 == 1 then
		say("我们维族是善良好客的民族，客人你可以在这里歇息，我们还有马奶和葡萄招待你。", 330, 0, "回部族人")

		return
	end

	if JY.Person[588].好感度 == 100 then
		say("我们永远记得香香公主，她为了我们奉献了自己的生命。", 330, 0, "回部族人")

		return
	end

	say("香香公主被可恶的官兵抓走了。", 330, 0, "回部族人")
	say("什么？可恶，是往哪边去了？", 0, 1)
	say("往东边走了。", 330, 0, "回部族人")
	say("愿真主阿拉保佑我们美丽的香香公主。", 330, 0, "回部族人")

	if has_thing(329) then
		addevent(107, 192, 0, 1326, 3, -2, 32, 20)
		addevent(107, 137, 1, -2, 1, 9196, 32, 10)
		addevent(107, 138, 1, -2, 1, 8870, 30, 9)
		addevent(107, 139, 1, -2, 1, 8914, 33, 9)
		addevent(107, 173, 1, -2, 1, 7034, 31, 14)
		addevent(107, 174, 1, -2, 1, 6098, 33, 14)
	end

	if inteam(75) then
		addevent(107, 171, 0, 1319, 3, -2, 24, 43)
		addevent(107, 172, 0, 1319, 3, -2, 24, 42)
	end

	addevent(107, 12, 1, 1504, 1)
	addevent(108, 34, 1, 1532, 1, 6696, -2, -2)
	addevent(108, 35, 1, 1532, 1, 2770, -2, -2)
	null(107, 120)
	null(107, 121)
	null(107, 122)
	null(107, 123)
	null(107, 124)
	null(107, 125)
	null(107, 126)
	null(107, 127)
	null(107, 135)
	null(107, 136)
	null(107, 160)
	null(107, 161)
	null(107, 164)
	null(107, 150)
	null(107, 151)
	null(107, 152)
	null(107, 153)
	null(107, 154)
	null(107, 155)
	null(107, 156)
	null(107, 157)
	null(107, 158)
	addevent(107, 157, 1, 1324, 1, 8632, 28, 25)
	addevent(107, 28, 1, 1324, 1, 8632, -2, -2)
end
OEVENTLUA[1319] = function ()
	Cls()

	if instruct_16(74) and instruct_16(75) then
		dark()
		addevent(107, 32, 1, -2, 1, 7246, -2, -2)
		addevent(107, 31, 1, -2, 1, 8906, -2, -2)
		light()
		say("拜见总舵主。", 1013, 0, "红花会众")
		say("有香香公主的消息了吗？", 75, 1)
		say("查到了，几天前张召重带着香香公主进了大帅府。", 1013, 0, "红花会众")
		say("张召重？怎么会，他不是被马真带回武当山了吗？", 75, 0)
		say("马真已经被张召重这狗贼杀死了。", 1013, 0, "红花会众")
		say("啊？他居然敢？这个恶贼，罪该万死。", 75, 1)
		say("总舵主，大帅府里有我们的人，已经找到有一条进入帅府的密道。", 1013, 0, "红花会众")
		say("你们做的很好，这就带我们过去吧。", 75, 1)
		say("是。", 1013, 0, "红花会众")
		dark()
		light()
		My_Enter_SubScene(107, 42, 9, 2)
		say("总舵主，就是这儿，这面墙内的密道直接通到大帅府内。", 1013, 0, "红花会众")
		say("无尘道长他们到京城了吗？", 75, 1)
		say("已经到了，兄弟们已经通知几位舵主，他们很快就会赶来。", 1013, 0, "红花会众")
		say("甚好，你隐在附近，等兄弟们到了让他们进去与我们汇合。", 75, 1)
		say("是。", 1013, 0, "红花会众")
		say("少侠，我们走。", 75, 1)
		null(-2, 171)
		null(-2, 172)
		null(-2, 31)
		null(-2, 32)
		null(17, 3)
		addevent(107, 137, 1, -2, 1, 9196, 32, 10)
		addevent(107, 138, 1, -2, 1, 8870, 30, 9)
		addevent(107, 139, 1, -2, 1, 8914, 33, 9)
		addevent(107, 173, 1, -2, 1, 7034, 31, 14)
		addevent(107, 174, 1, -2, 1, 6098, 33, 14)
		addevent(107, 55, 1, 1320, 1, -2, -2, -2)
		addevent(107, 33, 0, 1321, 3, -2, -2, -2)
	end
end
OEVENTLUA[1320] = function ()
	if instruct_16(74) and instruct_16(75) then
		My_Enter_SubScene(107, 37, 10, 2)
	end
end
OEVENTLUA[1321] = function ()
	Cls()
	dark()
	null(-2, 33)
	null(-2, 192)
	null(-2, 55)
	addthing(329, -1)
	light()
	say("事办好了吗？", 1011, 0, "福康安")
	say("启禀大帅，十分顺利。", 1009, 1, "刘大人")
	say("那就好，那就好。哈哈哈", 1011, 0, "福康安")
	say("张统领，你这次事情办得很好，我重重有赏。", 1011, 0, "福康安")
	say("多谢大帅，皇上今日十分高兴。", 80, 1)
	say("陈当家的，这个福康安怎么和你长得这么像？简直一模一样啊。", 0, 1)
	say("是啊，我看见他就像自己在照镜子一样。", 75, 0)
	say("先不想了，时机难得。趁周围没几个护卫，咱们上！", 0, 1)

	if has_thing(329) then
		say("早知道你们要来！（福康安忽然回头看向这边，微微一笑）", 1011, 0, "福康安")
		say("一群蠢货，你们一路行来我们都清清楚楚，居然真敢闯到这儿来。", 80, 1)
		say("不好，有埋伏。上，先抓住福康安。", 0, 1)
		say("（忽听当的一声，你只感觉脚下一空，迎面一片闪闪刀光扑来，却是一个无底深洞，下面布满闪光的刀剑。）", 0, 1)
		say("不好！我命休已！！啊~~~", 0, 1)
		dark()
		My_Enter_SubScene(91, 10, 8, 3)
		light()

		if JY.Person[0].性别 == 0 then
			instruct_27(-1, 8120, 8128)
		else
			instruct_27(-1, 8140, 8146)
		end

		My_Enter_SubScene(5, 102, 35, 3)
		say("恭喜大帅，一举擒获红花会匪首。", 80, 1)
		say("嗯，只是可惜了，本以为是一把好刀。", 1011, 0, "福康安")
		say("很遗憾，你落入陷阱，最后死于坑底尖刀之下...", 0, 2)
		instruct_15(0)
		instruct_0()

		return
	else
		My_Enter_SubScene(107, 34, 11, 2)
		say("什么人？", 80, 0)
		say("杀你的人。", 0, 1)

		if WarMain(322, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(-2, 138)
		null(-2, 139)
		null(-2, 174)
		My_Enter_SubScene(107, 32, 14, 2)
		addevent(107, 177, -2, -2, -2, 8906, 33, 13)
		addevent(107, 178, -2, -2, -2, 7046, 29, 14)
		light()
		say("少侠，我错了，我罪该万死，求少侠饶我一命，我愿为少侠效力。", 80, 1)

		if yesno("要饶张召重一命吗？") then
			say("你的武功还算马马虎虎，今后就跟着我吧。", 0, 1)
			say("少侠，不可。此人阴险狡诈，是个祸害。", 75, 0)
			say("无妨，此人我还有用，他翻不出什么浪来。", 0, 1)

			if instruct_20() then
				Cls()
				say("你的队伍已满。", 0, 2)
				say("你先站一边去。", 0, 1)
				say("是是。", 80, 0)
				instruct_3(107, 2, 1, 0, 1455, 0, 0, 7034, 7034, 7034, -2, -2, -2)
			end

			null(-2, 173)
			instruct_10(80)
		else
			say("如此恶人，如何能留你。死吧！", 0, 1)
			say("啊~", 80, 0)
			null(-2, 173)
			instruct_37(1)
		end

		Cls()
		My_Enter_SubScene(107, 32, 14, 0)
		say("福康安，香香公主在哪儿？", 0, 1)
		say("你们来是为了香香公主？", 1011, 0, "福康安")
		say("交出香香公主，饶你不死。", 0, 1)
		say("我交，不过香香公主在皇宫内。只要绕我一命，我可以帮你们救她出来。", 1011, 0, "福康安")
		say("这是怎么回事？", 75, 1)
		say("香香公主刚到京城，皇上就知道了，立刻就派人接入了皇城，说是要立为贵妃。", 1011, 0, "福康安")
		say("皇宫守卫森严，没有我你们是进不去的，让我帮你们！", 1011, 0, "福康安")

		if has_thing(321) then
			say("用不着你，我自有办法。做了这么多年大清的大帅，你也该去了。", 0, 1)
			say("不~", 1011, 0, "福康安")
			null(-2, 137)
			say("少侠，接下来我们怎么办？", 75, 0)

			if JY.Person[0].悟性 < 80 then
				say("这一刻，你诸葛亮附体，以往不怎么灵光的脑子突然灵光频闪", 0, 2)
				AddPersonAttrib(0, "悟性", 2)
				DrawStrBoxWaitKey("你的悟性增加了2", C_ORANGE, CC.DefaultFont, 2)
			end

			say("据说红花会上下有数万会众，真的假的。", 0, 1)
			say("自然是真，而且我红花会人人操练武艺，如是对上官兵，皆能以一敌五。", 75, 0)
			say("如此甚好，陈兄弟，把咱们这些兄弟都安排进御林军中和京城城防军中吧。", 0, 1)
			say("啊？少侠，我红花会虽然有些势力，但是这个却是有些难度，需得慢慢安排。", 75, 0)
			say("不难，不难，只要陈兄弟你愿意吃些苦，复兴汉室也大有可能。", 0, 1)
			say("如能复兴我汉室江山，我个人吃些苦又算得什么。", 75, 0)
			say("很好，陈兄弟，从今日起，你做做这大清的福大帅可好？", 0, 1)
			say("这，我对官场中事一窍不通，只怕误了大事。", 75, 0)
			say("无妨，你乃是福大帅。只要和皇帝在一起注意点就好。今日大帅府出了如此事故，将府中护卫都革了吧，重新选些护卫来。", 0, 1)
			say("这...，好，今日我就随少侠拼一把。待我安排一下，再入宫打探一下香香公主的情况。", 75, 0)
			dark()
			instruct_3(-2, 181, 1, 0, -2, 0, 0, 6290, 6290, 6290, -2, 29, 12)
			instruct_3(-2, 182, 1, 0, -2, 0, 0, 6056, 6056, 6056, -2, 30, 12)
			instruct_3(-2, 183, 1, 0, -2, 0, 0, 6068, 6068, 6068, -2, 31, 12)
			instruct_3(-2, 184, 1, 0, -2, 0, 0, 5890, 5890, 5890, -2, 32, 12)
			instruct_3(-2, 185, 1, 0, -2, 0, 0, 6784, 6784, 6784, -2, 33, 12)
			light()
			say("总舵主，我们来了。", 151, 0)
			say("总舵主。", 152, 0)
			say("总舵主。", 153, 0)
			say("文四哥，二哥，三哥，你们来的正好，这次咱们要干一件大事。", 75, 0)
			say("你们先整顿一下帅府，我先去皇宫周围探探情况。", 0, 1)
			say("少侠，万事小心。", 75, 0)
			instruct_21(74)
			instruct_21(75)
			dark()
			My_Enter_SubScene(107, 48, 39, 3)
			addevent(107, 24, 1, 1322, 1, -2, -2, -2)
			addevent(107, 36, 1, 1323, 1, 6056, -2, -2)
			null(-2, 2)
			null(-2, 177)
			null(-2, 178)
			null(-2, 181)
			null(-2, 182)
			null(-2, 183)
			null(-2, 184)
			null(-2, 185)
			null(-2, 19)
			null(-2, 29)
			null(-2, 28)
			null(-2, 30)
			light()
			addtime(1)
			say("一天很快过去", 0, 2)
			addevent(108, 28, 1, 1521, 1, -2, -2, -2)
			addevent(108, 29, 1, 1521, 1, 8886, -2, -2)

			if JY.Person[634].好感度 == 51 then
				addevent(108, 19, 0, 13531, 3, -2, -2, -2)
				addevent(108, 28, 0, 13531, 3, -2, -2, -2)
			end
		else
			say("我信不过你。", 0, 1)
			say("我知道，我将我最爱的女人交给你为人质，等救出香香公主，咱们再交换。", 1011, 0, "福康安")
			say("不够。", 0, 1)
			say("（咬牙）我儿子也交给你们，不过我就这一个儿子，你们不能让他饿着了累着了。", 1011, 0, "福康安")
			say("好。", 0, 1)
			say("来人，去将青文和小公子请过来。", 1011, 0, "福康安")
			say("是。", 222, 0, "护卫")
			dark()
			addevent(107, 179, -2, -2, -2, 8952, 31, 15)
			addevent(107, 180, -2, -2, -2, 9250, 32, 15)
			light()
			say("夫君。", 327, 0, "田青文")
			My_Enter_SubScene(107, 32, 14, 3)
			say("青文，你来了。", 1011, 1, "福康安")
			say("你们在这等我两个时辰，我将香香公主带回来。青文，你招待一下少侠他们，我去去就回。", 1011, 1, "福康安")
			dark()
			null(-2, 137)
			light()
			say("半个时辰后", 0, 2)
			dark()
			instruct_3(-2, 181, 1, 0, -2, 0, 0, 6056, 6056, 6056, -2, 29, 12)
			instruct_3(-2, 182, 1, 0, -2, 0, 0, 6290, 6290, 6290, -2, 30, 12)
			instruct_3(-2, 183, 1, 0, -2, 0, 0, 6068, 6068, 6068, -2, 31, 12)
			instruct_3(-2, 184, 1, 0, -2, 0, 0, 5890, 5890, 5890, -2, 32, 12)
			instruct_3(-2, 185, 1, 0, -2, 0, 0, 6784, 6784, 6784, -2, 33, 12)
			light()
			say("总舵主，我们来了。", 151, 0)
			say("总舵主。", 152, 0)
			say("总舵主。", 153, 0)
			say("文四哥，二哥，三哥，你们来的正好，这是福康安的夫人及公子，香香公主被皇上带进宫去了，福康安答应帮我们将香香公主带回来。", 75, 1)
			say("哦，福康安居然吃了这个憋，痛快痛快。", 151, 0)
			say("呵呵。", 75, 1)
			say("他们已经去了半个时辰，三哥，你轻功最好，你去打探打探情况。", 75, 1)
			say("四哥，等香香公主救出来后，只怕京城会有搜捕严查，你和京城的兄弟们联系一下，准备一下退路。", 75, 1)
			say("是，总舵主。", 151, 0)
			say("是。", 153, 0)
			dark()
			null(-2, 181)
			null(-2, 182)
			null(-2, 137)
			light()
			say("半个时辰后", 0, 2)
			dark()
			instruct_3(-2, 182, 1, 0, -2, 0, 0, 6058, 6058, 6058, -2, 32, 19)
			light()
			say("总舵主，不好了。", 153, 0)
			say("外面数千大军团团包围了大帅府，福康安将我们卖了。", 153, 1)
			say("怎么会。", 75, 0)
			say("可恶，我还是小看他了。", 0, 1)
			say("我们快往密道那儿出去，文四哥已经召集了数百兄弟往这儿赶来，等我们回头再找福康安算账。", 151, 0)
			say("这福康安的夫人和孩子怎么办？", 153, 1)
			say("我红花会还不屑于威胁女人和孩子，咱们走。", 75, 0)
			dark()
			null(-2, 177)
			null(-2, 178)
			null(-2, 179)
			null(-2, 180)
			null(-2, 181)
			null(-2, 182)
			null(-2, 183)
			null(-2, 184)
			null(-2, 185)
			My_Enter_SubScene(107, 42, 9, 3)
			addevent(107, 186, -2, -2, -2, 8634, 42, 10)
			addevent(107, 187, -2, -2, -2, 8636, 43, 10)
			light()
			say("反贼在这里了，来人啊，抓住他们！", 319, 0, "官兵")
			say("该死。", 0, 1)

			if inteam(80) then
				instruct_21(80)
				null(107, 2)
			end

			addevent(107, 188, -2, -2, -2, 8634, 42, 12)
			addevent(107, 189, -2, -2, -2, 8636, 42, 14)
			say("总舵主，我们来了！", 1013, 0, "红花会众")
			say("来的正好，你们快挡住他们。", 75, 1)
			say("是，总舵主，你快走！", 1013, 0, "红花会众")
			My_Enter_SubScene(107, 20, 46, 3)
			say("少侠，咱们先离开京城，等风声不紧再回来。", 75, 0)
			say("这次没有救到香香公主，皇帝老儿只怕有了防备，再想救她就难了。", 0, 1)
			say("少侠。", 75, 0)
			say("好，咱们走吧。", 0, 1)
			Cls()
			dark()
			null(-2, 186)
			null(-2, 187)
			null(-2, 188)
			null(-2, 189)

			JY.Person[0].清罪恶值 = JY.Person[0].清罪恶值 + 100

			DrawStrBoxWaitKey("你勾结乱党，你被官府通缉了", C_ORANGE, CC.DefaultFont, 2)
			addtime(7)
			My_Enter_SubScene(3, 20, 46, 1)
			say("呼，总算安全了。", 0, 1)
			light()
		end
	end
end
OEVENTLUA[1322] = function ()
	Cls()
	say("听说皇城来了个大美人，皇上和福大帅为了她争风吃醋呢。", 323, 0, "酒客")
	say("有这样的事，最后谁赢了？", 203, 1, "酒客")
	say("本来福大帅又英俊又有权势，眼看要赢了，结果皇上掀桌子了。", 323, 0, "酒客")
	say("难道皇上把福大帅给抓入大牢了？", 109, 1, "酒客")
	say("那倒是没有，不过皇上派人到福大帅府直接抓走了美人，想来现在福大帅在哭鼻子吧。", 323, 0, "酒客")
	say("皇上倒是好福气啊。", 109, 1, "酒客")
end
OEVENTLUA[1323] = function ()
	Cls()
	say("赵三哥，怎么就你在这儿？陈当家他们呢？", 0, 1)
	say("总舵主昨晚入了皇宫，一直也没有出来，兄弟们都不放心，出去打探消息了。", 153, 0)
	say("怎么会？难道出什么篓子了？什么消息也没有吗？", 0, 1)
	say("凌晨时收到了总舵主手书，说他平安无事，让兄弟们耐心等待，也不知道是什么情况。", 153, 0)
	say("不要着急，你先安排兄弟们混进御林军，皇宫这边我想想办法。", 0, 1)
	say("如此有劳少侠了。", 153, 0)
	null(-2, 190)
end
OEVENTLUA[1324] = function ()
	Cls()
	say("站住，此乃福大帅府邸，闲人退避！", 319, 0, "官兵")

	if JY.Person[601].好感度 == 40 then
		say("原来是你，福大人有令，拿下此人！", 319, 0, "官兵")
		say("怎么？", 0, 1)

		if inteam(75) then
			say("果然已经投靠了天地会的反贼！", 319, 0, "官兵")
		end

		say("还不束手就擒，听凭大帅发落！", 319, 0, "官兵")

		if WarMain(324, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("居然还敢反抗，来人啦~", 319, 0, "官兵")
		say("不好，快走！", 0, 1)
		dark()
		light()
		My_Enter_SubScene(107, 22, 43, 3)

		JY.Person[0].清罪恶值 = 200

		DrawStrBoxWaitKey("你勾结乱党，你被官府通缉了", C_ORANGE, CC.DefaultFont, 2)
	end

	if has_thing(329) then
		say("原来是少侠，福大人有令，少侠请进！", 319, 0, "官兵")
		dark()
		light()
		My_Enter_SubScene(107, 32, 20, 0)
	elseif has_thing(318) and instruct_60(107, 137, 9196) then
		say("没有福大帅传召，不得进入。", 319, 0, "官兵")
	elseif has_thing(318) then
		say("大胆，没看见我有大内令牌吗？你敢阻拦？", 0, 1)
		say("啊，小人不敢。不知大人到此有何贵干？", 319, 0, "官兵")
		say("这是你能知道的事吗？大内的要事你也敢问。", 0, 1)
		say("小人不敢，小人不敢。", 319, 0, "官兵")
		dark()
		My_Enter_SubScene(107, 32, 20, 0)
		light()
	end
end
OEVENTLUA[1326] = function ()
	Cls()
	dark()
	null(-2, 192)
	addevent(107, 137, 1, -2, 1, 9196, 32, 10)
	addevent(107, 138, 1, -2, 1, 8870, 30, 9)
	addevent(107, 139, 1, -2, 1, 8914, 33, 9)
	addevent(107, 173, 1, -2, 1, 7034, 31, 14)
	addevent(107, 174, 1, -2, 1, 6098, 33, 14)
	null(-2, 122)
	null(-2, 123)
	null(-2, 159)
	null(-2, 160)
	null(-2, 161)
	null(-2, 164)
	null(-2, 171)
	null(-2, 172)
	null(-2, 55)
	light()
	say("事办好了吗？", 1011, 0, "福康安")
	say("启禀大帅，香香公主已经顺利送入皇宫，皇上十分高兴。", 80, 1)
	say("那就好，那就好。哈哈哈", 1011, 0, "福康安")
	say("张统领，你这次立了大功，我重重有赏。", 1011, 0, "福康安")
	say("多谢大帅，微臣愿为大帅肝脑涂地，在所不辞。", 80, 1)
	say("香香公主？", 0, 1)
	dark()
	light()
	instruct_30(32, 20, 32, 15)
	say("少侠，你来了。来，我为你们介绍一下，这是御林军骁骑营佐领张召重张大人。", 1011, 0, "福康安")
	say("这次你和张大人都立了大功，我都有重赏。", 1011, 0, "福康安")
	say("刚才你们说香香公主？是张大人从回族抓来的香香公主？", 0, 1)
	say("正是，没想到回族居然有如此天仙般的美人。这次将香香公主献给了皇上，皇上十分高兴。", 1011, 0, "福康安")
	say("大帅，香香公主乃是我钟情之人，还请大帅送还。", 0, 1)
	say("你说什么？", 1011, 0, "福康安")
	say("大胆。你是什么身份，敢和大帅如此说话。", 80, 1)
	say("闭嘴。", 0, 1)
	say("哎，少侠，你还是年轻，把这些看得太重，所谓女人如衣服，兄弟如手足。你今次立了如此大功，我正要向皇上禀明。", 1011, 0, "福康安")
	say("要举荐你为御林军骁骑营副佐领，从此青云直上，什么女人没有。", 1011, 0, "福康安")

	if yesno("要就任御林军骁骑营副佐领吗？") then
		say("多谢大帅，愿辅佐大帅建功立业，荡平天下乱寇。", 0, 1)
		say("哈哈哈哈，你如此明白就好。我明天就向皇上为你们二人请功，皇上必会同意。", 80, 0)
		say("恭喜少侠。", 80, 0)
		say("恭喜张大人，以后同殿为臣，还请多多照拂。", 0, 1)
		say("理所应当，理所应当。", 80, 0)
		instruct_37(-1)
		say("少侠，你如今在京城还没有住处吧？我今日将在京城的别宅赐予你，你先安心休息，刘大人。", 1011, 0, "福康安")
		say("是。", 0, 1)
		say("少侠，请。", 318, 0, "刘大人")
		say("请。", 0, 1)
		dark()
		null(-2, 137)
		null(-2, 138)
		null(-2, 139)
		null(-2, 173)
		null(-2, 174)
		light()
		My_Enter_SubScene(107, 46, 11, 0)
		addevent(107, 193, 1, -2, 1, 8660, 45, 9)
		addevent(107, 198, 1, 1327, 1, 8950, 46, 9)
		say("少侠，就是此处了。", 318, 0, "刘大人")
		say("怎么家具还没弄齐全，来人啊，快去，将我的太师椅搬过来。", 318, 0, "刘大人")
		dark()
		addevent(107, 68, 1, -2, 1, 2698, -2, -2)
		addevent(107, 69, 1, -2, 1, 2500, -2, -2)
		light()
		say("多谢刘大人，刘大人太客气了。", 0, 1)
		say("呵呵，以后同殿为臣，自然要相互照扶。", 318, 0, "刘大人")
		say("自当如此，自当如此。", 0, 1)
		say("还有这位是？", 0, 1)

		if JY.Person[0].性别 == 0 then
			say("呵呵，恭喜少侠，这是福大帅赐给你的美女。", 318, 0, "刘大人")
			say("少侠，春宵一刻值千金，我就不耽误了，告辞。", 318, 0, "刘大人")
		else
			say("呵呵，恭喜少侠，这是福大帅赐给你的婢女。", 318, 0, "刘大人")
			say("少侠早早休息，我就不打扰了，告辞。", 318, 0, "刘大人")
		end

		say("刘大人，你慢走啊。", 0, 1)
		null(-2, 193)

		JY.Person[0].清罪恶值 = 0

		AddPersonAttrib(550, "攻击力", 1)
	else
		if has_thing(222) then
			say("你抢了青文那天我就在忍你，今日你又抢了香香公主，你真以为我是一只狗，像只张大人一样？", 0, 1)
		else
			say("早看你不顺眼了，今日你又抢了香香公主，你真以为我是一只狗，像只张大人一样？", 0, 1)
		end

		say("放肆。", 80, 0)
		say("来人，将他拿下！", 318, 0, "刘大人")
		say("就凭你们这些垃圾？福康安，今日和你的走狗一起死吧。", 0, 1)

		if JY.Base.随从1 == 625 then
			say("早就知道你成不了什么事。小八！", 1011, 0, "福康安")
			addevent(107, 34, 1, -2, 1, 6096, 30, 17)
			addevent(107, 35, 1, -2, 1, 6096, 32, 17)
			addevent(107, 36, 1, -2, 1, 8246, -2, -2)
			say("什么？（突然后背一疼，有什么东西扎入了后背，一股温热的液体随之流了出去，你转过了头）", 0, 1)
			say("老爷。你别怪我，要怪就怪你放着通天大道不走，总是分不清轻重。（飞快的躲到赶来的护卫身后）", 1095, 0, "聂小八")
			say("小人，我当初真不该救你。", 0, 1)

			JY.Base.随从1 = -1

			AddPersonAttrib(0, "生命", -200)
			AddPersonAttrib(0, "生命最大值", -50)
		end

		if WarMain(323, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(-2, 138)
		null(-2, 139)
		null(-2, 173)
		null(-2, 174)
		null(-2, 34)
		null(-2, 35)
		null(-2, 36)
		light()
		say("福康安，现在如何啊？", 0, 1)
		say("别杀我，别杀我！你要什么我都给你。", 1011, 0, "福康安")
		say("把青文还回来。", 0, 1)
		say("好，没问题。", 1011, 0, "福康安")
		say("真是无情无义啊，真是该杀啊。", 0, 1)
		say("刚才和你开个玩笑。", 0, 1)

		if has_thing(322) then
			say("别杀我，别杀我！我帮你们，我帮你们救回香香公主。", 1011, 0, "福康安")
			say("哦？真的？", 0, 1)
			say("真的真的，有我帮你，一定能救出来。", 1011, 0, "福康安")
			say("呵呵，把这个吃下去。", 0, 1)
			say("这是什么？", 1011, 0, "福康安")
			say("快吃！", 0, 1)
			say("是，是。（咕噜）少侠，你这不会是毒药吧，这么香的。", 1011, 0, "福康安")
			addthing(322, -1)
			say("当然不是毒药，此乃是大补药，吃了后可以加强你的气血，你就更年轻英俊了。", 0, 1)
			say("多谢少侠。", 1011, 0, "福康安")
			say("不用谢！这个确实是大补药，不过一年后你就会全身腐烂而死。", 0, 1)
			say("啊？少侠，救命啊。", 1011, 0, "福康安")
			say("以后每年我派人给你一颗解药，你要是不听话，那解药就没了。", 0, 1)
			say("不敢，不敢，以后少侠你让我往哪我就往哪，你放心。我这就派人去打探一下香香公主的情况。", 1011, 0, "福康安")
			say("很好。明天我会再来找你，你给我想出一个救出香香公主的计划来。", 0, 1)
			say("是，是。", 1011, 0, "福康安")
			dark()
			null(-2, 137)
			My_Enter_SubScene(107, 48, 39, 3)
			addevent(107, 190, 1, 1328, 1, 8660, 28, 27)
			light()
			say("一天后。", 0, 1)
			addtime(1)
			AddPersonAttrib(550, "防御力", 1)
		else
			say("说说，怎么能进皇宫救香香公主。", 0, 1)
			say("这个，要进皇宫得有皇上召见才可以的。", 1011, 0, "福康安")
			say("你可是福大帅，随随便便就进去了吧？", 0, 1)
			say("不行的，皇宫守卫森严，没有诏令那是寸步难行。", 1011, 0, "福康安")
			say("这么说留着你也没有用了？", 0, 1)
			say("不不不，我想想，对了，皇上对江湖上传说的鸳鸯刀十分感兴趣，你要能找来，我就能带你进宫去见皇上。", 1011, 0, "福康安")
			say("哦？你没骗我。", 0, 1)
			say("不敢，不敢。", 1011, 0, "福康安")
			say("谅你也不敢，我要发现有什么不对，立即再来杀了你，谅你手下这些废物也拦不住我。", 0, 1)
			say("是是，我在这里等待少侠的好消息。", 1011, 0, "福康安")
			say("哼。", 0, 1)
			AddPersonAttrib(550, "轻功", 1)
			say("一天后。", 0, 1)
			addtime(1)
			dark()
			My_Enter_SubScene(107, 48, 39, 3)
			addevent(107, 137, 1, 1329, 1, 9196, 32, 10)
			addevent(107, 138, 1, -2, 1, 8870, 30, 9)
			addevent(107, 139, 1, -2, 1, 8914, 33, 9)
			light()
			null(-2, 19)
			null(-2, 29)
			null(-2, 28)
			null(-2, 30)

			if JY.Person[634].好感度 == 51 then
				addevent(108, 19, 0, 13530, 3, -2, -2, -2)
				addevent(108, 28, 0, 13530, 3, -2, -2, -2)
			end
		end
	end
end
OEVENTLUA[1327] = function ()
	Cls()

	local var_23_0 = 0
	local var_23_1 = JY.Person[0].性别 == 0 and "夫君" or "小姐"

	if has_thing(217) and JY.Person[601].好感度 > 10 then
		if has_thing(217) and has_thing(218) and JY.Person[588].好感度 == 100 then
			say(var_23_1 .. "，你找到鸳鸯刀了？", 516, 0, "美女")
			say("哈哈，这等小事何足挂齿。", 0, 1)
			say("明天把鸳鸯刀献给福大帅，福大帅又得给你升官了。", 516, 0, "美女")
			say("人生在世，正当建功立业，权力在手。哈哈哈~", 0, 1)
			say(var_23_1 .. "~，让妾身给你洗个澡~", 516, 0, "美女")
			say("好好，今天好好休息一下，明天去见福大帅。", 0, 1)
			dark()
			light()

			if JY.Person[0].性别 == 0 then
				say("小妖精，体力都被你榨干了。", 0, 1)
				AddPersonAttrib(0, "体力", -20)
			else
				say("一夜过去，神清气爽。", 0, 1)
			end

			AddPersonAttrib(0, "体力", -30)
			addevent(107, 137, 1, 1329, 1, 9196, 32, 10)
			addevent(107, 138, 1, -2, 1, 8870, 30, 9)
			addevent(107, 139, 1, -2, 1, 8914, 33, 9)

			return
		else
			say(var_23_1 .. "，福大帅派人找你。", 516, 0, "美女")
			say("哦，我现在就去大帅府报道。", 0, 1)
			say(var_23_1 .. "，不用去了，大帅说江湖上有个鸳鸯宝刀，让你去将它找来，好让他瞧瞧。", 516, 0, "美女")
			say("今天就好好休息吧，你先洗个澡，让妾身给你按摩~", 516, 0, "美女")
			say("好好，今天好好休息一下。", 0, 1)
			dark()
			light()

			if JY.Person[0].性别 == 0 then
				say("小妖精，体力都被你榨干了。", 0, 1)
				AddPersonAttrib(0, "体力", -20)
			else
				say("一夜过去，神清气爽。", 0, 1)
			end
		end
	else
		say(var_23_1 .. "~，你回来了~", 516, 0, "美女")
		say("今天就好好休息吧，你先洗个澡，让妾身给你按摩~", 516, 0, "美女")
		say("好好，今天好好休息一下。", 0, 1)
		dark()
		light()

		if JY.Person[0].性别 == 0 then
			say("小妖精，体力都被你榨干了。", 0, 1)
			AddPersonAttrib(0, "体力", -20)
			say(var_23_1 .. "~", 516, 0, "美女")
		else
			say("一夜过去，神清气爽。你全身又重新燃起了斗志。", 0, 1)
		end

		addtime(1)
	end
end
OEVENTLUA[1328] = function ()
	Cls()

	if has_thing(217) and has_thing(218) and JY.Person[588].好感度 == 100 then
		say("少侠，你找到鸳鸯刀了？", 318, 0, "赵大人")
		say("正是。", 0, 1)
		say("少侠请进，福大帅在大厅等候多时了。", 318, 0, "赵大人")
		addevent(107, 137, 1, 1329, 1, 9196, 32, 10)
		addevent(107, 138, 1, -2, 1, 8870, 30, 9)
		addevent(107, 139, 1, -2, 1, 8914, 33, 9)
		null(-2, 190)
	else
		say("少侠，福大帅派我在此等候少侠。", 318, 0, "赵大人")
		say("哦？福大帅呢？", 0, 1)
		say("大金川土司莎罗奔作乱，皇上急令福大帅率大军60万出征平乱。", 318, 0, "赵大人")
		say("福大帅走前交代什么了吗？", 0, 1)
		say("福大帅说，皇上对江湖上传说的鸳鸯刀十分感兴趣，你要能找来，他就能想办法带你进宫去。", 318, 0, "赵大人")
		say("哦？还有吗？", 0, 1)
		say("对了，福大帅让我从少侠这儿带个什么的解药，要紧急送到他那儿去。他还说请少侠安心。", 318, 0, "赵大人")
		say("...", 0, 1)
	end
end
OEVENTLUA[1329] = function ()
	Cls()
	say("少侠，你来了。", 1011, 0, "福康安")

	if has_thing(217) == false and has_thing(218) == false then
		say("少侠，找到鸳鸯刀了吗？", 1011, 0, "福康安")
		say("还没有，不过我一定会找到的。", 0, 1)

		return
	end

	say("我找到鸳鸯刀了。", 0, 1)
	say("甚好，咱们这就进宫见皇上。", 1011, 0, "福康安")

	if GetTeamNum() > 0 then
		say("少侠，人太多进不去，我只能带你一个人进去。", 1011, 0, "福康安")
		say("也好，就我自己前去。", 0, 1)
	end

	say("福康安随队行动", 0, 2)
	dark()
	null(-2, 137)
	null(-2, 138)
	null(-2, 139)
	null(-2, 190)
	My_Enter_SubScene(108, 50, 35, 0)
	addevent(108, 150, 1, 0, 1, 9198, 49, 34)
	addevent(108, 13, 1, -2, 1, 8620, -2, -2)
	addevent(108, 15, 1, -2, 1, 8668, -2, -2)
	addevent(108, 16, 1, -2, 1, 8668, -2, -2)
	addevent(108, 24, 1, -2, -2, 8608)
	addevent(108, 25, 1, -2, -2, 8608)
	light()
	say("微臣拜见皇上。", 1011, 0, "福康安")
	say("福大帅来了，进来吧。", 317, 1, "大清皇帝")
	say("是。", 1011, 0, "福康安")
	say("少侠，咱们这就拜见皇上。", 1011, 1, "福康安")
	null(-2, 150)
	addevent(108, 26, 1, -2, 1, 9198, -2, -2)
	instruct_30(49, 32, 48, 23)
	say("恭喜皇上，贺喜皇上，微臣侥幸，得到了鸳鸯双刀，特来献给皇上。", 1011, 0, "福康安")
	say("哦，呈上来朕看看。", 317, 1, "大清皇帝")
	say("是。", 1011, 0, "福康安")
	addthing(217, -1)
	addthing(218, -1)
	say("仁者，无敌，原来这就是天下无敌的秘密，这话可也不全对。", 317, 1, "大清皇帝")
	say("汉人果然还是可以以仁义名义统治，你们做的很好。", 317, 1, "大清皇帝")
	say("来人啊，将昨日海外弗朗基斯进贡的葡萄酒夜光杯拿上来。", 317, 1, "大清皇帝")
	say("是。", 258, 0, "侍旨太监")
	say("这葡萄酒夜光杯甚是奇异，福康安，我就留着和你同饮呢。", 317, 1, "大清皇帝")
	say("这位少侠就是你说的武功高强的江湖少侠？你这次立了大功，就陪着我和福大帅一同饮一杯如何？", 317, 1, "大清皇帝")

	if JY.Person[550].攻击力 == 2 then
		say("是。", 0, 1)
		dark()
		light()
		say("今日十分尽兴，我也累了，你们退下吧。", 317, 1, "大清皇帝")
		say("是，微臣遵旨。", 1011, 0, "福康安")
		dark()
		null(-2, 13)
		null(-2, 15)
		null(-2, 16)
		null(-2, 24)
		null(-2, 25)
		light()
		say("少侠，你这次立了大功，皇上十分高兴，我也不会吝于赏赐。", 1011, 0, "福康安")
		addthing(174, 5000)
		say("多谢大帅。", 0, 1)
		say("好了，我有事要办，你自己回去吧。记得皇宫内不要乱走。", 1011, 0, "福康安")
		null(-2, 26)
		say("是。", 0, 1)
		instruct_30(48, 23, 48, 34)

		JY.Person[0].清罪恶值 = 0
	else
		say("酒我就不喝了，皇帝，我只问你，香香公主是不是被你杀了。", 0, 0)
		say("大胆，左右，给我拿下。", 258, 1, "侍旨太监")

		if WarMain(324, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		say("怎么会一下涌出这么多的人？这是早有埋伏？", 0, 1)
		say("哎，少侠，你果然是聪明人。", 1011, 0, "福康安")
		say("你好大的胆子，难道以为这么点人就能困住我吗？真正不知死活。", 0, 1)
		say("所以啊，我将御林军都调来了，如今已经将勤政殿团团围困，你武功高强，就和我手下小将好好玩玩吧。皇上，龙体要紧，咱们先退出去吧。", 1011, 0, "福康安")
		say("呵呵，想对付我？今日还想走吗？", 0, 1)

		if WarMain(323, 0, 1, 1) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		if WarMain(325, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		if JY.Person[75].好感度 >= 70 then
			say("少侠莫慌，御林军里也有一些咱们自己的兄弟。", 234, 0)
			say("弟兄们，红花会今日要杀了鞑子皇帝，大家并肩子上啊。", 234, 0)
		else
			say("保护皇上！", 1011, 0, "福康安")

			if WarMain(325, 0) == false then
				instruct_15()
				Cls()

				do return end

				Cls()
			end
		end

		if JY.Person[550].医疗能力 == 1 then
			say("还有我们天地会的弟兄。", 1137, 1)
			say("天地会的弟兄们，今日就要杀了鞑子皇帝，大家并肩子上啊。", 1137, 1)
		else
			say("保护皇上！", 1011, 0, "福康安")

			if WarMain(325, 0) == false then
				instruct_15()
				Cls()

				do return end

				Cls()
			end
		end

		say("护驾，护驾~", 258, 0, "侍旨太监")

		if instruct_16(54) then
			say("好厉害的贼子。", 184, 0)
			say("这等盛世，怎能缺少了我。", 54, 1)
			say("玉真子，上次让你逃脱了，今日咱们再较量较量。", 54, 1)
			say("哼。", 184, 0)

			if WarMain(325, 0) == false then
				instruct_15()
				Cls()

				do return end

				Cls()
			end
		else
			say("保护皇上！", 1011, 0, "福康安")

			if WarMain(326, 0) == false then
				instruct_15(0)
				instruct_0()

				return
			end
		end

		say("哎呀，救命啊。", 258, 0, "侍旨太监")
		dark()
		null(-2, 15)
		null(-2, 16)
		null(-2, 24)
		null(-2, 25)
		instruct_17(108, 1, 47, 37, 0)
		instruct_17(108, 1, 52, 37, 0)
		light()
		say("都是些废物。", 0, 1)
		say("皇帝，我只问你，香香公主是不是被你杀了。", 0, 1)
		say("她是自杀的，我如何舍得杀她。", 317, 0, "大清皇帝")
		say("哼，不是你把她绑来京城，香香公主又怎么会死，今日你就偿命吧。", 0, 1)
		say("不不不，你不能杀我，我是大清皇帝。", 317, 0, "大清皇帝")

		if has_thing(322) and has_thing(320) and JY.Person[550].防御力 == 2 then
			My_Enter_SubScene(108, 48, 20, 0)
			say("张嘴！把这个吃下去。", 0, 1)
			say("这是什么？", 317, 0, "大清皇帝")
			say("或者你想现在就死。", 0, 1)
			say("好，我吃。（咕隆）", 317, 0, "大清皇帝")
			addthing(322, -1)
			say("皇上~", 1011, 0, "福康安")
			say("是什么毒药吧，你想控制我？那是不可能，我是大清之帝，绝不受敌人威胁。", 317, 0, "大清皇帝")
			dark()
			null(-2, 13)
			light()
			say("真是可惜啊，浪费我一颗丹药。", 0, 1)
			addthing(217, 1)
			addthing(218, 1)
			say("你杀了皇帝，你疯了，你疯了。", 1011, 0, "福康安")
			My_Enter_SubScene(108, 48, 20, 3)
			say("你想不想当皇帝？", 0, 1)
			say("什么？", 1011, 0, "福康安")
			say("我说你想不想当皇帝？", 0, 1)
			say("这，这，这。要怎么做？", 1011, 0, "福康安")
			say("很简单，你就说皇帝被人刺杀，临终前传旨要你继位。", 0, 1)
			say("朝里有三大顾命大臣，人人手握重权，我只怕独力难支。", 1011, 0, "福康安")
			say("你是御林军统领，现在外面还不知情，你将三大顾命大臣依次叫进宫来，不听话的就杀了，说与刺客勾结。不用我教你具体做法吧。", 0, 1)
			say("~", 1011, 0, "福康安")
			say("就这么办。你就这么放心让我当皇帝？", 1011, 0, "福康安")
			say("这段时间你一直在找解药吧？找到了没有？", 0, 1)
			say("这毒药确实厉害，还没有找到解药。", 1011, 0, "福康安")
			say("哼哼，解药是找不到的，这个豹胎易筋丸是没有解药的。只有每年吃上一颗我给的药，才能活命，若是过了一年没有吃，就会全身溃烂而死，你可明白了。", 0, 1)
			say("是，明白明白，我都听你的就是。", 1011, 0, "福康安")
			dark()
			light()
			say("好了，赶快去安排后续吧。", 0, 1)
			say("是，少侠放心，从此后我就与少侠好好合作，一切都照少侠的意思。", 1011, 0, "福康安")

			if has_thing(318) == false then
				say("把这个给我。", 0, 1)
				addthing(318)

				JY.Person[601].好感度 = 10

				say("以后我随时来看你，你要乖一点哦。", 0, 1)
				say("...", 1011, 0, "福康安")
				say("走了走了，十步杀一人，千里不留行，哈哈哈，哈哈哈~", 0, 1)
				My_Enter_SubScene(108, 48, 38, 2)
				dark()
				null(-2, 26)
				addevent(108, 13, 1, 1331, 1, 9196, -2, -2)
				addevent(108, 15, 1, -2, 1, 8668, -2, -2)
				addevent(108, 16, 1, -2, 1, 8668, -2, -2)
				light()
				say("哈哈哈~", 0, 1)
				instruct_37(10)
			end
		else
			My_Enter_SubScene(108, 48, 20, 0)
			say("死~", 0, 1)

			if JY.Person[0].性别 == 0 then
				instruct_27(-1, 7674, 7680)
			else
				instruct_27(-1, 10636, 10640)
			end

			say("等", 317, 0, "大清皇帝")
			dark()
			null(-2, 13)
			light()
			addthing(217, 1)
			addthing(218, 1)
			say("你杀了皇帝，你疯了，你疯了。", 1011, 0, "福康安")
			My_Enter_SubScene(108, 48, 20, 3)
			say("今日设这个埋伏就是为了对付我吧，是不是很失望。", 0, 1)
			say("别别别，别杀我。", 1011, 0, "福康安")
			My_Enter_SubScene(108, 47, 24, 0)
			say("死~", 0, 1)

			if JY.Person[0].性别 == 0 then
				instruct_27(-1, 7674, 7680)
			else
				instruct_27(-1, 10636, 10640)
			end

			say("啊。", 1011, 0, "福康安")
			null(-2, 26)

			JY.Person[0].清罪恶值 = 500

			DrawStrBoxWaitKey("你杀了大清皇帝，必将震动天下", C_ORANGE, CC.DefaultFont, 2)
			AddPersonAttrib(0, "声望", 100)
			instruct_37(15)

			JY.Person[601].好感度 = 0

			null(107, 19)
			say("呼，这个世界，终于，清净了。", 0, 1)
			dark()
			light()
			say("...，这个事情有点大，我还是赶快溜出去吧，别真被大军给围住就麻烦了。", 0, 1)
			dark()
			My_Enter_SubScene(107, 22, 8, 3)
			light()
		end
	end
end
OEVENTLUA[1330] = function ()
	Cls()
	dark()
	light()
end
OEVENTLUA[1331] = function ()
	Cls()

	if JY.Person[0].清罪恶值 >= 50 then
		say("少侠，你来了，可有什么吩咐？", 1011, 0, "福康安")
		say("每次进城都出现一些官兵打打杀杀的，很烦人啊。", 0, 1)
		say("下面的人都不晓事，少侠，我这就下令让他们躲远一点，少侠你看可好？", 1011, 0, "福康安")
		say("嗯，如此就好，不然多影响咱们感情啊，你说是不是？", 0, 1)
		say("正是正是。", 1011, 0, "福康安")

		JY.Person[0].清罪恶值 = 0
	else
		say("少侠，你来了，可有什么吩咐？", 1011, 0, "福康安")
		say("哦，没事没事，我来看看你怎么样了？", 0, 1)
		say("......", 1011, 0, "福康安")
	end
end
OEVENTLUA[1335] = function ()
	say("听说红花会的英雄被清廷剿灭了。", 109, 0, "酒客")
	say("该死，一定是张召重那个狗贼。", 203, 1, "酒客")
	say("不错，定要召集江湖正道高手杀了这个奸徒。", 109, 0, "酒客")
	say("可恨啊可恨。", 203, 0, "酒客")
end
OEVENTLUA[1336] = function ()
	say("这次清廷好大的动作，攻打回疆，抓了数千人回来，听说连他们的公主也抓来了。", 1130, 0, "酒客")
	say("嘘，少说少说，吃饭吃饭。", 1273, 0, "酒客")
	say("你呀，就是胆子小。", 1130, 0, "酒客")
	say("皇城脚下，少惹是非为好。", 1273, 0, "酒客")
end
OEVENTLUA[1379] = function ()
	Cls()
	dark()
	My_Enter_SubScene(124, 31, 50, 1)
	light()
end
OEVENTLUA[1380] = function ()
	Cls()

	if instruct_16(74) and instruct_16(75) then
		say("这里有条密道。", 0, 1)
		dark()
		My_Enter_SubScene(124, 15, 41, 2)
		light()
		say("好漂亮，难道是一座玉做的宫殿。", 74, 0)
		say("不可思议，确实是一座玉石宫殿，不可思议，不可思议。", 75, 0)
		say("我们进去看看。", 0, 1)
	end
end
OEVENTLUA[1381] = function ()
	Cls()

	if has_thing(36) or has_thing(56) or has_thing(37) then
		say("宝玉啊，发财了发财了。", 0, 1)
		addthing(334, 90)
		DrawStrBoxWaitKey("你获得了一大批宝玉", C_ORANGE, CC.DefaultFont, 2)
		null(-2, 2)
	else
		say("发财了发财了，我们带些玉石回去，品质差一点也能成富翁。（你用刀剑使劲往玉璧上砍去，只听叮的一声，玉璧只留下了一条浅浅的白印，你倒吸一口凉气）", 0, 1)
		say("这是玉？难道不是铁石？太硬了吧，一般的刀剑都砍不动啊。", 0, 1)
	end
end
OEVENTLUA[1382] = function ()
	say("哎，这儿有文字，是古回文。", 74, 0)
	say("上面说，一位美丽的少女，为了帮助自己的族人，嫁给了残暴的国王。少女的情人带领族人攻进玉宫，最后和少女一起杀了残暴的国王，所有人都困死在玉宫之内。", 74, 0)
	say("美丽的玉宫被国王的冤魂占据，成为了受诅咒的地方，永永远远被世人封印。玉宫的每块地砖，每件装饰都侵染了数千亡魂的鲜血，碰触的人都会因诅咒凄惨而死。", 74, 0)
	say("哎呀，好可怕。我们快离开吧。", 74, 0)
	say("再看看，再看看。别担心，我们不拿这儿的东西。（这些破石头，想拿也拿不走啊）", 0, 1)
end
OEVENTLUA[1383] = function ()
	Cls()

	if has_thing(36) or has_thing(56) or has_thing(37) then
		say("宝玉啊，发财了发财了。", 0, 1)
		addthing(334, 126)
		DrawStrBoxWaitKey("你获得了一大批宝玉", C_ORANGE, CC.DefaultFont, 2)
		null(-2, 3)
	else
		say("发财了发财了，我们带些玉石回去，品质差一点也能成富翁。（你用刀剑使劲往玉璧上砍去，只听叮的一声，玉璧只留下了一条浅浅的白印，你倒吸一口凉气）", 0, 1)
		say("这是玉？难道不是铁石？太硬了吧，一般的刀剑都砍不动啊。", 0, 1)
	end
end
OEVENTLUA[1384] = function ()
	Cls()

	if has_thing(36) or has_thing(56) or has_thing(37) then
		say("宝玉啊，发财了发财了。", 0, 1)
		addthing(334, 160)
		DrawStrBoxWaitKey("你获得了一大批宝玉", C_ORANGE, CC.DefaultFont, 2)
		null(-2, 4)
	else
		say("发财了发财了，我们带些玉石回去，品质差一点也能成富翁。（你用刀剑使劲往玉璧上砍去，只听叮的一声，玉璧只留下了一条浅浅的白印，你倒吸一口凉气）", 0, 1)
		say("这是玉？难道不是铁石？太硬了吧，一般的刀剑都砍不动啊。", 0, 1)
	end
end
OEVENTLUA[1385] = function ()
	Cls()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 2952, 2952, 2952, -2, -2, -2)
	addthing(286, 1)

	if instruct_16(75) then
		say("似乎是一门刀法，嗯，手之所触，肩之所倚，足之所履，膝之所踦， 砉然向然，奏刀騞然，莫不中音，这是庄子中的庖丁解牛之法，没想到真有这样的武功。", 75, 0)
		stop_ng(75)
		instruct_35(75, 1, 171, 50)

		JY.Person[75].武学常识 = JY.Person[75].武学常识 + 5
		JY.Person[75].耍刀技巧 = JY.Person[75].耍刀技巧 + 10
	end
end
OEVENTLUA[1401] = function ()
	Cls()

	local var_37_0 = 0
	local var_37_1 = JY.Person[0].性别 == 1 and "大姐姐" or "大哥哥"

	dark()
	null(-2, 9)
	addevent(124, 0, 1, 0, 1, 9238, -2, -2)
	light()
	say("嘘！。", 306, 0, "李文秀")
	say("啊？", 0, 1)
	say("悄悄的过来，别发出声音。", 306, 0, "李文秀")
	say("哦。", 0, 1)
	meet_self(590)
	dark()
	My_Enter_SubScene(124, 47, 32, 3)
	light()
	say("小点声，别吓跑了它，跟我趴在这块树丛后往那边看。", 306, 0, "李文秀")
	addevent(124, 0, 1, 0, 1, 9242, -2, -2)
	say("看见了吧。", 306, 0, "李文秀")
	say("看见了，有一只蓝色的小鸟。那是什么鸟？", 0, 1)
	say("这是天灵鸟，最爱在蓝天自由飞翔的鸟儿。像这只飞到地上让咱们看见可是很少见的。", 306, 0, "李文秀")
	say("这鸟儿真可爱。", 0, 1)
	say("是啊是啊，我可喜欢了。", 306, 0, "李文秀")
	say("小妹妹，你既喜欢我就抓了给你。", 0, 1)
	dark()
	light()
	say("给！", 0, 1)
	addevent(124, 0, 1, 0, 1, 9238, -2, -2)
	say("你真抓到了？好可爱。（用手逗弄它）", 306, 0, "李文秀")
	say(var_37_1 .. "，你真好。", 306, 0, "李文秀")
	say("咱们再用树枝编一个笼子吧！", 0, 1)
	say("笼子啊。", 306, 0, "李文秀")
	say("（用手轻轻的逗弄着鸟儿，有些不舍）", 306, 0, "李文秀")
	say("小青鸟，去天上自由自在的飞翔吧，以后别轻易落在地上了，不要再被人抓了啊。", 306, 0, "李文秀")
	dark()
	light()
	say("你把它放了？", 0, 1)
	say("是啊，天有些晚了，" .. var_37_1 .. "，我该回去了，不然计伯伯该担心了。", 306, 0, "李文秀")
	say("好，小妹妹你叫什么名字？", 0, 1)
	say("我叫李文秀，" .. var_37_1 .. "再见！", 306, 0, "李文秀")
	say("嗯，小妹妹再见。", 0, 1)
	dark()
	null(-2, 0)
	null(-2, 6)
	addevent(62, 1, 0, 1402, 3, -2, -2, -2)
	addevent(62, 3, -2, -2, -2, 5430, -2, -2)
	addevent(62, 4, -2, -2, -2, 9238, -2, -2)
	addevent(62, 5, -2, -2, -2, 5932, -2, -2)
	addevent(62, 6, -2, -2, -2, 6096, -2, -2)
	addevent(62, 7, -2, -2, -2, 6094, -2, -2)
	addevent(62, 8, -2, -2, -2, 6098, -2, -2)
	addevent(62, 9, -2, -2, -2, 6098, -2, -2)
	instruct_26(3, 3, 1, 0, 0)
	instruct_26(3, 2, 1, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	light()
end
OEVENTLUA[1402] = function ()
	Cls()
	dark()
	null(-2, 1)
	light()
	say("咦？前面发生什么事了？>", 0, 1)
	instruct_0()
	instruct_25(44, 25, 36, 25)
	instruct_0()
	say("你觉得你还能逃出去么？识相的话就快将高昌迷宫的地图交出来。", 137, 0)
	meet_self(137)
	instruct_0()
	say("你们这群杀我爹娘的恶人，我死也不会交给你们的。", 306, 4, "李文秀")
	instruct_0()
	instruct_25(36, 25, 44, 25)
	instruct_0()
	say("＜是沙漠里遇到的那个小姑娘。＞", 0, 1)
	instruct_0()

	if DrawStrBoxYesNo(-1, -1, "我是否应该挺身而出呢？", C_ORANGE, CC.DefaultFont) == true then
		say("住手！", 0, 1)
		instruct_0()
		instruct_0()
		instruct_30(44, 25, 40, 25)
		instruct_0()
		say("你们一大堆男人欺负一个小姑娘，不觉得羞愧吗？", 0, 1)
		instruct_0()
		instruct_3(-2, 5, 0, 0, 0, 0, 0, 5926, 5926, 5926, -2, -2, -2)
		say("哪里蹦出来的野猴子，连我青蟒剑的事也敢插手，活的不耐烦了是不？", 137, 0)
		instruct_0()
		say("有种再说一遍！！", 0, 1)
		instruct_0()
		say("我说哪里蹦出来的野猴子，连我青蟒剑的事也敢插手...", 137, 0)
		instruct_0()
		say("再！说！一！遍！", 0, 1)
		instruct_0()
		say("你耳朵有问题是不？我说哪里来的野猴子..", 137, 0)
		instruct_0()
		say("你！可以去死了！", 0, 1)
		instruct_0()

		if WarMain(92, 1) == true then
			instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 5, 0, 0, 0, 0, 0, 5926, 5926, 5926, -2, -2, -2)
			instruct_0()
			instruct_13()
			say("大侠，小的有眼不识泰山，冒犯了大侠，该死。", 137, 0)
			instruct_0()
			say("受死吧！", 0, 1)
			instruct_0()
			instruct_14()
			instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_0()
			instruct_13()

			if has_thing(282) == false then
				addthing(282)
			end

			local var_38_0 = 0
			local var_38_1 = JY.Person[0].性别 == 1 and "大姐姐" or "大哥哥"

			say(var_38_1 .. "，是你啊！", 306, 0, "李文秀")
			instruct_0()
			instruct_30(40, 25, 37, 25)
			instruct_0()
			say("小姑娘，这是怎么回事？", 0, 1)
			instruct_0()
			say(var_38_1 .. "，快救救我师父，他中了毒针。", 306, 0, "李文秀")
			meet_self(138)
			instruct_0()
			instruct_1(256, 0, 1)
			instruct_0()
			instruct_1(257, 0, 2)
			instruct_0()
			instruct_14()
			instruct_3(-2, 3, 0, 0, 0, 0, 0, 6796, 6796, 6796, -2, -2, -2)
			instruct_0()
			instruct_13()
			instruct_1(258, 138, 0)
			instruct_0()
			say("＜高昌迷宫？就算是我也不能这么说呀＞我根本不知道什么高昌迷宫，是这位姑娘求我帮你的。", 0, 1)
			instruct_0()
			instruct_1(260, 138, 0)
			instruct_0()
			addthing(35, 3)
			instruct_0()
			say("＜就这么点酬劳啊＞", 0, 1)
			instruct_0()
			instruct_1(262, 138, 0)
			instruct_0()
			instruct_14()
			instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_0()
			instruct_13()
			say(var_38_1 .. "，我师父脾气有些古怪。你不要怪他。", 306, 0, "李文秀")
			instruct_0()
			say("小妹妹，你今后有何打算？", 0, 1)
			instruct_0()
			say("我也不知道，我爹娘都被那些恶人害死了，我喜欢的人又有了别的心上人……", 306, 0, "李文秀")
			instruct_0()
			instruct_1(265, 0, 1)
			instruct_0()
			say("这，也好，那你帮我顺便找寻高昌迷宫的下落，这条手帕和这匹白马是爹娘仅留的两个物事，或许秘密就藏在这里面了。", 306, 0, "李文秀")
			instruct_0()

			if instruct_20() then
				say("你的队伍已满，我先回小村吧。", 306, 0, "李文秀")
				instruct_3(70, 86, 1, 0, 1456, 0, 0, 9238, 9238, 9238, 0, 0, 0)
			else
				instruct_10(590)
			end

			instruct_14()
			instruct_3(-2, 61, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 62, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 3, 1, 0, 692, 0, 0, 5098, 5098, 5098, 0, -2, -2)
			instruct_3(-2, 4, 1, 0, 695, 0, 0, 8250, 8250, 8250, 0, -2, -2)
			instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(62, 0, 0, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
			instruct_3(62, 1, 0, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
			instruct_3(62, 2, 0, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
			instruct_0()
			instruct_13()
			addthing(224, 1)
			instruct_0()
			addthing(230, 1)
			addthing(291, 1)
			instruct_0()
			instruct_37(2)
			instruct_0()
		else
			instruct_15(0)
			instruct_0()
		end
	else
		say("＜还是再观望一下，说不定能得到迷宫的下落＞", 0, 1)
		instruct_0()
		instruct_25(44, 25, 36, 25)
		instruct_0()
		say("兄弟们，大家一起上！", 137, 0)
		instruct_0()
		instruct_14()
		instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_0()
		instruct_13()
		say("你这臭婊子竟然放毒针！我杀了你！", 137, 0)
		instruct_0()
		say("李文秀手一滑，将随身手绢掉了出来，上面已沾满了血渍，隐约可见是一幅山川图。", 0, 2)
		instruct_0()
		say("这是..这是高昌迷宫的地图，终于让我找到了！哈哈哈....", 137, 0)
		instruct_0()
		say("师父，趁现在，我们快走！", 306, 1, "李文秀")
		instruct_0()
		instruct_14()
		instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_0()
		instruct_13()
		instruct_25(36, 25, 44, 25)
		instruct_0()
		say("螳螂捕蝉，黄雀在后。快将地图交过来吧。", 0, 1)
		instruct_0()
		instruct_30(44, 25, 40, 25)
		instruct_0()
		instruct_3(-2, 5, 0, 0, 0, 0, 0, 5926, 5926, 5926, -2, -2, -2)
		say("哪来的野猴子，敢抢老子的东西。", 137, 0)
		instruct_0()
		say("不知死活！", 0, 1)
		instruct_0()
		SetS(87, 31, 33, 5, 1)

		if WarMain(92, 1) == true then
			instruct_39(87)
			instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_0()
			instruct_13()
			instruct_37(-3)
			instruct_0()
			addthing(224, 1)
			say("手帕上鲜血侵染，构成了一幅地图，右上角显示了71、269几个数字，你赶紧记了下来。", 0, 1)
			instruct_0()
			say("这白马不错，归我了。", 0, 1)
			instruct_0()
			addthing(230, 1)
			instruct_0()
			say("这地上还有本秘籍。", 0, 1)
			instruct_0()
			addthing(285, 1)
			instruct_0()
			instruct_3(62, 1, 0, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
		else
			instruct_15(0)
			instruct_0()
		end

		SetS(87, 31, 33, 5, 0)
	end
end
OEVENTLUA[1403] = function ()
	Cls()

	if inteam(590) then
		say("宋小娘子是我先约好的，你不要拦我的路。", 288, 0, "圣院书生")
		say("胡说，宋小娘子昨日就收了我的银子，说好的今日给我唱小曲，怎可能答应见你的。", 1077, 1, "孔院书生")
		say("让开，不然我到府衙告你一状，让你今次在牢里过上几日，看宋小娘子见了你还能不能认出来。", 288, 0, "圣院书生")
		say("胡兄。~", 1077, 1, "孔院书生")
		say("路兄，果然如你所说，这张生够粘人的，这次我就帮你这个忙。张生，你回家躺几天吧。", 1061, 0, "武院书生")
		say("小心，啊~", 306, 1, "李文秀")
		addevent(123, 10, 1, -2, 1, 9238, -2, -2)
		say("小妹，你们...，真是好胆。", 0, 1)
		say("哎呀，插错人了。这位姑娘，对不住啊，路生，你快赔给这位小姑娘医药费，我先走了。", 1061, 0, "武院书生")
		null(-2, 7)
		say("哎呀，这是怎么搞的，对不住啊。", 1077, 0, "孔院书生")
		addthing(174, 1)
		dark()
		null(-2, 8)
		null(-2, 9)
		light()
		say("我...，小妹，你没事吧。（急忙找出张手帕给文秀包扎）", 0, 1)
		say("我没事，这些书生身上没有力气，我只是胳膊被扎破了皮。", 306, 0, "李文秀")
		say("真是倒霉，哎？小妹，你看这手帕。", 0, 1)
		say("只见手帕上面已沾满了血渍，隐约可见是一幅山川图", 0, 2)
		say("这是..这是高昌迷宫的地图，难怪爹娘要我一直带在身上。上面写着71、269几个数字，这是坐标。", 306, 0, "李文秀")
		say("我们去看看吧。", 306, 0, "李文秀")
		say("好。", 0, 1)
		instruct_39(87)
		null(-2, 10)
	else
		say("林婉儿是临安最美丽的女人。", 1077, 0, "孔院书生")
		say("不，宋小娘子才是临安最温柔，最美丽的女人。", 288, 1, "圣院书生")
		say("喂，你干什么？不要偷听我们谈话。", 1077, 0, "孔院书生")
	end
end
OEVENTLUA[1411] = function ()
	Cls()
	dark()
	null(-2, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 5218, 5218, 5218, -2, -2, -2)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 5220, 5220, 5220, -2, -2, -2)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 5220, 5220, 5220, -2, -2, -2)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 6766, 6766, 6766, -2, -2, -2)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 6766, 6766, 6766, -2, -2, -2)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 6768, 6768, 6768, -2, -2, -2)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 6768, 6768, 6768, -2, -2, -2)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 6768, 6768, 6768, -2, -2, -2)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 6770, 6770, 6770, -2, -2, -2)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 6774, 6774, 6774, -2, -2, -2)
	light()
	instruct_25(35, 26, 26, 26)
	say("这里东西都是我的，是我的*，谁敢和我抢！", 138, 0)

	if WarMain(91, 0) == false then
		instruct_15()

		return
	end

	dark()
	null(-2, 2)
	null(-2, 3)
	null(-2, 13)
	null(-2, 12)
	null(-2, 11)
	null(-2, 10)
	null(-2, 9)
	null(-2, 8)
	null(-2, 7)
	null(-2, 6)
	null(-2, 5)
	null(-2, 4)
	light()
end
OEVENTLUA[1412] = function ()
	if JY.Person[0].盗贼技巧 >= 10 then
		say("咦，这个柜子是可以活动的~", 0, 590)
		null(87, 1)
		Cls()
	end
end
OEVENTLUA[1450] = function ()
	say("青桐姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(74)
	instruct_3(70, 28, 1, 0, 1451, 0, 0, 7004, 7004, 7004, -2, 33, 7)
end
OEVENTLUA[1451] = function ()
	say2("有需要我帮忙的地方吗？", 74, 0, "霍青桐")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(74)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 74, 0, "霍青桐")
		Cls()

		return
	end
end
OEVENTLUA[1452] = function ()
	say("陈舵主，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(75)
	instruct_3(70, 27, 1, 0, 1453, 0, 0, 7006, 7006, 7006, -2, 32, 7)
end
OEVENTLUA[1453] = function ()
	say2("有需要我帮忙的地方吗？", 75, 0, "陈家洛")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(75)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 75, 0, "陈家洛")
		Cls()

		return
	end
end
OEVENTLUA[1454] = function ()
	say("张统领，你先回大帅府，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(80)
	instruct_3(107, 2, 1, 0, 1455, 0, 0, 7034, 7034, 7034, -2, -2, -2)
end
OEVENTLUA[1455] = function ()
	say2("有需要我帮忙的地方吗？", 80, 0, "张召重")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(80)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 80, 0, "张召重")
		Cls()

		return
	end
end
OEVENTLUA[1456] = function ()
	say("小妹，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(590)
	instruct_3(70, 86, 1, 0, 1457, 0, 0, 9242, 9242, 9242, 0, 0, 0)
end
OEVENTLUA[1457] = function ()
	say("有需要我帮忙的地方吗？", 306, 0, "李文秀")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(590)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 306, 0, "李文秀")
		Cls()

		return
	end
end
