OEVENTLUA[8001] = function ()
	Cls()

	if has_thing(234) and JY.Person[0].门派 == 0 then
		say("拜见前辈。", 0, 1)
		say("哦？你是南贤的后辈，新一代的小村传人？", 5, 0)
		say("晚辈是小村人氏，这是南伯的信。", 0, 1)
		say("我看看，呵呵呵，要你投入武当门下，好，我就收你为武当三代弟子。", 5, 0)
		addthing(234, -1)

		JY.Person[0].门派 = 1
		JY.Person[0].门派等级 = 1

		if JY.Person[171].好感度 < 60 then
			JY.Person[171].好感度 = 60
		end

		JY.Person[82].好感度 = 60

		say("松溪，你来。", 5, 0)
		null(-2, 4)
		addevent(43, 5, 1, -2, 1, 9044, -2, -2)
		say("师父。", 262, 0, "张松溪")
		say("这是我新收的武当三代弟子，从今天起，他就入你门下。", 5, 0)
		say("是，师父。", 262, 0, "张松溪")
		say("拜见师父。", 0, 1)
		say("拜见师祖。", 0, 1)
		say("呵呵，入我武当，当记得行侠仗义，不可为恶。", 5, 0)
		say("是，师祖。", 0, 1)

		if JY.Person[0].生命最大值 < 300 then
			say("你的身体太弱了，松溪，先安排他锻洗一下筋骨吧。", 5, 0)
			say("是，师父。", 262, 0, "张松溪")
			say("徒儿，随我来。", 262, 0, "张松溪")
			dark()
			null(-2, 5)
			My_Enter_SubScene(43, 5, 49, 2)
			addevent(43, 46, 1, 0, 1, 9040, -2, -2)
			light()
			say("你的身子太虚，最近一段时间先泡一下药浴，慢慢把身体调养过来。", 262, 0, "张松溪")
			say("是。", 0, 1)
			dark()
			null(-2, 46)
			My_Enter_SubScene(43, 5, 49, 3)
			light()
			say("此后一个月，你每天进行药浴，感觉身体每天都在脱胎换骨，精神也越加旺盛", 0, 2)
			addtime(30)
			addevent(43, 46, 1, 0, 1, 9040, -2, -2)
			say("不错，可以了。", 262, 0, "张松溪")
			say("每月的5号左右是洗身锻体的日子，在你身体没有到极限以前，你要记得来这里接着药浴，不要错过了。", 262, 0, "张松溪")
			say("是，师父。", 0, 1)
			say("我武当与少林并列为当世一等一的大派，藏书阁武功秘籍众多，你多去翻越翻阅。", 262, 0, "张松溪")
			say("是，师父。", 0, 1)

			if JY.Person[0].生命增长 < 6 then
				JY.Person[0].生命增长 = JY.Person[0].生命增长 + 1
			end

			JY.Person[0].生命最大值 = JY.Person[0].生命最大值 + 50
			JY.Person[0].生命 = JY.Person[0].生命 + 50
			JY.Person[0].攻击力 = JY.Person[0].攻击力 + 20
			JY.Person[0].防御力 = JY.Person[0].防御力 + 20
			JY.Person[0].轻功 = JY.Person[0].轻功 + 20

			instruct_46(0, 10)
		end

		say("徒儿，来。", 262, 0, "张松溪")
		dark()
		null(-2, 5)
		null(-2, 46)
		My_Enter_SubScene(43, 19, 28, 2)
		addevent(43, 4, 1, 8002, 1, 9040, -2, -2)
		light()
		say("这是我武当的基础功夫，看好了。", 262, 0, "张松溪")
		Cls()
		QZXS(JY.Person[0].姓名 .. "学习了武当基础经义！")
		addthing(106)
		addthing(239)

		if PersonKF(0, 7) == false then
			local var_1_0 = JY.Person[0].主功体

			stop_ng(0)

			JY.Person[0].武功1 = 7
			JY.Person[0].武功等级1 = 50

			star_ng(0, var_1_0)
		end

		say("自己去多加练习。", 262, 0, "张松溪")
		say("是，师父。", 0, 1)

		return
	end

	if JY.Person[0].门派 == 1 then
		if JY.Person[0].拳掌功夫 == 99 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			dark()
			light()
			say("不错，不错。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(1, 1)

			JY.Person[0].拳掌功夫 = 100

			return
		elseif JY.Person[0].拳掌功夫 == 199 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			say("不错，不错。", 5, 0)
			dark()
			light()
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(1, 2)

			JY.Person[0].拳掌功夫 = 200

			return
		elseif JY.Person[0].拳掌功夫 == 299 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("不错，不错。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(1, 3)

			JY.Person[0].拳掌功夫 = 300

			return
		elseif JY.Person[0].御剑能力 == 99 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("不错，不错。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(2, 1)

			JY.Person[0].御剑能力 = 100

			return
		elseif JY.Person[0].御剑能力 == 199 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("不错，不错。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(2, 2)

			JY.Person[0].御剑能力 = 200

			return
		elseif JY.Person[0].御剑能力 == 299 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("不错，不错。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(2, 3)

			JY.Person[0].御剑能力 = 300

			return
		elseif JY.Person[0].特殊兵器 == 99 then
			say("请师祖指点。", 0, 1)
			say("好，小徒孙，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("不错，不错。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(4, 1)

			JY.Person[0].特殊兵器 = 100

			return
		elseif JY.Person[0].拳掌功夫 >= 190 and JY.Person[0].拳掌功夫 < 200 and PersonKFJ(0, 123) then
			say("小徒孙，来，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("嗯，你这根基打得不错，不过还有可以改进的地方。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			PersonKFS(0, 123, 50)

			return
		elseif JY.Person[0].拳掌功夫 >= 90 and JY.Person[0].拳掌功夫 < 100 and PersonKFJ(0, 123) then
			say("小徒孙，来，让我看看你最近功夫可有进步。", 5, 0)
			say("好。", 0, 1)
			dark()
			light()
			say("嗯，你这根基打得不错，不过还有可以改进的地方。", 5, 0)
			say("多谢祖师指点。", 0, 1)
			PersonKFS(0, 123, 50)

			return
		end

		if JY.Person[0].门派等级 == 2 and JY.Person[0].声望 >= 50 and JY.Person[0].品德 >= 80 and has_thing(97) == false then
			say("小徒孙，你武功练得怎么样了，来，陪祖师练练。", 5, 0)

			if WarMain(22, 0) == true then
				say("想不到你已经到了如今的境界。", 5, 0)
				instruct_0()

				return
			end

			if PersonKF(0, 16) == false then
				say("这是什么武功？这么厉害。", 0, 1)
				say("这是太极，你看，这样，这样，明白了吗？", 5, 0)
				QZXS(JY.Person[0].姓名 .. "学习了武当高级奥义！")
				addthing(97)

				local var_1_1 = JY.Person[0].主功体

				stop_ng(0)

				JY.Person[0].武功1 = 16
				JY.Person[0].武功等级1 = 50

				star_ng(0, var_1_1)
			else
				say("你已经开始接触太极奥义了啊，努力吧，年轻人。", 5, 0)
			end
		elseif JY.Person[0].门派等级 == 3 and JY.Person[0].声望 >= 80 and JY.Person[0].品德 >= 85 and has_thing(115) == false then
			say("小徒孙，你武功练得怎么样了，来，陪祖师练练。", 5, 0)

			if WarMain(22, 0) == true then
				say("想不到你已经到了如今的境界。", 5, 0)
				instruct_0()

				return
			end

			if PersonKF(0, 46) == false then
				say("这是什么武功？这么厉害。", 0, 1)
				say("这是太极，你看，这样，这样，明白了吗？", 5, 0)
				QZXS(JY.Person[0].姓名 .. "学习了武当高级奥义！")
				addthing(115)

				local var_1_2 = JY.Person[0].主功体

				stop_ng(0)

				JY.Person[0].武功2 = 46
				JY.Person[0].武功等级2 = 50

				star_ng(0, var_1_2)
			else
				say("不错，不错。年轻人有前途。", 5, 0)
			end
		elseif JY.Person[0].门派等级 == 4 and JY.Person[0].品德 >= 90 and has_thing(310) == false then
			say("我最近对太极原理又有了领悟，你要不要看看？", 5, 0)
			say("请祖师指导。", 0, 1)
			say("好，你看好了。", 5, 0)
			dark()
			light()
			say("太极者，天地之数也，数由一始，亦从一终，天地之止息幻化，无端无极，终归于太一。", 5, 0)
			dark()
			light()
			say("太极者，道也；两仪者，阴阳也。阴阳一道也，太极无极也。气发则为窍，而气发至本原处，则为生死窍，化无极之真，二五之精，生生而化，妙合而凝，真气游走全身，生死窍亦随之转移。乃参大衍之数五十，其用四十有九，虚其一，变化始生之道也。", 5, 0)
			dark()
			light()
			say("怎么样？领悟了吗？", 5, 0)
			addthing(310)
			say("多谢祖师。", 0, 1)
		else
			say("武功不在于死练，要多多领悟。", 5, 0)
		end
	elseif inteam(9) then
		say("无忌，这些年真是苦了你了。", 5, 0)
		say("太师父，我没事的。", 9, 1)
	else
		say(JY.Person[0].称呼 .. "，我武当风林奇秀，不妨多盘留几日。", 5, 0)
	end
end
OEVENTLUA[8002] = function ()
	Cls()

	if JY.Person[0].门派 == 0 then
		if JY.Person[0].品德 >= 80 then
			Cls()
			say("不错，不错。小兄弟人品正直，根骨俱佳，不知可肯加入我武当派啊。", 262, 0, "张松溪")

			if DrawStrBoxYesNo(-1, -1, "要拜师吗？", C_WHITE, 30) == true then
				say("小子何德何能，能够入前辈法眼。", 0, 1)
				Cls()
				say("哈哈，你不用激我。这样吧，我今日收你为武当弟子，希望你勤勉努力，匡扶武林正道。", 262, 0, "张松溪")
				Cls()
				say("是！拜见师父！", 0, 1)
				say("好好好。这是我武当基础功法，你拿去好好练习。", 262, 0, "张松溪")
				say("是。", 0, 1)

				JY.Person[0].门派 = 1
				JY.Person[0].门派等级 = 1

				if JY.Person[171].好感度 < 60 then
					JY.Person[171].好感度 = 60
				end

				JY.Person[82].好感度 = 60

				Cls()
				QZXS(JY.Person[0].姓名 .. "学习了武当基础经义！")
				addthing(106)
				addthing(239)

				if PersonKF(0, 7) == false then
					local var_2_0 = JY.Person[0].主功体

					stop_ng(0)

					JY.Person[0].武功1 = 7
					JY.Person[0].武功等级1 = 50

					star_ng(0, var_2_0)
				end
			end
		elseif inteam(9) then
			say("拜见张师叔。", 9, 0)
			say("原来是无忌啊，这些年都没见到你，不想你都长这么大了。", 262, 1, "张松溪 ")
		else
			say("我武当乃是武林大派，向以侠义为先。", 262, 0, "张松溪 ")
		end
	elseif JY.Person[0].门派 == 1 then
		if JY.Person[0].拳掌功夫 == 99 then
			say("请师父指点。", 0, 1)
			say("好，让我看看你如今修炼得如何了？", 262, 0, "张松溪")
			say("是，师父。", 0, 1)
			dark()
			light()
			say("很好很好。", 262, 0, "张松溪")
			say("谢师父指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(1, 1)

			JY.Person[0].拳掌功夫 = 100

			return
		elseif JY.Person[0].拳掌功夫 == 199 then
			say("请师父指点。", 0, 1)
			say("好，让我看看你如今修炼得如何了？", 262, 0, "张松溪")
			say("是，师父。", 0, 1)
			dark()
			light()
			say("很好很好。", 262, 0, "张松溪")
			say("谢师父指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(1, 2)

			JY.Person[0].拳掌功夫 = 200

			return
		elseif JY.Person[0].御剑能力 == 99 then
			say("请师父指点。", 0, 1)
			say("好，让我看看你如今修炼得如何了？", 262, 0, "张松溪")
			say("是，师父。", 0, 1)
			dark()
			light()
			say("很好很好。", 262, 0, "张松溪")
			say("谢师父指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(2, 1)

			JY.Person[0].御剑能力 = 100

			return
		elseif JY.Person[0].御剑能力 == 199 then
			say("请师父指点。", 0, 1)
			say("好，让我看看你如今修炼得如何了？", 262, 0, "张松溪")
			say("是，师父。", 0, 1)
			dark()
			light()
			say("很好很好。", 262, 0, "张松溪")
			say("谢师父指点。", 0, 1)
			QZXS(JY.Person[0].姓名 .. "困扰你多时的瓶颈突破了！")
			write_nump(2, 2)

			JY.Person[0].御剑能力 = 200

			return
		end

		if JY.Person[0].门派等级 == 1 and (JY.Person[0].声望 >= 10 and JY.Person[0].品德 >= 80 or JY.Person[0].门派贡献 >= 20) then
			Cls()
			say("让我看看你如今修炼得如何了？", 262, 0, "张松溪")
			say("是，师父。", 0, 1)

			if PersonKFJ(0, 7) then
				say("徒儿略有所得。", 0, 1)
				dark()
				light()
				say("好，好，很有进步。", 262, 0, "张松溪")
				say("这都是师父指点有方。", 0, 1)
				say("从今天起，你可以学习进阶武学了。", 262, 0, "张松溪")
				say("是，师父。", 0, 1)
				say("你和师兄们多交流交流，将这些武功学得差不多，就可以出外历练历练了。", 262, 0, "张松溪")
				say("徒儿，江湖上每一个有名姓的人都是不简单的，遇见这些人你要小心在意。记得侠义为先，扬我武当声威。", 262, 0, "张松溪")
				say("是，师父。", 0, 1)

				JY.Person[0].门派等级 = 2

				QZXS(JY.Person[0].姓名 .. "对武当派武学领悟加深！")
				addthing(125)
				addthing(76)

				if PersonKF(0, 36) == false then
					local var_2_1 = JY.Person[0].主功体

					stop_ng(0)

					JY.Person[0].武功2 = 36
					JY.Person[0].武功等级2 = 50

					star_ng(0, var_2_1)
				end
			else
				say("绵掌乃是武当基础功法，要修炼到极致才能为将来打好根基。", 262, 0, "张松溪")
				say("徒儿惭愧！", 0, 1)
			end
		elseif JY.Person[0].门派等级 == 2 and JY.Person[0].声望 >= 50 and JY.Person[0].品德 >= 80 then
			Cls()
			say("让我看看你如今修炼得如何了？", 262, 0, "张松溪")
			say("是，师父。", 0, 1)

			if PersonKFJ(0, 36) then
				say("徒儿略有所得。", 0, 1)
				say("好，好，很有进步。", 262, 0, "张松溪")
				say("这都是师父指点有方。", 0, 1)
				say("从今天起，你可以学习高阶武学了。", 262, 0, "张松溪")
				say("是，师父。", 0, 1)

				JY.Person[0].门派等级 = 3

				QZXS(JY.Person[0].姓名 .. "对武当派武学领悟加深！")

				if has_thing(97) == false then
					addthing(97)
					addthing(249)

					if PersonKF(0, 16) == false then
						local var_2_2 = JY.Person[0].主功体

						stop_ng(0)

						JY.Person[0].武功1 = 16
						JY.Person[0].武功等级1 = 50

						star_ng(0, var_2_2)
					end
				end
			else
				say("绕指柔剑乃是武当进阶剑法，好好修炼，不要让为师失望。", 262, 0, "张松溪")
				say("徒儿惭愧！", 0, 1)
			end
		elseif JY.Person[0].门派等级 == 3 and JY.Person[0].声望 >= 100 and JY.Person[0].品德 >= 85 then
			if has_thing(115) or PersonKF(0, 46) then
				say("好徒儿，你没有让我失望，我已经没有什么可以教你的了。", 262, 0, "张松溪")
				say("江湖广大，徒儿，以你的天资，必将大有作为。", 262, 0, "张松溪")

				return
			end

			say("好徒儿，你没有让我失望。", 262, 0, "张松溪")
			say("武学上我已经没有什么可以教你的了，这是我武当的太极剑法，你自己领悟去吧。", 262, 0, "张松溪")
			say("是，师父。", 0, 1)
			addthing(115)
		else
			if Rnd(3) == 1 then
				if JY.Person[0].拳掌功夫 < 100 then
					say("师父！", 0, 1)
					say("武学讲究循序渐进，是一个慢慢改善身体，进阶技巧的过程，今日给你讲讲拳法。", 262, 0, "张松溪 ")
					say("是。", 0, 1)
					dark()
					light()
					addtime(30)

					JY.Person[0].拳掌功夫 = JY.Person[0].拳掌功夫 + 1

					say("好了，这次就到这里，自己多去练习。", 262, 0, "张松溪 ")
					say("是，师父！", 0, 1)
				else
					say("我武当乃是武林大派，最重品行，你以后行走江湖切记侠义为先。", 262, 0, "张松溪 ")
					say("是，师父。", 0, 1)
				end
			elseif JY.Person[0].御剑能力 < 100 then
				say("师父！", 0, 1)
				say("武学讲究循序渐进，是一个慢慢改善身体，进阶技巧的过程，今日给你讲讲剑法。", 262, 0, "张松溪 ")
				say("是。", 0, 1)
				dark()
				light()
				addtime(30)

				JY.Person[0].御剑能力 = JY.Person[0].御剑能力 + 1

				say("好了，这次就到这里，自己多去练习。", 262, 0, "张松溪 ")
				say("是，师父！", 0, 1)
			else
				say("你武功练得差不多了就做做门派任务，武当还需要你们来发扬光大。", 262, 0, "张松溪 ")
				say("是，师父。", 0, 1)
			end

			if JY.Person[82].好感度 == 60 and PersonKFD(0, 7, 900) then
				addevent(43, 7, 1, 8003, 1, 7276, -2, -2)

				JY.Person[82].佛学修为 = 1
			end
		end
	elseif inteam(9) then
		say("拜见张师叔。", 9, 0)
		say("原来是无忌啊，这些年都没见到你，不想你都长这么大了。", 262, 1, "张松溪 ")
	else
		say("我武当乃是武林大派，向以侠义为先。", 262, 0, "张松溪 ")
	end
end
OEVENTLUA[8003] = function ()
	Cls()

	local var_3_0 = 0
	local var_3_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	say("大师兄好！", 0, 1)
	say(var_3_1 .. "，你来了。", 82, 0)
	say("大师兄近日要去洛阳，你一块跟着去玩玩吧。", 82, 0)
	say("好啊，我去和师父说一声。", 0, 1)
	say("不用，我已经和师叔打过招呼了，咱们今日就下山。", 82, 0)
	say("咱们这次要去洛阳收租金，本该上月就收上来的，结果到现在还没有消息。", 82, 0)
	say("收租金？", 0, 1)
	say("咱们武当山这么大的家业，自然是有数种收入来源，其中主要的就是收租金，武当山周边有咱们很多产业，咱们都盘出去让别人经营，咱们每年收的就是租金。", 82, 0)
	say("另外还有保护费，湖北这块地界这么安稳，就是因为有咱们武当山在，周围的强盗马匪都不敢过来。", 82, 0)
	say("作为感谢，周边的商家，富豪每年给武当山的送一些感谢费。", 82, 0)
	say("原来还有这么多门道。", 0, 1)
	say("那是自然，师父师伯们不管这些闲事，咱们这些小辈就得多操操心。", 82, 0)
	say("是，大师兄。", 0, 1)
	say("好了，咱们走吧，先去洛阳。", 82, 0)
	say("是，请大师兄多多指点。", 0, 1)
	say(var_3_1 .. "，你很懂事，路上多听大师兄的就对了。", 82, 0)
	DrawStrBox(-1, -1, "获得门派任务，和大师兄去洛阳收租", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	DrawStrBox(-1, -1, "大师兄随队行动", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	dark()
	null(-2, 7)
	addevent(40, 28, 1, 8004, 1, 9010, -2, -2)
	light()

	JY.Person[82].好感度 = 61
end
OEVENTLUA[8004] = function ()
	Cls()

	local var_4_0 = 0
	local var_4_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	dark()
	addevent(40, 30, 1, -2, 1, 5392, -2, -2)
	light()
	say("黄老板，我们又见面了。", 82, 0)
	say("哎呦，宋兄弟，什么风将你吹来了？", 1006, 1, "黄老板")
	say("黄老板，很久没见，兄弟想你啊。", 82, 0)
	say("宋兄弟，来得正好，我正准备去尊龙会所吃个饭，一块去如何？", 1006, 1, "黄老板")
	say("甚好甚好，如此叨扰黄老板了。", 82, 0)
	say("你我兄弟何必见外，这位？", 1006, 1, "黄老板")
	say("这是我" .. var_4_1 .. "，他年纪还小，却是不适合去这等地方。", 82, 0)
	say("师弟，洛阳的事我办就行，还有荆州的事你去办一办，完事了来洛阳和我汇合。", 82, 0)
	say("啊，师兄，这？", 0, 1)
	say("怎么？师兄的话都不听了？你去荆州找一位叫沙老六的人，他自然会给你办事情的，放心，很简单的。", 82, 0)
	say("是，师兄。", 0, 1)
	say("黄老板，我们走吧。", 82, 0)
	say("宋兄弟，请。", 1006, 1, "黄老板")
	dark()
	null(-2, 28)
	null(-2, 30)
	addevent(40, 25, 1, -2, 1, 9010, -2, -2)
	addevent(40, 122, 1, 8020, 1, 7274, -2, -2)
	addevent(40, 69, 0, 8005, 3, -2, -2, -2)
	light()
	null(119, 58)
	addevent(119, 16, 0, 8007, 3, -2, -2, -2)
	addevent(119, 17, 0, 8007, 3, -2, -2, -2)
	addevent(119, 18, 0, 8008, 3, -2, -2, -2)
	addevent(119, 19, 1, -2, 1, 5416, -2, -2)
	addevent(119, 20, 1, -2, 1, 6782, -2, -2)
end
OEVENTLUA[8005] = function ()
	Cls()
	dark()
	light()
	say("咦，里面似乎是宋师兄？", 0, 1)
	say("大师兄~", 0, 1)
	say("大师兄~，是我啊~", 0, 1)
	dark()
	light()
	say("啊~，有人在偷窥，外面有偷窥狂在偷窥~", 353, 0)
	dark()
	My_Enter_SubScene(40, 32, 55, 0)
	addevent(40, 68, 1, 8006, 1, 10460, -2, -2)
	addevent(40, 66, 1, 8006, 1, 10318, -2, -2)
	addevent(40, 67, 1, 8006, 1, 10292, -2, -2)
	addevent(40, 64, 1, 8006, 1, 10264, -2, -2)
	light()
	say("我不是~，我不是偷窥狂~，你们不要误会。", 0, 1)
	say("看你长得清清秀秀的，没想到也会做这种事。", 1118, 0)
	say("这是哪家的弟子？看装束像是武当派的？不会吧？武当派也会出这样的弟子？丢人啊！", 1135, 0)
	say("真是人不可貌相啊，胆子真大啊！", 1117, 0)
	say("我真不是偷窥狂~，你们误会了。", 0, 1)
	say("丢人啊！", 1118, 0)
	say("丢人！", 1099, 0)
	say("......", 0, 1)

	JY.Person[82].好感度 = 49
end
OEVENTLUA[8006] = function ()
	Cls()
	say("现在人真是不可貌相啊，看你长得清清秀秀的，没想到也会做这种事。", 1118, 0)
	say("你是哪家的弟子？看装束像是武当派的？你是武当派的吗？丢人啊！", 1135, 0)
	say("真是人不可貌相啊，胆子真大啊！", 1117, 0)
	say("丢人啊！", 1099, 0)
end
OEVENTLUA[8007] = function ()
	Cls()
	dark()
	light()
	say("奇怪，这家商铺开着大门，怎么老板不在呢？", 0, 1)
	null(-2, 16)
	null(-2, 17)
end
OEVENTLUA[8008] = function ()
	Cls()
	dark()
	light()
	say("老板在吗？", 0, 1)
	say("咦，你们是什么人？老板呢？", 0, 1)
	say("可恶，是武当山的人来了。", 1127, 0, "黄河帮帮众")
	say("就一个人？怕他怎的。", 1104, 0, "黄河帮帮众")

	if WarMain(104, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	null(-2, 19)
	null(-2, 20)
	addevent(119, 19, 1, -2, 1, 5968, -2, -2)
	My_Enter_SubScene(119, 4, 31, 0)
	light()
	say("多谢少侠相救，你可来了。", 1019, 0, "沙老六")
	say("你认识我？", 0, 1)
	say("我是沙老六，幸亏你来得及时，否则今年给武当山的进贡就得给黄河帮的人给抢了。", 1019, 0, "沙老六")
	say("这是怎么回事？", 0, 1)
	say("上个月我收集了进贡，正安排人押送，不想黄河帮的人一直暗中派人阻挠，镖行不能出行。", 1019, 0, "沙老六")
	say("然后今天他们就打上门来，要行强抢之事，幸亏少侠你及时赶到。", 1019, 0, "沙老六")
	say("黄河帮？这样的小帮派居然抢我武当山的东西？", 0, 1)
	say("据说黄河帮现在投靠了崆峒派，急于立功，刚好赶上我们资金汇拢，我估计他们是想完事连我也干掉，让你们也找不到线索。", 1019, 0, "沙老六")
	say("可恶！黄河帮的驻地在什么地方？", 0, 1)
	say("这个，＜沙老六小心的看了你一眼＞，黄河帮主行踪不定，依小老儿看不如先行报上武当山，请他们多派人手，黄河帮那就是覆手可灭。", 1019, 0, "沙老六")
	say("说的也有道理，我这就回山禀报，你先找个地方躲起来。", 0, 1)
	say("是，少侠。", 1019, 0, "沙老六")
	dark()
	null(-2, 19)
	addevent(43, 4, 1, 8009, 1, 9040, -2, -2)
	addevent(43, 9, 1, 8010, 1, 6110, -2, -2)
	null(40, 122)
	null(40, 69)
	null(40, 68)
	null(40, 66)
	null(40, 67)
	null(40, 64)
	light()
	null(-2, 18)
end
OEVENTLUA[8009] = function ()
	Cls()
	say("师父！", 0, 1)
	say("徒儿，不经师父允许，你怎么私自下山，可是碰到什么麻烦了？", 262, 0, "张松溪")
	say("师父，我......，是这样******", 0, 1)
	say("这崆峒派好大的胆子？", 262, 0, "张松溪")
	say("这件事你就不要管了，过几天就是门内较技，你先安心练武，争取有个好成绩。", 262, 0, "张松溪")
	say("是，师父！", 0, 1)
	say("青书，今年年轻弟子的比试就由你来主持。", 262, 0, "张松溪")
	say("是，师叔。", 82, 0)
	dark()
	null(-2, 9)
	addevent(43, 59, 1, 8011, 1, 7274, -2, -2)
	addevent(43, 4, 1, 8002, 1, 9040, -2, -2)
	light()
end
OEVENTLUA[8010] = function ()
	Cls()

	local var_10_0 = 0
	local var_10_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	say(var_10_1 .. "，你怎么才回来。", 82, 0)
end
OEVENTLUA[8011] = function ()
	Cls()

	local var_11_0 = 0
	local var_11_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	dark()
	light()
	say(var_11_1 .. "，今年的比试要开始了，紧张吗？准备好了咱们就开始吧。", 82, 0)
	dark()
	null(-2, 61)
	addevent(43, 59, 1, 8013, 1, -2, -2, -2)
	addevent(43, 20, 1, 8012, 1, 5390, -2, -2)
	addevent(43, 23, 1, 8012, 1, 5390, -2, -2)
	addevent(43, 63, 1, 8012, 1, 5390, -2, -2)
	addevent(43, 24, 1, 8012, 1, 5392, -2, -2)
	addevent(43, 25, 1, 8012, 1, 5392, -2, -2)
	addevent(43, 18, 1, 8012, 1, 5392, -2, -2)
	light()
end
OEVENTLUA[8012] = function ()
	Cls()
	say("小师弟，比武要开始了，听大师兄号令。", 190, 0, "武当弟子")
end
OEVENTLUA[8013] = function ()
	Cls()

	local var_13_0 = 0
	local var_13_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	say("各位师弟，今年的比武由我主持，规矩和往年一样，先是同门较技，最后是高级弟子考核，只要能在我手里走上100招的，就能升级高级弟子。", 82, 0)
	say("是，大师兄。", 190, 0, "武当弟子")
	say("好了，同门较技现在开始。", 82, 0)
	dark()
	light()
	say("很好，现在是第二场。", 82, 0)
	dark()
	light()
	say("很好，现在是第......场。", 82, 0)
	dark()
	light()
	say("好了，安静，现在开始高级弟子考核，按照惯例，由我抽取弟子上场先做演示。", 82, 0)
	say("大师兄神威。", 1075, 0, "武当弟子")
	say("大师兄无敌。", 190, 0, "武当弟子")
	say(var_13_1 .. "，你来。", 82, 0)
	say("我？", 0, 1)
	say("上来，" .. var_13_1 .. "，我会手下留情的。", 82, 0)

	if WarMain(295, 0) == false then
		JY.Person[0].经验 = JY.Person[0].经验 + 5

		say("小师弟，你要更努力啊。", 82, 0)
		say("好了好了，今年的比试较技结束了，大家伙各忙各的去吧。", 82, 0)
		null(-2, 20)
		null(-2, 23)
		null(-2, 63)
		null(-2, 24)
		null(-2, 25)
		null(-2, 18)
		null(-2, 59)
		instruct_0()

		return
	end

	say("哼。", 82, 0)
	dark()
	null(-2, 59)
	light()
	say("？，大师兄输了？", 1075, 0, "武当弟子")
	say("嘘，别说了，大师兄生气了，散了吧，都散了吧，该干啥干啥去。", 190, 0, "武当弟子")

	JY.Person[82].好感度 = 20

	dark()
	null(-2, 20)
	null(-2, 23)
	null(-2, 63)
	null(-2, 24)
	null(-2, 25)
	null(-2, 18)
	null(-2, 36)

	JY.Person[5].好感度 = 51

	null(-2, 28)
	addevent(43, 41, 1, 8014, 1, 5390, -2, -2)
	addevent(43, 42, 1, 8014, 1, 5394, -2, -2)
	light()
	say("......", 0, 1)

	if JY.Person[0].门派等级 == 1 then
		JY.Person[0].门派等级 = 2
	end
end
OEVENTLUA[8014] = function ()
	Cls()

	local var_14_0 = 0
	local var_14_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	say("最近祖师出门会友去了，师叔反而越来越严厉了，苦啊。", 179, 0, "武当弟子")
	say("我听说是有了六师叔的消息，祖师多年没有下山，今次下山会友，顺带看看六师叔的情况。", 190, 0, "武当弟子")
	say("大师兄也下山了吗？最近没有见到啊？难道和祖师一道下山了？", 179, 0, "武当弟子")
	say("说知道呢，也有可能是上次败在" .. var_14_1 .. "手里，心里还在难过吧。", 190, 0, "武当弟子")
	say("是不是啊？" .. var_14_1 .. "？", 190, 0, "武当弟子")
	addevent(33, 20, 0, 8015, 3, -2, -2, -2)
	addevent(33, 21, 1, -2, 1, 7274, -2, -2)
	addevent(33, 22, 1, -2, 1, 9148, -2, -2)
end
OEVENTLUA[8015] = function ()
	Cls()

	local var_15_0 = 0
	local var_15_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	dark()
	null(43, 41)
	null(43, 42)
	light()
	say("青书，你做的好事。", 172, 0, "莫声谷")
	say("师叔，我没有。", 82, 1)
	say("哼，我武当第三代的大师兄，居然到峨眉偷看女弟子洗澡，待我说与你父亲知道，看他怎么惩戒与你。", 172, 0, "莫声谷")
	say("师叔，我父亲素来严厉，他会打死我的。", 82, 1)
	say("敢做不敢当么？真是我武当的好弟子。", 172, 0, "莫声谷")
	say("哎，你来了？" .. var_15_1 .. "。", 82, 1)
	say("嗯？", 172, 0, "莫声谷")
	say("着。", 82, 1)
	say("哎呦！青书，你居然......你居然敢", 172, 0, "莫声谷")
	say(var_15_1 .. "，帮我。我有很多金银在洛阳钱庄，回头我就取来给你。", 82, 1)
	say("我？", 0, 0)
	say("5000两，不，10000两白银，小师弟，你帮我一次，这银子够你花用不尽的了。", 82, 1)

	if yesno("要帮宋青书吗？") then
		if WarMain(225, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		else
			say(var_15_1 .. "，这次你帮了我大忙了，以后有我吃的就有你喝的，我绝不亏待你。", 82, 0)
			say("呵呵，好说，那刚才说给我的银子？", 0, 1)
			say("哎，" .. var_15_1 .. "，刚才是在是事情紧急，我夸口了，实在是没有那么多银子。", 82, 0)
			say("哦？那我去问问太师父和你父亲，看看他们银子多不多？", 0, 1)
			say("别别，给，这是2000两，" .. var_15_1 .. "，这是我所有的财产了。", 82, 0)
			addthing(174, 2000)
			say("剩下的我先欠着，" .. var_15_1 .. "，我先将这儿处理一下，先告辞了。", 82, 0)
			dark()
			null(-2, 21)
			null(-2, 22)
			light()
			say("哈哈哈。", 0, 1)
		end
	else
		say("宋青书，你好大的胆子。", 0, 1)
		say("六师叔，我来帮你。", 0, 1)
		say("师叔，饶命啊。" .. var_15_1 .. "，你救救我。", 82, 0)
		say("见过六师叔，师叔，你的伤不碍事吧？", 0, 1)
		say("无妨，你就是松溪新收的弟子？很好，人品武功都有可取之处。", 172, 0, "莫声谷")

		if JY.Person[0].门派等级 == 2 then
			say("我会禀明师父和师兄，保举你做高级弟子，你可愿意？", 172, 0, "莫声谷")

			JY.Person[0].门派等级 = 3
		else
			say("我会禀明师父和师兄你的功劳，你很不错，很不错。", 172, 0, "莫声谷")
		end

		say("多谢师叔。", 0, 1)
		say("这是我意外所得的剑谱，今日就送与你。", 172, 0, "莫声谷")
		say("多谢师叔。", 0, 1)
		addthing(280)
		say("青书，跟我们走吧。", 172, 0, "莫声谷")

		JY.Person[172].好感度 = 80
		JY.Person[82].好感度 = 0
		JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 10

		dark()
		null(-2, 21)
		null(-2, 22)
		light()
	end

	null(33, 20)
	addevent(43, 36, 1, 8001, 1, 8966, -2, -2)

	JY.Person[5].好感度 = 50
end
OEVENTLUA[8020] = function ()
	Cls()

	local var_16_0 = 0
	local var_16_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	say("大师兄。", 0, 1)
	say(var_16_1 .. "，你怎么在这里？", 82, 0)
	say("这儿好高级啊。", 0, 1)
	say("你还不去荆州，不要误了大事。", 82, 0)
	say("我一会就去。师兄，回去我的和师兄们说说，这里面好高级啊。", 0, 1)
	say(var_16_1 .. "，回去可不要说这里的事。师叔师伯们知道会关你禁闭的，知道了吗？", 82, 0)
	say("知道了知道了，大师兄，我能在这儿再玩一会儿吗？", 0, 1)
	say("去吧去吧，不要来打扰我。", 82, 0)
	null(-2, 64)
	null(-2, 66)
	null(-2, 67)
	null(-2, 68)
end
OEVENTLUA[8030] = function ()
	Cls()

	if JY.Person[0].门派 == 1 then
		if has_thing(2) then
			say("师伯好，我这有一味黑玉断续膏，据说对筋骨接续有奇效，你看看对你有没有用？", 0, 1)
			say("我看看。", 1131, 0, "俞岱岩")
			dark()
			addevent(40, 11, 0, 0, 0, 6116)
			light()
			say("真的有用，真的有用。我站起来了。", 1131, 0, "俞岱岩")
			say("多谢师侄，你帮了我大忙了。", 1131, 0, "俞岱岩")
			say("师伯不用客气。", 0, 1)
			say("太好了，恭喜师叔，我去告诉其他师叔师伯去。", 1075, 0, "武当弟子")
			null(43, 34)
			say("哈哈哈，我站起来了。", 1131, 0, "俞岱岩")
			say("师伯，你去哪里？", 0, 1)
			say("我去办点早想做的事。", 1131, 0, "俞岱岩")
			null(43, 11)

			JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 10

			addevent(34, 57, 0, 8031, 3, -2)
			addevent(34, 17, 1, 8031, 1, 6112)
			addevent(34, 21, 1, 8031, 1, 5366)
			addevent(34, 22, 1, 8031, 1, 5366)
			addevent(34, 23, 1, 8031, 1, 5366)
			addevent(34, 58, 1, 8031, 1, 5404)
			addevent(34, 59, 1, 8031, 1, 5404)
			addevent(34, 60, 1, 8031, 1, 5404)
		else
			say("哎，今年的收入又减了，如今缺额足有万两，弟子们的饮食中的人参首乌分量又得减少了，我真是武当的罪人。", 1131, 0, "俞岱岩")
			say("师叔，这也是没有办法的事情。", 1075, 0, "武当弟子")
			say("查过是什么人在捣乱吗？", 1131, 0, "俞岱岩")
			say("查到了，是崆峒派。不过他们不直接出手，都是指使其他小帮派去咱们的产业 捣乱，咱们也不好直接找他们算账。", 1075, 0, "武当弟子")
			say("师伯好。", 0, 1)
			say("唔，好。", 1131, 0, "俞岱岩")
		end
	else
		say(JY.Person[0].称呼 .. "，我武当风林奇秀，不妨多盘留几日。", 1131, 0, "俞岱岩")
	end
end
OEVENTLUA[8031] = function ()
	Cls()
	dark()
	light()
	say("俞大侠好身手，据说你卧床十几年，没想到武功还是这么厉害。不过你以为凭你就能让我崆峒低头么？", 8, 0, "唐文亮")
	say("嘿嘿嘿，崆峒派果然是依多为胜的高手。既然如此，我就回去多叫几个师兄师弟过来，不知道你们能挡得住几个。", 1131, 1, "俞岱岩")
	say("既然如此，你今天就别想走了。", 167, 0, "宗維俠")
	say("凭你们几个也想留下我？妄想。", 1131, 1, "俞岱岩")
	say("那就再来几个，我崆峒派上千弟子，难道今日还能叫你走脱了？那就真是笑话了。", 168, 0, "常敬之")
	say("师伯？", 0, 1)
	instruct_30(45, 28, 37, 28)
	say("你怎么来了，快走！回去告诉师父，叫他多派一些人到崆峒来！", 1131, 0, "俞岱岩")
	say("想走？晚了~", 8, 1, "唐文亮")

	if WarMain(360, 0) == false then
		instruct_15()
		Cls()

		return
	end

	say("武当派什么时候又出这样一个年轻的高手了？可恶~", 8, 0, "唐文亮")
	say("快去叫后山的长老们都过来，今日不能叫他们跑掉了。", 168, 1, "常敬之")
	say("崆峒派，你们等着被我们武当灭门吧！", 1131, 0, "俞岱岩")
	say("走！", 1131, 0, "俞岱岩")
	null(34, 17)
	DrawStrBoxWaitKey("...3天后...", C_ORANGE, CC.DefaultFont, 2)
	addtime(3)
	addevent(43, 18, 0, 0, 0, 5392)
	My_Enter_SubScene(43, 40, 28, 3)
	say("我先去找你师祖，你这次做的很好，我会和师父禀告的。", 1131, 0, "俞岱岩")

	JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 10

	dark()
	null(43, 64)
	null(43, 18)
	addevent(43, 28, 1, 8032, 1, 5392)
	addevent(43, 69, 1, 8032, 1, 5392)
	null(34, 57)
	null(34, 21)
	null(34, 22)
	null(34, 23)
	null(34, 58)
	null(34, 59)
	null(34, 60)
	light()
end
OEVENTLUA[8032] = function ()
	Cls()
	dark()
	light()
	say("师父，崆峒派一直针对我们武当派做些小动作，这次居然胆敢向我下手，我看他们是想自取灭亡。", 1131, 0, "俞岱岩")
	say("你是想咱们这就过去，灭了崆峒派？", 5, 1)
	say("有何不可，武林讲究弱肉强食，他们敢挑衅咱们武当，自然要承担后果。", 1131, 0, "俞岱岩")
	say("唔，远桥，你怎么看？", 5, 1)
	say("崆峒实力远不及咱们，他们敢这么做，只怕非是无因...", 171, 0)
	say("现在咱们武当和少林并为江湖最强大的门派，只怕崆峒这样做也有少林的一部分原因。咱们真要去灭了崆峒，也会如了他们的愿。", 171, 0)
	say("退一步说，就算咱们真去灭了崆峒。", 171, 0)
	say("那之后，只怕武林人人自危，咱们就会成为武林公敌了。", 171, 0)
	say("那怎么办？这口气我可忍不下。", 1131, 1, "俞岱岩")
	say("师父。", 171, 0)
	say("怎么？你是要我出手？", 5, 1)
	say("正是，只有师父出手，才能震慑崆峒派的宵小，同时叫其他武林各派不敢妄动。", 171, 0)
	say("也好，好久没动过手，恐怕他们都以为我不能动了。咱们什么时候出发？", 5, 1)
	say("不急，我们先放出消息，让武林各派都知道咱们要教训崆峒派，我们就是要光明正大的打崆峒派的脸，让他们100年都再爬不起来。", 171, 0)
	say("小徒孙，你在这儿干什么呢？", 5, 1)
	say("啊，我？我到处转转，就是到处转转。", 0, 0)

	if JY.Person[0].门派等级 == 3 then
		say("呵呵呵，你这次做的很好。你俞师伯说你武功高强，人又侠义，提议升你做武当派的长老，你可敢坐这个位置啊？", 5, 0)

		if yesno("要接受吗？") then
			say("有什么不敢的？我也闯荡江湖很久了，胆子早练出来了。", 0, 1)
			say("哈哈哈，好，很好，咱们武当后继有人啊。", 5, 0)
			say("从今天起你就是咱们武当唯一的三代弟子的长老了，记得多在外面扬我武当声威。", 5, 0)
			say("师祖你放心吧。", 0, 1)

			JY.Person[0].门派等级 = 4
		else
			say("我？我这么年轻就做长老，是不是不太好啊？", 0, 1)
			say("没事，不想做长老也没事，那就奖励你其他东西吧。我这有颗天王保命丸，就给你了，关键时候能够保你一命。", 5, 0)
			say("多谢师祖。", 0, 1)
			addthing(8, 1)
		end
	else
		say("呵呵呵，你这次做的很好。你要什么奖励啊？", 5, 0)
		say("奖励？不知道，咱们有什么？", 0, 1)
		say("你到是不客气。", 5, 0)
		say("我这有颗天王保命丸，就给你了，关键时候能够保你一命。", 5, 0)
		say("多谢师祖。", 0, 1)
		addthing(8, 1)
	end

	say("好了，你们去安排事情吧，安排好了通知我。", 5, 0)
	say("是，师父。", 171, 0)
	say("是，师父。", 1131, 0, "俞岱岩")
	dark()
	null(43, 28)
	null(43, 69)
	addevent(43, 11, 1, 8033, 1, 6116)
	null(34, 0)
	addevent(34, 57, 0, 8038, 3, -2)
	addevent(34, 19, 1, 8039, 1, 5406)
	addevent(34, 22, -2, -2, -2, 5366)
	addevent(34, 4, -2, -2, -2, 5430)
	addevent(34, 16, -2, -2, -2, 5430)
	addevent(34, 43, -2, -2, -2, 5428)
	addevent(34, 21, -2, -2, -2, 5428)
	addevent(34, 23, -2, -2, -2, 5430)
	addevent(34, 7, -2, -2, -2, 5428)
	addevent(34, 29, -2, -2, -2, 5428)
	addevent(34, 55, -2, -2, -2, 5430)
	light()
end
OEVENTLUA[8033] = function ()
	Cls()
	say("师侄，你来了。", 1131, 0, "俞岱岩")
	say("师伯好。", 0, 1)
	say("你上次治好了我的病我还没有感谢你呢，这是我以前收集到的东西，一直没有用到，正好给你。", 1131, 0, "俞岱岩")
	addthing(17, 1)
	say("师伯你太客气了，你身体刚好，正好用这个补补元气。", 0, 1)
	say("不要和我客气了，叫你拿着就拿着。", 1131, 0, "俞岱岩")
	say("是，多谢师伯。", 0, 1)
	addevent(43, 11, 1, 8034, 1, 6116)
end
OEVENTLUA[8034] = function ()
	Cls()
	say("师侄，让我看看你武功怎么样了？", 1131, 0, "俞岱岩")
	say("是，请师伯指教。", 0, 1)
	SetS(43, 38, 28, 5, 6)

	if WarMain(295, 0) == false then
		for iter_21_0 = 1, 20 do
			if JY.Person[0]["武功" .. iter_21_0] == 46 and JY.Person[0]["武功等级" .. iter_21_0] <= 900 then
				say("师侄，可有所领悟？", 1131, 0, "俞岱岩")
				say("太极阴阳...，原来如此！", 0, 1)

				JY.Person[0]["武功等级" .. iter_21_0] = JY.Person[0]["武功等级" .. iter_21_0] + 100
				JY.Person[0].修炼点数 = JY.Person[0].修炼点数 + 150

				War_PersonTrainBook(0)
				addtime(1)

				return
			end
		end

		say("不错不错。", 1131, 0, "俞岱岩")
		say("多谢师伯！", 0, 1)

		JY.Person[0].修炼点数 = JY.Person[0].修炼点数 + 50

		War_PersonTrainBook(0)
		addtime(1)

		return
	else
		say("师侄，你武功居然已经达到如此地步，我已经不能指点你了。", 1131, 0, "俞岱岩")
	end

	SetS(43, 38, 28, 5, 0)
end
OEVENTLUA[8038] = function ()
	Cls()
	dark()
	null(34, 57)
	light()
	say("进得门来，只见崆峒弟子躺了一地，人人哀嚎不止", 0, 1)
	say("哎呀，崆峒派好惨，这是谁做的啊？", 0, 0)
	say("师父，武当的人又来了。", 193, 1)
	say("可恶，你们还来做什么？", 167, 0)
	say("哦，看看，看看。", 0, 1)
	say("（太师父好生厉害，都一百多岁的人了，还这么生猛）", 0, 0)
	say("看什么？你武当不要欺人太甚，仗着武功高强就能随意欺负别人了吗？", 167, 0)
	say("让你和武当作对，该！", 0, 1)
	say("混账，我和你拼了！", 167, 0)
	say("老头子这是急了？算了，好汉不吃眼前亏，没啥好处的事看看就行，我撤！", 0, 1)
	say("老头子，这么大岁数了还没学会修身养性，这江湖怎么混的？", 0, 1)
	say("你，你你你", 167, 0)
	dark()
	ReturnMMap2(167, 314)
	null(34, 22)
	null(34, 16)
	null(34, 43)
	null(34, 21)
	null(34, 23)
	null(34, 4)
	null(34, 7)
	null(34, 29)
	null(34, 55)
	addevent(34, 3, 1, 8039, 1, 5406)
	addevent(34, 6, 1, 8039, 1, 5406)
	addevent(34, 5, 1, 8039, 1, 5408)
	light()
	say("爽！", 0, 1)
end
OEVENTLUA[8039] = function ()
	Cls()
	say("我崆峒从今后与你武当井水不犯河水，你还来干什么？", 193, 0)
end
OEVENTLUA[8051] = function ()
	Cls()

	if JY.Person[0].品德 >= 60 and JY.Person[0].门派 == 0 and JY.Person[0].性别 == 0 then
		say("晚辈拜见空见大师。", 0, 1)
		say("小施主你好啊。", 170, 0, "空见")
		say("老衲看小施主颇有慧根，更难得的是人品清正。不知小施主可愿意拜入少林门下？", 170, 0, "空见")

		if DrawStrBoxYesNo(-1, -1, "要拜师吗？", C_WHITE, 30) == false then
			return
		end

		say("晚辈愿意！", 0, 1)
		say("好，好。老衲今日就收你为我少林俗家弟子。", 170, 0, "空见")
		say("师父在上，请受弟子一拜！", 0, 1)
		say("嗯。这是我少林基础功法，炼之可强身健体。", 170, 0, "空见")
		say("是，师父。", 0, 1)
		say("少林寺以佛法为基，平时可多去藏经阁参研佛法。", 170, 0, "空见")
		say("是。", 0, 1)

		JY.Person[0].门派 = 2
		JY.Person[0].门派等级 = 7

		if JY.Person[169].好感度 < 60 then
			JY.Person[169].好感度 = 60
		end

		QZXS(JY.Person[0].姓名 .. "成为少林弟子！")
		addthing(112)

		if PersonKF(0, 1) == false then
			local var_24_0 = JY.Person[0].主功体

			stop_ng(0)

			JY.Person[0].武功1 = 1
			JY.Person[0].武功等级1 = 50

			star_ng(0, var_24_0)
		end

		addevent(28, 21, 1, 8052, 1, -2, -2, -2)
	elseif JY.Person[0].品德 <= 20 and JY.Person[0].攻击力 >= 350 and JY.Person[0].门派 ~= 2 and JY.Person[0].性别 == 0 then
		Cls()
		say("阿弥陀佛，我佛慈悲。施主作恶多端，不如今日就在少林寺出家吧，俗世的种种都是羁绊，只有佛祖才能助你脱离苦海。", 170, 0, "空见")

		if DrawStrBoxYesNo(-1, -1, "要在少林寺出家吗？", C_WHITE, 30) == false then
			say("阿弥陀佛，阿弥陀佛。", 170, 0, "空见")

			return
		end

		say("大师，我闯荡江湖以来，杀意满胸，如今两手血腥，心有悔意，望大师收留。", 0, 1)
		say("阿弥陀佛，我佛慈悲。所谓放下屠刀，立地成佛，你既有悔意，就入我少林达摩堂吧。", 170, 0, "空见")
		say("望你日后多多参研佛理，忘却尘世间的恩恩怨怨。", 170, 0, "空见")
		say("是，师父在上，请受弟子一拜！", 0, 1)
		Cls()
		dark()
		light()

		JY.YEAR = JY.YEAR + 2

		say("两年后......")
		say("师父，我日日参研佛经，终于醒悟人性本质，已经忘却过去种种。", 0, 1)
		say("甚好，甚好。少林乃灵性之地，你去多走走，和师兄们多多交流吧。", 170, 0, "空见")
		say("是，师父。", 0, 1)

		JY.Person[0].品德 = 60
		JY.Person[0].清罪恶值 = 0
		JY.Person[0].中原罪恶值 = 0
		JY.Person[0].宋罪恶值 = 0
		JY.Person[0].门派 = 2
		JY.Person[0].门派等级 = 9
		JY.Person[0].门派贡献 = 0

		if JY.Person[169].好感度 < 60 then
			JY.Person[169].好感度 = 60
		end

		addevent(28, 21, 1, 8052, 1, -2, -2, -2)
	else
		say("阿弥陀佛。", 170, 0, "空见")
	end
end
OEVENTLUA[8052] = function ()
	Cls()

	local var_25_0 = ({
		"《法华经》",
		"《楞严经》",
		"《金刚经》",
		"《无量寿经》",
		"《地藏经》",
		"《心经》",
		"《阿弥陀经》",
		"《华严经》",
		"《圆觉经》",
		"《六祖坛经》"
	})[math.random(1, 10)]

	if JY.Person[0].门派 == 2 then
		if JY.Person[0].门派等级 == 6 then
			Cls()
			say("唉，你走吧，我不想再见到你。", 170, 0, "空见")

			return
		end

		if JY.Person[0].拳掌功夫 == 99 then
			say("请师父指点。", 0, 1)
			say("让我看看你如今修炼得如何了？", 170, 0, "空见")
			say("是，师父。", 0, 1)
			dark()
			light()
			say("不错，武功旨在强身健体，足够自保也就可以了，我少林当以参研佛法为主。", 170, 0, "空见")
			say("是，师父。", 0, 1)
			write_nump(1, 1)

			JY.Person[0].拳掌功夫 = 100

			return
		end

		if PersonKF(0, 96) == false and JY.Person[0].门派贡献 >= 50 and JY.Person[0].门派等级 == 7 then
			say("你为门派做的师父都看在眼里，今日就任你为外门执事，你可愿意？", 170, 0, "空见")
			say("弟子愿意，多谢师父！", 0, 1)
			say("为师今日就再传你一些功夫，对你以后应该有用。", 170, 0, "空见")
			say("是！师父！", 0, 1)

			JY.Person[0].门派等级 = 8

			addthing(72)

			if PersonKF(0, 96) == false then
				local var_25_1 = JY.Person[0].主功体

				stop_ng(0)

				JY.Person[0].武功4 = 96
				JY.Person[0].武功等级4 = 50

				star_ng(0, var_25_1)
			end

			say("阿弥陀佛，即为外门执事，若是有来少林挑战的武林人士，就交给你来处理，记住以和为贵。", 170, 0, "空见")
			say("是！师父！", 0, 1)

			return
		elseif JY.Person[0].门派等级 == 8 and JY.Person[0].佛学修为 >= 80 and JY.Person[0].门派贡献 >= 80 then
			say("阿弥陀佛。徒儿，你如今佛法精深，为师已经向方丈举荐你为外门长老，你可愿意？", 170, 0, "空见")
			say("弟子愿意，多谢师父！", 0, 1)
			say("阿弥陀佛，希望你能尽己所学造福少林。", 170, 0, "空见")

			JY.Person[0].门派等级 = 9

			return
		else
			local var_25_2 = Rnd(10)

			if var_25_2 == 1 and JY.Person[0].拳掌功夫 < 80 then
				say("作为少林僧人，免不得行走江湖，修炼武功乃是保全自身的法门，为师今日就给你讲讲拳法。", 170, 0, "空见")
				say("是。", 0, 1)
				dark()
				light()
				addtime(30)

				JY.Person[0].拳掌功夫 = JY.Person[0].拳掌功夫 + 1

				say("好了，这次就到这里，你自去吧。", 170, 0, "空见")
				say("是，师父！", 0, 1)
			elseif var_25_2 == 2 and JY.Person[0].特殊兵器 < 80 then
				say("作为少林僧人，免不得行走江湖，修炼武功乃是保全自身的法门，为师今日就给你讲讲杖法。", 170, 0, "空见")
				say("是。", 0, 1)
				dark()
				light()
				addtime(30)

				JY.Person[0].特殊兵器 = JY.Person[0].特殊兵器 + 1

				say("好了，这次就到这里，你自去吧。", 170, 0, "空见")
				say("是，师父！", 0, 1)
			elseif var_25_2 == 3 and JY.Person[0].耍刀技巧 < 80 then
				say("作为少林僧人，免不得除魔卫道，为师今日就给你讲讲刀法。", 170, 0, "空见")
				say("是。", 0, 1)
				dark()
				light()
				addtime(30)

				JY.Person[0].耍刀技巧 = JY.Person[0].耍刀技巧 + 1

				say("好了，这次就到这里，你自去吧。", 170, 0, "空见")
				say("是，师父！", 0, 1)
			elseif JY.Person[0].佛学修为 > 100 then
				say("阿弥陀佛。徒儿，你如今境界如此高深，我要向你学习了。", 170, 0, "空见")
			else
				say("阿弥陀佛。徒儿，今日为师为你讲解" .. var_25_0 .. "。", 170, 0, "空见")
				say("是！师父！", 0, 1)
				dark()
				light()
				addtime(10)
				AddPersonAttrib(0, "佛学修为", 1)
				DrawStrBoxWaitKey("你的佛学修为增加了", C_ORANGE, CC.DefaultFont, 1)
			end
		end
	else
		say("阿弥陀佛。", 170, 0, "空见")
	end
end
OEVENTLUA[8140] = function ()
	Cls()
	say("小家伙，我这个孤寡老人就要病死了，你还不快带我去医馆看看去？", 1249, 0, "老乞丐")
	say("老先生，我还有事要办，我看你行动无碍，不如自己去医馆可好？", 0, 1)
	say("现在的年轻人啊，我身无分文，怎么看病？我这是积年老疾，去医馆看没有一千两看不下来的。", 1249, 0, "老乞丐")
	say("这？", 0, 1)
	say("世风日下啊，难道你要眼看一个勤劳善良的老人家病死在街头？你的良心何安？", 1249, 0, "老乞丐")

	if DrawStrBoxYesNo(-1, -1, "要给老人1000银两么？", C_WHITE, 30) == false then
		return
	end

	if has_thing(174, 1000) == false then
		say("可惜我连一千两也没有...", 0, 1)

		return
	end

	addthing(174, -1000)
	Cls()
	say("小家伙，你真是个善人啊。", 1249, 0, "老乞丐")
	say("现在有钱了，可是到处都是土匪流氓，我身怀巨款，只怕走不出几里地就会被抢，你有没有什么武功秘籍让我看看，我得先学几手防身。", 1249, 0, "老乞丐")
	say("武功秘籍？你现学？", 0, 1)
	say("怎么？不行？我年纪老迈，高深的武学是不成了，低级的武学总是可以的吧？", 1249, 0, "老乞丐")
	say("基础拳法？基础剑法？...", 0, 1)
	say("你这孩子真是笨，基础武学也能称秘籍吗？你要有罗汉拳、松风剑法这类的才算秘籍嘛。", 1249, 0, "老乞丐")

	if has_thing(112, 1) or has_thing(112, 1) or has_thing(112, 1) or has_thing(112, 1) then
		say("这个啊，我有啊。", 0, 1)

		if DrawStrBoxYesNo(-1, -1, "要给老人秘籍么？", C_WHITE, 30) == false then
			return
		end

		local var_26_0 = JYMsgBox("给老人秘籍", "请选择你想送给孤寡老人的武功秘籍", {
			"罗汉拳",
			"松风剑法",
			"柴刀",
			"袖里乾坤",
			"杨家枪"
		}, 5, 1115)

		if var_26_0 == 1 then
			if has_thing(112, 1) then
				addthing(112, -1)

				JY.Person[271].好感度 = 112
			else
				say("你这个年轻人不老实啊。", 1249, 0, "老乞丐")

				return
			end
		elseif var_26_0 == 2 then
			if has_thing(134, 1) then
				addthing(134, -1)

				JY.Person[271].好感度 = 134
			else
				say("现在的年轻人啊。", 1249, 0, "老乞丐")

				return
			end
		elseif var_26_0 == 3 then
			if has_thing(166, 1) then
				addthing(166, -1)

				JY.Person[271].好感度 = 166
			else
				say("你这年轻人，欺负我一个老头子有意思吗。", 1249, 0, "老乞丐")

				return
			end
		elseif var_26_0 == 4 then
			if has_thing(303, 1) then
				addthing(303, -1)

				JY.Person[271].好感度 = 303
			else
				say("你到底有没有秘籍。", 1249, 0, "老乞丐")

				return
			end
		elseif var_26_0 == 5 then
			if has_thing(186, 1) then
				addthing(186, -1)

				JY.Person[271].好感度 = 186
			else
				say("你这个年轻人不老实啊。", 1249, 0, "老乞丐")

				return
			end
		end

		say("你这年轻人真是好骗。", 1249, 0, "老乞丐")
		say("你？", 0, 1)
		say("太蠢了。", 1249, 0, "老乞丐")
		say("你...", 0, 1)
		say("我都不好意思下手了。", 1249, 0, "老乞丐")
		say("我...", 0, 1)
		say("真是奇怪了，你这样的人是怎么活下来的，算了算了，实在看不下去去了，小家伙，你拜师吧，我教你几招。", 1249, 0, "老乞丐")
		say("（这个老骗子，难道要教我骗人之术？）", 0, 1)

		if DrawStrBoxYesNo(-1, -1, "要拜老人为师吗？", C_WHITE, 30) == false then
			say("你这个老骗子。", 0, 1)

			return
		end

		say("徒儿拜见师父！", 0, 1)
		say("好吧，我今日收你为记名弟子。", 1249, 0, "老乞丐")
		say("为师名为牛吉，江湖人称牛十八，那是因为我十八般武艺样样皆通，可不是我自己封的。", 1249, 0, "老乞丐")
		say("说这么多，口都渴了，你且等我去取几壶酒来，莫要走开。", 1249, 0, "老乞丐")
		say("是，师父。", 0, 1)
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	else
		say("可惜我没有这种秘籍。", 0, 1)

		return
	end
end
OEVENTLUA[8141] = function ()
	Cls()
	say("是你？", 0, 1)
	say("你？小家伙，你居然还在这里等着我？", 1249, 0, "老乞丐")
	say("很好，很好，看见师父还不拜见？", 1249, 0, "老乞丐")

	if DrawStrBoxYesNo(-1, -1, "要拜见师父吗？", C_WHITE, 30) == false then
		say("老骗子，你居然敢骗我~，我看你这次怎么跑？", 0, 1)
		say("军爷救命啊，有人要当街行凶了~", 1249, 0, "老乞丐")
		say("大胆！住手！", 1255, 0, "官军")
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		say("无事无事，军爷不要误会。", 0, 1)
		say("哼！", 1255, 0, "官军")

		JY.Person[271].好感度 = 50

		return
	end

	say("好徒儿，我就教你一些本事，免得你老吃亏。", 1249, 0, "老乞丐")
	say("说这么多，口都渴了，你且等我去取几壶酒来。", 1249, 0, "老乞丐")
	say("师父，你且先教我几招，徒儿一会给你买酒去。", 0, 1)
	say("师父的话都不听？一日为师，终身为父，你在这儿等着，我一会儿就回。", 1249, 0, "老乞丐")
	say("这？", 0, 1)
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)

	JY.Person[271].武学常识 = 60
end
OEVENTLUA[8142] = function ()
	Cls()
	say("师父！还请师父指导。", 0, 1)
	say("很好，无论什么武功，先得将基础练个十来年，才有可能进阶顶级高手，听好了。", 1249, 0, "老乞丐")
	say("是，师父！", 0, 1)
	dark()
	light()
	addtime(30)

	if JY.Person[271].好感度 == 112 and JY.Person[0].拳掌功夫 < 80 then
		JY.Person[0].拳掌功夫 = JY.Person[0].拳掌功夫 + 1
	elseif JY.Person[271].好感度 == 134 and JY.Person[0].御剑能力 < 80 then
		JY.Person[0].御剑能力 = JY.Person[0].御剑能力 + 1
	elseif JY.Person[271].好感度 == 166 and JY.Person[0].耍刀技巧 < 80 then
		JY.Person[0].耍刀技巧 = JY.Person[0].耍刀技巧 + 1
	elseif JY.Person[271].好感度 == 303 and JY.Person[0].特殊兵器 < 80 then
		JY.Person[0].特殊兵器 = JY.Person[0].特殊兵器 + 1
	elseif JY.Person[271].好感度 == 186 and JY.Person[0].暗器技巧 < 80 then
		JY.Person[0].暗器技巧 = JY.Person[0].暗器技巧 + 1
	end

	say("勤能补拙，自己多去练习练习。", 1249, 0, "老乞丐")
end
OEVENTLUA[8151] = function ()
	local var_29_0 = math.random(22, 25)
	local var_29_1 = {
		1,
		3,
		60,
		61
	}
	local var_29_2 = var_29_1[math.random(#var_29_1)]

	Cls()
	say("真想再尝一尝" .. JY.Thing[var_29_0].名称 .. "的味道啊....", 1132, 0, "老乞丐")

	if has_thing(var_29_0) then
		Cls()

		if DrawStrBoxYesNo(-1, -1, "要请客么？", C_WHITE, 30) == false then
			return
		end

		addthing(var_29_0, -1)
		Cls()
		say("老先生如果不介意，晚辈可以做东。", 0, 1)
		dark()

		JY.Person[458].好感度 = JY.Person[458].好感度 + 10

		light()
		Cls()
		say("就是这个味道，当年七公他老人家给我喝过一次，真香啊。", 1132, 0, "老乞丐")

		if JY.Base.畅想编号 == 50 then
			say("小家伙你叫乔峰？看到你就想起我年轻的时候，不错不错，我这有几手驱狗套蛇的本事就交给你吧。", 1132, 0, "老乞丐")

			local var_29_3 = JY.Person[0].主功体

			stop_ng(0)

			JY.Person[0].武功1 = 76
			JY.Person[0].武功等级1 = 100

			star_ng(0, var_29_3)
			Cls()
			say("多谢先生教导。", 0, 1)
			dark()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 2, 2, 2, -2, -2, -2)
			light()

			JY.Person[458].好感度 = JY.Person[458].好感度 + 5
		else
			dark()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 2, 2, 2, -2, -2, -2)
			light()
		end

		say("小家伙，有缘再见。", 1132, 0, "老乞丐")
		instruct_3(51, 49, 1, -2, 8152, -2, -2, 6266, 6266, 6266, -2, -2, -2)
	end
end
OEVENTLUA[8152] = function ()
	Cls()
	say("小子，我们又见面了。", 1132, 0, "鲁有脚")

	if JY.Person[0].品德 >= 60 and JY.Person[0].门派 == 0 then
		Cls()
		say("上次欠你的人情老叫化不还心理不舒服。这样吧，看你功夫人品都不错，要不要加入我们丐帮？", 1132, 0, "鲁有脚")

		if DrawStrBoxYesNo(-1, -1, "要拜师吗？", C_WHITE, 30) == true then
			Cls()
			say("师父在上，请受弟子一拜！", 0, 1)
			Cls()
			say("好，好！我这就给你讲讲加入丐帮的好处。", 1132, 0, "鲁有脚")
			say("我丐帮没有那么多规矩，这些都是我擅长的武功，你自己拿去好好学。", 1132, 0, "鲁有脚")

			JY.Person[0].门派 = 3
			JY.Person[0].门派等级 = 1

			if JY.Person[50].好感度 < 60 then
				JY.Person[50].好感度 = 60
			end

			if JY.Person[69].好感度 < 60 then
				JY.Person[69].好感度 = 60
			end

			if PersonKF(0, 151) == false then
				local var_30_0 = JY.Person[0].主功体

				stop_ng(0)

				JY.Person[0].武功2 = 151
				JY.Person[0].武功等级2 = 100

				star_ng(0, var_30_0)
			end

			addthing(237)
			addthing(266)
			addthing(185)
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 2, 2, 2, -2, -2, -2)
			dark()
			light()
			QZXS(JY.Person[0].姓名 .. "成为丐派弟子！")
			instruct_3(51, 49, 1, -2, 8153, -2, -2, 6266, 6266, 6266, -2, -2, -2)
		end
	else
		Cls()
		say("我虽有心收你为徒，可惜丐帮似乎不适合你，再去江湖上历练一下吧。", 1132, 0, "鲁有脚")
	end
end
OEVENTLUA[8153] = function ()
	Cls()

	if JY.Person[0].门派等级 == 6 then
		say("唉，你走吧，我不想再见到你。", 1132, 0, "鲁有脚")

		return
	end

	if JY.Person[0].拳掌功夫 < 60 then
		say("师父！", 0, 1)
		say("师父善使拳脚，今日给你讲讲拳法。", 1132, 0, "鲁有脚")
		say("是。", 0, 1)
		dark()
		light()
		addtime(30)

		JY.Person[0].拳掌功夫 = JY.Person[0].拳掌功夫 + 1
	end

	if JY.Person[0].门派 == 3 and JY.Person[0].门派等级 == 1 and JY.Person[0].声望 > 20 then
		if PersonKFJ(0, 151) == false then
			say("我上次教你的功夫还没有练好吗？看来你还是得勤加练习啊。", 1132, 0, "鲁有脚")

			return
		end

		say("看来你功夫大有长进，可以学习进一步的功夫了。", 1132, 0, "鲁有脚")

		if PersonKF(0, 146) == false then
			local var_31_0 = JY.Person[0].主功体

			stop_ng(0)

			JY.Person[0].武功3 = 146
			JY.Person[0].武功等级3 = 50

			star_ng(0, var_31_0)
		end

		addthing(261)
		say("谢谢师父！", 0, 1)

		JY.Person[0].门派等级 = 2

		say("前段时间陈长老被人打伤了，似乎是有人要针对我们丐帮，最近出去要小心一些！", 1132, 0, "鲁有脚")
		say("是，师父！", 0, 1)
		say("你素来机敏，不妨去荆州查一查是否有什么线索。", 1132, 0, "鲁有脚")
		say("是，师父！", 0, 1)
		addevent(119, 89, 0, 8154, 3, -2, -2, -2)
		addevent(119, 87, 0, 0, 0, 8994, -2, -2)
		addevent(119, 88, 0, 0, 0, 8972, -2, -2)

		return
	end

	Cls()
	say("你现在江湖经验不足，再去江湖上历练一下吧。", 1132, 0, "鲁有脚")
end
OEVENTLUA[8154] = function ()
	Cls()
	dark()
	null(119, 89)
	light()
	say("什么人？", 1044, 0, "西夏一品堂高手")
	say("我？我是...对，我是官军。", 0, 1)
	say("官军查案，你们是什么人？", 0, 1)
	say("嗯？你腰间的银边烟管从哪拿的？这是丐帮白长老的兵器", 0, 1)
	say("官军也敢管我西夏一品堂的事,找死！（一拍桌子，手去拿刀）", 1044, 0, "西夏一品堂高手")
	say("好个西夏一品堂，马上自废武功，自缚双手，我饶你等不死！", 0, 1)
	say("杀！", 1044, 0, "西夏一品堂高手")

	if WarMain(402) == false then
		instruct_15()

		return
	end

	say("待我西夏大军南下，你们都落不了猪羊的下场！", 1044, 0, "西夏一品堂高手")
	say("哼！（一刀宰之）", 0, 1)
	null(119, 87)
	null(119, 88)

	JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 5

	instruct_37(2)
	instruct_56(1)
	instruct_3(51, 49, 1, 0, 8155, 0, 0, 6266, 6266, 6266, -2, -2, -2)
end
OEVENTLUA[8155] = function ()
	Cls()

	if JY.Person[0].门派 == 3 and JY.Person[0].门派等级 == 2 and JY.Person[0].声望 >= 80 then
		say("你如今在江湖上也有一些名望了，为师甚是欣慰。", 1132, 0, "鲁有脚")
		Cls()
		say("陈长老进来身体不佳，准备隐退了，我已经向帮主举荐了你接替他的位置。按照丐帮规矩，如果你能闯过这一关，护法长老之位就是你的了。", 1132, 0, "鲁有脚")

		if WarMain(403) == false then
			Cls()
			say("看来你还是得勤加练习啊。", 1132, 0, "鲁有脚")

			return
		end

		dark()
		light()
		Cls()
		say("好！从今天起你就是丐帮护法长老了。盼你能善用所学行侠仗义。", 1132, 0, "鲁有脚")
		Cls()
		say("是！弟子定不负师父教诲！", 0, 1)
		say("这是丐帮的高阶武功，你自己拿去好好研习。", 1132, 0, "鲁有脚")
		addthing(293)
		say("...", 0, 1)
		say("师父？这就完了？", 0, 1)
		say("是不是有什么仪式什么的？", 0, 1)
		say("萧帮主不在，要什么仪式。", 1132, 0, "鲁有脚")
		say("对了，丐帮长老可得帮主传授我丐帮绝学打狗棒法。", 1132, 0, "鲁有脚")
		say("你遇到帮主就可以学到了。", 1132, 0, "鲁有脚")
		say("这，（好潦草啊）", 0, 1)
		say("你如今已经有所成就，我也就放心了。", 1132, 0, "鲁有脚")

		JY.Person[0].门派等级 = 4

		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	else
		say("你功夫已经很好了，多出去闯荡闯荡，扬我丐帮威名。", 1132, 0, "鲁有脚")
	end
end
OEVENTLUA[8201] = function ()
	Cls()
	dark()
	null(-2, 58)
	light()
	say(JY.Person[0].称呼 .. "，你进来吧。", 35, 0)
	instruct_30(26, 27, 16, 27)
	meet_self(19)
	say("冲儿已经和我说过你的事情，你可是真心愿意加入我华山派。", 19, 0)
	say("是，绝无二心。", 0, 1)

	if JY.Person[0].门派 == 0 then
		say("既是冲儿如此看重与你，我便先收你入门，入得我华山门下，需得谨记我华山派七大门规。", 19, 0)
		say("一、首戒欺师灭祖，不敬尊长；二、戒持强欺弱，擅伤无辜；三、戒奸淫好色，调戏妇女；四、戒同门嫉妒，自相残杀；五、戒骄傲自大，得罪同道；六、戒见利忘义，偷窃财物；七、戒滥交匪类，勾结妖邪。记得了吗？", 19, 0)
		say("是，师父。", 0, 1)
		say("师父，我带小师弟先去门派各处转转吧。", 35, 0)
		say("你都数月未回华山了，先去看看师娘。", 19, 0)
		say("是，师父，小师弟你先自己去转转，熟悉一下。", 35, 0)
		dark()
		null(-2, 42)
		light()
		say("这是我华山的基础内功，你拿去勤加练习。", 19, 0)
		say("是，师父。", 0, 1)
		addthing(239, 1)
		say("好了，你出去吧，先和师兄弟们熟悉熟悉。", 19, 0)
		say("是，师父。", 0, 1)
		instruct_30(16, 27, 27, 27)

		JY.Person[0].门派 = 4
		JY.Person[0].门派等级 = 1
	else
		dark()
		light()
		say("嗯？", 19, 0)
		say("无知小辈，欺我华山无人呼？", 19, 0)
		say("师父？这是？", 35, 0)
		say("你被骗了，这人身负上乘武功，别有用心。", 19, 0)
		say("你居然骗我？", 35, 0)
		say("我... ", 0, 1)
		say("你是左冷禅派来的吧，看在五岳同盟的面子上，我不杀你。回去告诉左冷禅，我华山派乃是五岳之一，他不必动用这种下乘手段，没得丢了身份。", 19, 0)
		say("我不是...。令狐兄，这是个误会啊。", 0, 1)
		say("赶快离开，我华山不欢迎你。", 19, 0)
		say("滚~", 19, 0)
		dark()
		My_Enter_SubScene(57, 53, 29, 1)
		light()
		say("我...... ", 0, 1)
	end
end
OEVENTLUA[8251] = function ()
	Cls()

	if JY.Person[0].门派 == 0 and JY.Person[0].品德 <= 30 then
		say("小子，我看你资质不错，要不要加入我星宿派？", 208, 0, "星宿门人")

		if yesno("要加入星宿派嘛？") then
			say("加入本派需要先交纳入门费2000两。", 208, 0, "星宿门人")

			if instruct_31(2000) == false then
				say("穷鬼，给我滚！", 208, 0, "星宿门人")
				Cls()
			end

			instruct_32(174, -2000)
			say("给。", 0, 1)
			say("很好，从现在起你就是星宿门人了。", 208, 0, "星宿门人")
			say("啊？不用拜师吗？", 0, 1)
			say("星宿老仙是你说见就能见的吗？", 208, 0, "星宿门人")
			say("本门一切以实力为尊，师兄弟们可以相互挣斗，获胜的就是师兄，本门最厉害的就是大师兄，见着大师兄一定要恭恭敬敬的，记住了。", 208, 0, "星宿门人")
			say("好。", 0, 1)
			say("这是我派的入门功夫，你拿去好好练练。", 208, 0, "星宿门人")
			addthing(262)
			addthing(297)

			JY.Person[0].门派 = 6
			JY.Person[0].门派等级 = 1

			QZXS(JY.Person[0].姓名 .. "成为星宿派弟子！")
		else
			say("真是不识抬举。", 208, 0, "星宿门人")
		end
	elseif JY.Person[0].门派 == 7 or JY.Person[0].门派 == 6 and JY.Person[0].门派等级 == 5 then
		say("拜见教主。", 206, 0, "星宿门人")
		say("教主德配天地，威震当世，古今无比。", 206, 0, "星宿门人")
	elseif JY.Person[0].门派 == 6 then
		say("看见我也要叫师兄，恭敬一点知道的吗。", 208, 0, "星宿门人")
	else
		say("中原人，赶快离开。", 208, 0, "星宿门人")
		say("看见你们这样一本正经的家伙就让人讨厌，快走快走。", 208, 0, "星宿门人")
	end
end
OEVENTLUA[8252] = function ()
	Cls()

	if JY.Person[0].门派 == 6 then
		if inteam(49) then
			say("拜见师父。", 0, 1)
			say("你来得正好，为师得到消息，苏星河布下了玲珑棋局，我命你去搅乱棋局，抢到他手里的一个钨铁指环给我。", 46, 0, "丁春秋")
			say("是，师父，不知这个苏星河在什么地方？", 0, 1)
			say("你走到长江的入海口，在那一片找一个叫擂鼓山的地方。", 46, 0, "丁春秋")
			say("是，师父。", 0, 1)
			instruct_39(53)
			addevent(35, 0, 1, 8252, 1)
		elseif JY.Person[0].门派贡献 >= 50 and JY.Person[0].门派等级 == 1 and (PersonKF(0, 149) == false or has_thing(264) == false) then
			say("拜见师父。", 0, 1)
			say("嗯嗯，乖徒儿来了？这是我派的进阶功法，你拿去好好练练。", 46, 0, "丁春秋")
			addthing(264)
			say("是，师父。", 0, 1)

			JY.Person[0].门派等级 = 2
		elseif JY.Person[0].门派贡献 >= 100 and JY.Person[0].门派等级 < 3 then
			say("拜见师父。", 0, 1)
			say("嗯嗯，乖徒儿，你大师兄回来了，以后你们好好亲近亲近，你要能打败他，我就升你做大师兄，我看好你哦，哈哈哈。", 46, 0, "丁春秋")
			say("师父，我会努力的。", 0, 1)
			addevent(35, 15, 0, 8253, 3, -2, -2, -2)
		else
			say("拜见师父。", 0, 1)

			if instruct_31(2000) == false then
				say("你来做什么？给我出去多抢些东西回来，别老在这儿闲晃。", 46, 0, "丁春秋")

				return
			end

			say("师父，我最近出去抢到了一些好东西，特来献给师父。", 0, 1)
			say("很好很好，真是我的乖徒儿。", 46, 0, "丁春秋")
			instruct_32(174, -2000)

			JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 10
		end
	else
		say("没事不要在我星宿海晃荡，我这儿不欢迎中原人。", 46, 0, "丁春秋")
	end
end
OEVENTLUA[8253] = function ()
	Cls()

	local var_37_0 = 0
	local var_37_1 = JY.Person[0].性别 == 1 and "小师妹" or "小师弟"

	dark()
	null(35, 15)
	addevent(35, 11, -2, -2, -2, 6372, -2, -2)
	light()
	say("大师兄，师父他老人家已经睡着了。", 206, 0, "星宿门人")
	say("师父他老人家今晚喝酒了吗？", 1091, 0, "大师兄")
	say("喝了，睡得香着呢。", 206, 0, "星宿门人")
	say("很好，你在门口看着，谁也不许进来。", 1091, 0, "大师兄")
	say("大师兄，师父他要是知道了？", 206, 0, "星宿门人")
	say("放心，我都安排好了。", 1091, 0, "大师兄")

	if DrawStrBoxYesNo(-1, -1, "要去叫醒师父吗？", C_WHITE, 30) == false then
		say("还是不要多事了！", 0, 1)
		dark()
		null(35, 11)
		light()

		return
	end

	say(var_37_1 .. "，你在这儿鬼鬼祟祟做什么？", 206, 0, "星宿门人")
	My_Enter_SubScene(35, 20, 43, 0)
	say("我正想问你呢？你在这儿做什么？", 0, 1)
	say("来人啊！！！发现其他帮派混进来的奸细了！！！", 206, 0, "星宿门人")

	if WarMain(416, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("够狠啊！说，你和大师兄在这儿做什么？", 0, 1)
	say("别动手，我说，大师兄他", 206, 0, "星宿门人")
	say("我发现你是混入我派的奸细，刚偷了师父的神木王鼎。", 1091, 0, "大师兄")

	if WarMain(417, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	addthing(323)
	say("原来是要偷师父的神木王鼎。", 0, 1)
	say("大师兄，你走吧，我今日心情好，不杀你。哈哈。", 0, 1)
	say("哼。", 1091, 0, "大师兄")
	dark()
	null(35, 11)
	addevent(35, 0, 1, 8254, 1, 6362)
	addevent(35, 1, 1, 8254, 1, 6360)
	light()
	say("来人啊，来人啊，大师兄偷了师父的宝鼎，大家快追！", 0, 1)

	JY.Person[0].门派等级 = 3

	say("快追~", 208, 0, "星宿门人")
	null(35, 4)
	null(35, 5)
end
OEVENTLUA[8254] = function ()
	Cls()
	say("你今天来有何事禀报？", 46, 0, "丁春秋")

	if yesno("是否要挑战丁春秋？") then
		say("禀师尊，最近江湖上发生了一件大事....（低语，俯身接近）", 0, 1)
		Cls()
		say("啊！！你竟然敢暗算我！！", 46, 0, "丁春秋")
		Cls()
		say("哈哈哈，师尊不是常说能者居之。您在这椅子上做了这么久，也是时候退位让贤了。", 0, 1)
		Cls()
		say("我和你拼了！", 46, 0, "丁春秋")

		if WarMain(122, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(35, 0)
		null(35, 1)
		null(35, 2)
		light()
		addthing(66, 1)
		say("哈哈哈！我终于成为掌门了！！！", 0, 1)
		say("丁老怪灯烛之火，居然也敢和日月争光。恭贺掌门师兄成为新一代星宿老仙。", 206, 0, "星宿门人")
		say("星宿老仙，法驾中原，神通广大，法力无边。", 206, 0, "星宿门人")
		say("哈哈哈哈哈哈！！！！", 0, 1)

		JY.Person[0].门派等级 = 5
	else
		say("拜见师父。", 0, 1)

		if instruct_31(2000) == false then
			say("你来做什么？给我出去多抢些东西回来，别老在这儿闲晃。", 46, 0, "丁春秋")
			Cls()
		end

		say("师父，我最近出去抢到了一些好东西，特来献给师父。", 0, 1)
		say("很好很好，真是我的乖徒儿。", 46, 0, "丁春秋")
		instruct_32(174, -2000)

		JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 10
	end
end
OEVENTLUA[8255] = function ()
	Cls()

	if yesno("是否要杀丁春秋？") then
		if inteam(49) and PersonKF(49, 8) then
			say("丁春秋，你认得这七宝指环吗？", 0, 1)
			say("你是谁，怎么会有这东西。", 46, 0)
			say("见到掌门还不跪下。", 0, 1)
			say("这逍遥派掌门的信物是哪儿偷来的？", 46, 0)
			say("是你师父给的，他还要我们来替他清理门户，除去你这武林败类。", 0, 1)
			say("那老贼被我打落山崖，居然还没死，竟然还将这七宝指环给了你。也好，你亲自来送死，也免得我去找这七宝指环了。", 46, 0)
			say("师父功力，震烁古今，你竟敢和我们作对，这叫萤火虫与日月争光！", 206, 0, "星宿门人")
			say("螳臂挡车，自不量力，可笑啊！可笑！", 206, 0, "星宿门人")
			say("我师父谈笑之间，便可将你们这一干妖魔小丑置之死地……", 206, 0, "星宿门人")
			say("你们烦不烦，要打就快打，别在那大吹法螺。", 0, 1)
		else
			say("禀师尊，最近江湖上发生了一件大事....（低语，俯身接近）", 0, 1)
			say("啊！！你竟然敢暗算我！！", 46, 0, "丁春秋")
			say("哈哈哈，师尊不是常说能者居之。您在这椅子上做了这么久，也是时候退位让贤了。", 0, 1)
			say("我和你拼了！", 46, 0, "丁春秋")
		end

		if WarMain(86, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(35, 0)
		null(35, 1)
		null(35, 2)
		light()
		addthing(66, 1)
		say("丁老怪灯烛之火，居然也敢和日月争光。恭贺掌门师兄成为新一代星宿老仙。", 206, 0, "星宿门人")
		say("星宿老仙，法驾中原，神通广大，法力无边。", 206, 0, "星宿门人")
		say("哈哈哈哈哈哈！！！！", 0, 1)

		if JY.Person[0].门派 == 6 then
			JY.Person[0].门派等级 = 5
		end

		if inteam(49) then
			say("我们这是算完成前辈的交代了吧。", 49, 1)
			addevent(53, 0, 1, 3110, 1, 6340)

			JY.Person[49].好感度 = 70
		end
	elseif JY.Person[0].门派 == 6 then
		say("拜见师父。", 0, 1)

		if instruct_31(2000) == false then
			say("你来做什么？给我出去多抢些东西回来，别老在这儿闲晃。", 46, 0, "丁春秋")
			Cls()
		end

		say("师父，我最近出去抢到了一些好东西，特来献给师父。", 0, 1)
		say("很好很好，真是我的乖徒儿。", 46, 0, "丁春秋")
		instruct_32(174, -2000)

		JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 10
	else
		say("你有什么事吗？", 46, 0, "丁春秋")
		say("啊，没有没有。", 0, 1)
	end
end
OEVENTLUA[8801] = function ()
	Cls()
	dark()
	null(133, 3)
	light()
	say("荒乡僻壤，竟然有客前来，年轻人，请进。", 360, 0, "隐士")
	say("老先生你好，打搅了。", 0, 1)
	instruct_30(12, 52, 9, 52)
	say("不知你到这儿来是？咦？", 360, 0, "隐士")
	say("年轻人，你是从哪儿来的？", 360, 0, "隐士")
	say("我吗？我是从小村出来的。", 0, 1)
	say("小村？在什么地方？", 360, 0, "隐士")
	say("哦，那是一个小地方，在扬州和福州之间，卧虫山脚下的一个村子。", 0, 1)
	say("不对，不对。", 360, 0, "隐士")
	say("不对？", 0, 1)
	say("你是在那儿出生的？", 360, 0, "隐士")
	say("不是，我是孤儿，不知道父母是谁。", 0, 1)
	say("哦，那就对了。", 360, 0, "隐士")
	say("？？？", 0, 1)
	say("老先生莫非识得我的家人？", 0, 1)
	say("不认识。", 360, 0, "隐士")
	say("那？", 0, 1)
	say("你出生不凡，注定有一番作为，或者就是所谓的是天命之人了。", 360, 0, "隐士")
	say("我贤伯和丑叔也这么说？", 0, 1)
	say("贤伯？丑叔？", 360, 0, "隐士")
	say("收养我的两个老头子，他们自称南贤和北丑。", 0, 1)
	say("南贤和北丑？江湖每多奇人异士，看来你果然大有来历，也好。", 360, 0, "隐士")
	say("...", 0, 1)
	say("你在我这儿呆一段时间吧？或者能有所收获。另外，我有四个徒弟，分别学习武道、阴阳道、纵横道、儒道，你们可以多交流交流。", 360, 0, "隐士")
	addevent(133, 14, 0, 8802, 3, -2, -2, -2)
	addevent(133, 10, 1, 0, 1, 10312, -2, -2)
	addevent(133, 11, 1, 0, 1, 9252, -2, -2)
end
OEVENTLUA[8802] = function ()
	Cls()
	dark()
	null(133, 14)
	light()

	local var_41_0 = 0
	local var_41_1 = JY.Person[0].性别 == 1 and "她" or "他"

	say("年轻人，渴了吧？进来我给你，啊~，是你，是你，你这个恶魔~~~", 1118, 0, "妇人")
	dark()
	null(133, 10)
	null(133, 11)
	addevent(133, 12, 1, -2, 1, 9252, -2, -2)
	addevent(133, 13, 1, -2, 1, 10312, -2, -2)
	light()
	say("怎么了？", 0, 1)
	say("你别进来~，这么多年了，你还是来了，你这个恶魔~~~", 1118, 0, "妇人")
	say("我？...", 0, 1)
	null(133, 8)
	addevent(133, 30, 1, -2, 1, 10418, -2, -2)
	say("怎么回事？出什么事了？", 366, 0, "大弟子")
	My_Enter_SubScene(133, 12, 44, 2)
	say("我也不知道啊？我刚走到这个门口，就这样了。", 0, 1)
	say("你等一会儿，我进去看看徐大嫂。", 366, 0, "大弟子")
	dark()
	null(133, 30)
	addevent(133, 31, 1, -2, 1, 10416, -2, -2)
	light()
	say("半饷过后", 0, 2)
	dark()
	null(133, 31)
	addevent(133, 30, 1, -2, 1, 10418, -2, -2)
	light()
	say("你别进去了，徐大嫂受了惊吓，你先和我回去再说。", 366, 0, "大弟子")
	say("也好。", 0, 1)
	dark()
	null(133, 7)
	null(133, 30)
	My_Enter_SubScene(133, 10, 51, 2)
	addevent(133, 32, 1, -2, 1, 10416, -2, -2)
	addevent(133, 35, 1, -2, 1, 9108, -2, -2)
	light()
	say("刚才是出什么事了？", 360, 1, "隐士")
	say("师父，徐大嫂说" .. var_41_1 .. "就是当年那个害死全村人的那个恶魔。", 366, 0, "大弟子")
	say("不可能，我看过" .. var_41_1 .. "的面相，不会是他。", 263, 0, "二弟子")
	say("会不会是面貌相似，徐大嫂认错了？", 360, 1, "隐士")
	say("徐大嫂说就是" .. var_41_1 .. "，她很肯定。", 366, 0, "大弟子")
	say("年轻人，你以前来过这个地方？", 360, 1, "隐士")
	say("这个，我不知道，我失忆了，小时候的事已经不记得了。", 0, 1)
	say("徐大嫂还说什么了？", 360, 1, "隐士")
	say("徐大嫂说了一些隐秘的事。", 366, 0, "大弟子")
	say("10年前，村里的李大斧收留了一个流浪的小孩，那个孩子就是你，嗯，反正徐大嫂说就是你。", 366, 0, "大弟子")
	say("我，我都不记得了。", 0, 1)
	say("后来你就病死了。", 366, 0, "大弟子")
	say("啊？", 0, 1)
	say("他们把你埋在了乱葬岗。", 366, 0, "大弟子")
	say("...，这么说，我死了？", 0, 1)
	say("不错，第三天大暴雨，你从坟墓里爬了出来，并且走回了村里，很多人都看见了。", 366, 0, "大弟子")
	say("...，我，我觉得我不是僵尸。", 0, 1)
	say("没有人敢靠近你，看着你出了村子，在暴雨中走出了村子。", 366, 0, "大弟子")
	say("...，那？", 0, 1)
	say("第二天，李大斧突然发了狂，见人就咬。", 366, 0, "大弟子")
	say("啊？", 0, 1)
	say("更可怕的是，被李大斧咬了的人，不久也爬了起来，疯狂的咬其他人，很快村子里的人都疯狂了，幸亏徐大嫂家里有一个挖的很深的地窖，她们娘辆就躲在地窖里不敢出来。", 366, 0, "大弟子")
	say("怎么会有这样的事？", 0, 1)
	say("她们在地窖里藏了一个月，一个月后地窖里的红薯吃完了，她们只好爬了出来，然后就看见村里的人都死光了。", 366, 0, "大弟子")
	say("...", 0, 1)
	say("虽然我不记得了，不过我觉得不是我干的。", 0, 1)
	say("...", 366, 0, "大弟子")
	say("我看过你的面相，不会是你杀的。", 263, 0, "二弟子")
	say("谢谢。", 0, 1)
	say("我们就是这之后搬来的，帮助徐大嫂掩埋了尸体，因为出了这事，外面的人都不来了，很是清净，最后留在了这里。", 360, 0, "隐士")
	say("可惜我不懂医术，这很可能是瘟疫什么的。", 360, 0, "隐士")
	say("你相信我？", 0, 1)
	say("不相信。", 360, 0, "隐士")
	say("我...", 0, 1)
	say("我只是相信自己的判断，你不会是会对普通村民出手的人。", 360, 0, "隐士")
	say("不错。", 0, 1)
	say("好了，这事就这样吧。你就不要去徐大嫂屋里了，免得刺激她。", 360, 0, "隐士")
	say("他们当年把我埋在什么地方了？我想去看看。", 0, 1)
	say("乱葬岗的中间墓穴，你去看看也好。", 366, 0, "大弟子")
	dark()
	null(133, 32)
	null(133, 35)
	addevent(133, 8, 1, 13306, 1, 10414, -2, -2)
	addevent(133, 7, 1, 13305, 1, 9104, -2, -2)
	null(133, 12)
	null(133, 13)
	addevent(133, 14, 0, 8803, 3, -2, -2, -2)
	addevent(133, 10, 1, 0, 1, 10312, -2, -2)
	addevent(133, 11, 1, 0, 1, 9252, -2, -2)
	addevent(133, 33, 0, 8805, 3, -2, -2, -2)
	addevent(133, 4, 1, 8806, 1, -2, -2, -2)
	light()
end
OEVENTLUA[8803] = function ()
	Cls()
	dark()
	light()
	say("你这个恶魔，你怎么还来，你要做什么~", 1118, 0, "妇人")
	say("别害怕，你认错人了。", 0, 1)
	say("化成灰我也认得你，你这个恶魔，就是你干的~", 1118, 0, "妇人")
	say("妈妈，恶魔是要吃我们吗？我害怕~", 370, 1, "小孩")
	say("囧囧不怕啊~，妈妈在呢。", 1118, 0, "妇人")
	say("我，好吧，我走了，我走了。", 0, 1)
	My_Enter_SubScene(133, 14, 44, 1)
end
OEVENTLUA[8805] = function ()
	Cls()

	if inteam(2) then
		dark()
		null(133, 33)
		light()
		say("这个地方的人死的好生奇怪，我看看。", 2, 0)
		addevent(133, 34, 1, 0, 1, 8682, -2, -2)
		say("都这么多年前的事了，还可以找到原因吗？", 0, 1)
		say("如果是疾病或者瘟疫，总会留下痕迹的。", 2, 0)
		dark()
		light()
		say("果然如此。", 2, 0)
		say("怎么？", 0, 1)
		say("他们这是得了瘟疫，而且很不幸，似乎同时还爆发了狂犬病。", 2, 0)
		say("原来如此。", 0, 1)
		say("还好，不是我杀的就好，我们走吧。", 0, 1)
		say("好。", 2, 0)
		dark()
		null(133, 34)
		light()
	elseif inteam(16) and inteam(2) == false then
		dark()
		null(133, 33)
		light()
		say("这个地方的人死的好生奇怪，我看看。", 16, 0)
		addevent(133, 34, 1, 0, 1, 8682, -2, -2)
		say("都这么多年前的事了，还可以找到原因吗？", 0, 1)
		say("如果是疾病或者瘟疫，总会留下痕迹的。", 16, 0)
		dark()
		light()
		say("果然如此。", 16, 0)
		say("怎么？", 0, 1)
		say("他们这是得了瘟疫，而且很不幸，似乎同时还爆发了狂犬病。", 16, 0)
		say("原来如此。", 0, 1)
		say("还好，不是我杀的就好，我们走吧。", 0, 1)
		say("好。", 16, 0)
		dark()
		null(133, 34)
		light()
	elseif inteam(45) and inteam(2) == false and inteam(16) == false then
		dark()
		null(133, 33)
		light()
		say("这个地方的人死的好生奇怪，我看看。", 45, 0)
		addevent(133, 34, 1, 0, 1, 8682, -2, -2)
		say("都这么多年前的事了，还可以找到原因吗？", 0, 1)
		say("如果是疾病或者瘟疫，总会留下痕迹的。", 45, 0)
		dark()
		light()
		say("果然如此。", 45, 0)
		say("怎么？", 0, 1)
		say("他们这是得了瘟疫，而且很不幸，似乎同时还爆发了狂犬病。", 45, 0)
		say("原来如此。", 0, 1)
		say("还好，不是我杀的就好，我们走吧。", 0, 1)
		say("好。", 45, 0)
		dark()
		null(133, 34)
		light()
	end
end
OEVENTLUA[8806] = function ()
	Cls()
	dark()
	null(133, 4)
	light()
	say("一个空空的墓穴，中间一个大洞，似乎是有人曾经从里面爬了出来一样", 0, 2)
	say("难道，我真的是从坟墓里爬出来的？（你不由心里有些发寒）", 0, 1)
	say("这是？", 0, 1)
	addthing(338)
	say("埋在坟墓里，这么老旧，难道是我掉在这里的东西？", 0, 1)
	addevent(128, 21, 1, 8810, 1, 10312, -2, -2)
	addevent(69, 87, 1, 9707, 1, 7180, -2, -2)
	addevent(69, 88, 1, 9707, 1, 4918, -2, -2)
end
OEVENTLUA[8810] = function ()
	Cls()

	local var_45_0 = 0
	local var_45_1 = JY.Person[0].性别 == 1 and "小姐" or "小少爷"

	say("哎，我那苦命的孩儿，也不知道现在过得怎么样了。", 1118, 0, "夫人")
	say("夫人不用担心，" .. var_45_1 .. "好人有好福，说不定在哪个富贵人家里过着好日子呢。", 1110, 1, "丫鬟")

	if has_thing(338) then
		say("咦？年轻人，你身上这个，能让我看看吗？", 1118, 0, "夫人")
		say("这个，哦，长命锁啊？你看吧。", 0, 1)
		dark()
		light()
		say("这个，这个长命锁你从哪儿得来的？", 1118, 0, "夫人")
		say("这个是我的。", 0, 1)
		say("你的父母呢？", 1118, 0, "夫人")
		say("我？我是孤儿。", 0, 1)
		say("这，真的是，真的是，孩子，我苦命的儿啊。", 1118, 0, "夫人")
		say("啊？我？", 0, 1)
		say("恭喜夫人，恭喜" .. var_45_1 .. "，" .. var_45_1 .. "，你终于回来了，夫人这些年都是愁眉不展，天天念叨着你呢。", 1110, 0, "丫鬟")
		say("我？", 0, 1)
		say("小桃，孩儿回家了，你快去请老爷回来。", 1118, 0, "夫人")
		say("是，夫人。", 1110, 1, "丫鬟")
		dark()
		addevent(128, 124, 1, 0, 1, 10602, -2, -2)
		light()
		say("真是我的孩儿找到了？", 1052, 1, "铁捕头")
		say("老爷，我已经问过了，还有咱们当年给孩儿戴的长命锁，这就是咱们的孩儿。", 1118, 0, "夫人")
		say("好孩子，好孩子，都是爹当年惹了仇家，没有护好你，让你被拐卖了，爹对不起你。", 1052, 1, "铁捕头")
		say("呜呜，孩儿这些年吃了不少苦吧？来，跟娘说说，你现在在哪儿住？都在做什么？", 1118, 0, "夫人")
		say("我在小村住，那里的人收留了我，现在我长大了，就出来闯荡江湖。", 0, 1)
		say("哎，孩子，你还这么小，怎么能出来闯荡呢？现在回家了，要好好享福，江湖咱就不闯了啊，太危险了。", 1118, 0, "夫人")

		if JY.Person[0].性别 == 1 then
			say("不错，现在世道乱，女孩子家家的，就不要出去闯江湖了，在家里好好陪陪你妈。", 1052, 1, "铁捕头")
			say("是啊，外面太危险了，跟妈在家里做做女红，咱们府右街成立了一个针织小组，里面好多姐妹呢，我回头介绍你认识认识。", 1118, 0, "夫人")
			say("夫人，饭菜好了。", 1110, 1, "丫鬟")
			say("孩子，饿了吧，咱们先吃饭。", 1118, 0, "夫人")
			dark()
			light()
			say("我先回衙里去了，先给孩子落户要紧。", 1052, 1, "铁捕头")
			say("去吧去吧，晚上咱们请邻里来吃饭，别回来晚了。", 1118, 0, "夫人")
			say("知道。", 1052, 1, "铁捕头")
			dark()
			null(128, 124)
			light()

			return
		end

		say("老爷，你最知道江湖上的危险，你和孩子说说。", 1118, 0, "夫人")
		say("不错，江湖上十分危险，而且没有前途，像爹爹，当年就是习武，这几十年来拼了老命，也就混了一个副捕头，怎么也升不上去了。孩他娘，我去联系一下高老爷子，给孩子挂一个童生，好好学习，今年秀才考试还没过，还赶得上。", 1052, 1, "铁捕头")
		dark()
		null(128, 124)
		light()
		say("哎，你爹就是这急脾气，孩子刚回来，也不知道多待待。", 1118, 0, "夫人")
		say("我", 0, 1)
		say("别有压力，在家慢慢学，总能考上的，小桃，去炖一只鸡，今天咱们吃好的。", 1118, 0, "夫人")
		say("是，夫人。", 1110, 1, "丫鬟")
		dark()
		addevent(128, 124, 1, 0, 1, 10602, -2, -2)
		light()
		addtime(2)
		say("2天后...", 0, 2)

		if JY.Person[0].门派 == 21 then
			if JY.Person[0].门派等级 < 24 then
				say("孩子,我知道你加入了野狗帮，以后不要去了，和他们瞎混没有好处。", 1052, 1, "铁捕头")
				say("是啊，赶快退出这个什么野狗帮吧，叫什么不好，叫野狗帮，我的孩子是野狗吗？", 1118, 0, "夫人")
				say("...", 0, 1)

				if yesno("要退出野狗帮吗？") then
					JY.Person[0].门派 = 0
					JY.Person[0].门派等级 = 0
					JY.Person[0].门派贡献 = 0

					say("退出就好，我就说整天跟小混混在一起不会有出息的。", 1118, 0, "夫人")
					say("孩儿,我已经办好了，从今天开始你就是官府登记的正式童生了，以后走文职，一路升官发财，一定会比老爹厉害的。", 1052, 1, "铁捕头")
					say("文职好，文职好，今后不要打打杀杀的，免得哪天被人砍了。", 1118, 0, "夫人")
					say("过一阵就是秀才考试，你要准备好，我已经走了门路，将你安排进了州府学堂，幸好爹还有点面子，那可是福州有名的高老师任教。", 1052, 1, "铁捕头")
					say("真的要我考秀才？", 0, 1)
					say("高老师好，听说他还教出过举人呢，孩子啊，这是为你好，听娘的啊，进去好好学习，娘每顿都给你炖一只老母鸡补身体。", 1118, 0, "夫人")
					say("...", 0, 1)
					say("孩儿啊,这些年爹对不起你，一定会让你以后一路都顺顺当当的，爹上班去了，你要好好学习。", 1052, 0, "铁捕头")
					dark()
					null(128, 124)
					light()
					say("...", 0, 1)
					say("孩子，看书去吧，不过也不要着急，今年考不上，还有明年呢。", 1118, 0, "夫人")

					JY.Person[0].官阶 = 1
				else
					say("我还不想退出。", 0, 1)
					say("这孩子，怎么不听话呢？", 1118, 0, "夫人")
					say("混帮派有什么好的？不要学人打打杀杀的，你老爹就是例子，没有前途的。", 1052, 0, "铁捕头")
					say("...", 0, 1)
					say("我，真是气死我了。", 1052, 0, "铁捕头")
					say("他爹，别着急，等我在劝劝孩子。", 1118, 1, "夫人")
					say("我上班去了。", 1052, 0, "铁捕头")
					dark()
					null(128, 124)
					light()
					say("...", 0, 1)
					say("孩子，爹娘也是为你好，学武不讨好的，还危险，当年要不是你爹学武，你也不会被仇人劫走了。", 1118, 0, "夫人")
					say("当年是谁把我劫走的？", 0, 1)
					say("不知道啊，你爹是个死性子，他当捕头以后，兢兢业业的，也不知道抓了多少江洋大盗，谁都有可能。", 1118, 0, "夫人")
					say("...", 0, 1)
					say("我出去一趟，办点事。", 0, 1)
					say("小心点啊，哎。", 1118, 0, "夫人")
				end
			else
				say("哎，事情没办成。孩子,我知道你加入了野狗帮，可我没想到你在野狗帮做到了高层，你已经在州府挂上号了，洗不白了。", 1052, 1, "铁捕头")
				say("没事的，没事的，咱们孩子年纪轻轻就在州府挂号，说明他有能耐啊。", 1118, 0, "夫人")
				say("妇人之见，我再找找人。最近你就不要和帮派里的人混了，在家多看看书，总会有办法的。", 1052, 1, "铁捕头")
				say("你又要出去啊？", 1118, 0, "夫人")
				say("府衙还有事，我得去看看。", 1052, 1, "铁捕头")
				dark()
				null(128, 124)
				light()
				say("真是的，一个副捕头，一天到晚比知府大人还忙。", 1118, 0, "夫人")
				say("孩子，你别着急，你爹会找到路子的。", 1118, 0, "夫人")
			end
		else
			say("孩儿,事情办成了，从今天开始你就是官府登记的正式童生了，以后走文职，一路升官发财，一定会比老爹厉害的。", 1052, 0, "铁捕头")
			say("文职好，文职好，今后不要打打杀杀的，免得哪天被人砍了。", 1118, 1, "夫人")
			say("过一阵就是秀才考试，你要准备好，我已经走了门路，将你安排进了州府学堂，幸好爹还有点面子，那可是福州有名的名士任教。", 1052, 0, "铁捕头")
			say("真的要我考秀才？", 0, 1)
			say("州府学堂啊，听说这里出过好几位进士呢，孩子啊，这是为你好，听娘的啊，进去好好学习，娘每顿都给你炖一只老母鸡补身体。", 1118, 0, "夫人")
			say("...", 0, 1)
			say("孩儿啊,这些年爹对不起你，一定会让你以后一路都顺顺当当的，爹回府衙去了，你要好好学习。", 1052, 0, "铁捕头")
			dark()
			null(128, 124)
			light()
			say("...", 0, 1)
			say("孩子，看书去吧，不过也不要着急，今年考不上，还有明年呢。", 1118, 0, "夫人")

			JY.Person[0].官阶 = 1

			null(128, 46)
			null(128, 48)
			null(128, 49)
		end

		addevent(128, 21, 1, 8811, 1, 10312, -2, -2)
		addevent(128, 24, 1, 8812, 1, 10336, -2, -2)
	end
end
OEVENTLUA[8811] = function ()
	Cls()

	local var_46_0 = Rnd(100)

	if JY.Person[0].性别 == 1 then
		say("我儿回来了，你跑哪儿去了。", 1118, 0, "夫人")
		say("娘，我外面转了转。", 0, 1)
		say("孩子呀，听娘的，不要老往外面跑，外面坏人多。", 1118, 0, "夫人")

		if var_46_0 > 80 and has_something(174, 1000) == false then
			say("孩儿，身上又没钱了吗？来，娘这儿还有。", 1118, 0, "夫人")
			addthing(174, 5)
		elseif var_46_0 < 50 then
			say("孩儿，饿了吗？娘刚炖了一只老母鸡，你快去吃，还热着呢。", 1118, 0, "夫人")
		else
			say("孩儿，累了吗，累了就多睡睡，睡觉多皮肤好。", 1118, 0, "夫人")
		end

		return
	end

	if JY.Person[0].官阶 == 5 then
		say("我儿回来了，累着了吧。", 1118, 0, "夫人")
		say("娘，我不累。", 0, 1)
		say("见着皇帝了吗？", 1118, 0, "夫人")
		say("没有，出来的是曹太师。", 0, 1)
		say("可惜，没让皇帝看见孩儿，要不一定留下你当驸马。", 1118, 0, "夫人")
		say("娘，没有的事。", 0, 1)
		dark()
		addevent(128, 124, 1, 0, 1, 10590, -2, -2)
		light()
		say("我回来了。", 1052, 0, "铁捕头")
		say("对了，你爹升任福州府总捕头了，这下咱们家出了两个大官，看邻里的媳妇大姨还敢编排咋们家老实好欺负不？", 1118, 0, "夫人")
		say("爹，你升官了？", 0, 1)
		say("升官了，可不是什么好事。", 1052, 0, "铁捕头")
		say("上个月总兵带人进山剿匪，结果大败而回，回来就被免职了，总捕头也在剿匪时被杀，现在府衙里乱得不行，知州大人都发了好几次火了。", 1052, 0, "铁捕头")
		say("原来是这样。", 0, 1)
		say("孩子，你刚进入仕途，一切要小心为上，万不可年少娇狂得罪了人。", 1052, 0, "铁捕头")
		say("知道了。", 0, 1)
		say("赶快吃饭吧，一会我还得回去。", 1052, 0, "铁捕头")
		say("你呀，就是这么拼命，有什么用，身体是自己的，多休息休息才好。", 1118, 0, "夫人")
		say("妇道人家懂什么。", 1052, 0, "铁捕头")
		dark()
		null(128, 124)
		light()
		say("孩子，吃饱了吗？", 1118, 0, "夫人")
		say("娘，我吃饱了。", 0, 1)
		addevent(128, 21, 1, 8815, 1, 10312, -2, -2)
	elseif JY.Person[0].官阶 == 4 then
		say("娘，我考中进士了。", 0, 1)
		say("我儿真是有出息了，呜呜呜...", 1118, 0, "夫人")
		say("小桃，快去叫老爷回来。", 1118, 0, "夫人")
		say("是，夫人。", 1110, 1, "丫鬟")
		dark()
		addevent(128, 124, 1, 0, 1, 10590, -2, -2)
		light()
		say("好孩子，有出息。", 1052, 0, "铁捕头")
		say("晚上咱们办席，将街坊邻居都请来，给孩子庆贺。", 1052, 0, "铁捕头")
		dark()
		addevent(129, 128, 1, -2, 1, 10594)
		light()
		say("恭喜铁捕头，恭喜夫人。", 1250, 1, "捕快")
		say("小李子啊，晚上我们请客，你也来啊。", 1052, 0, "铁捕头")
		say("一定一定，学正大人有令，本府今年考中3位进士，这就带去进京面圣。", 1250, 1, "捕快")
		say("啊？面圣？", 1052, 0, "铁捕头")
		say("不错，大喜啊，铁捕头。", 1250, 1, "捕快")
		say("面圣啊，快快，孩子他娘，快给孩子准备几套好衣服，多备点干粮。", 1052, 0, "铁捕头")
		say("好好好，小桃，快跟我来。", 1118, 0, "夫人")
		dark()
		null(128, 124)
		null(128, 129)
		My_Enter_SubScene(123, 29, 21, 0)
		null(123, 68)
		null(123, 59)
		addevent(123, 82, 1, 0, 1, 10394, -2, -2)
		addevent(123, 78, 1, 0, 1, 10612, -2, -2)
		addevent(123, 68, 1, 0, 1, 10610, -2, -2)
		addevent(123, 69, 1, 0, 1, 7150, -2, -2)
		addevent(123, 70, 1, 0, 1, 7150, -2, -2)
		addevent(123, 71, 1, 0, 1, 7150, -2, -2)
		addevent(123, 72, 1, 0, 1, 7150, -2, -2)
		addevent(123, 73, 1, 0, 1, 7150, -2, -2)
		addevent(123, 75, 1, 0, 1, 7150, -2, -2)
		addevent(123, 76, 1, 0, 1, 7150, -2, -2)
		addevent(123, 77, 1, 0, 1, 7150, -2, -2)
		addevent(123, 84, 1, 0, 1, 7150, -2, -2)
		addevent(123, 85, 1, 0, 1, 7150, -2, -2)
		light()
		addtime(30)
		say("奉天承运，皇帝诏曰，尔等皆是我朝有为之士，今特令曹太师代朕封赏，尔等皆有重用，望尔等以后可励精图治，保境安民。钦此。", 1254, 0, "老太监")
		say("各位，还不拜见曹太师。", 1254, 0, "老太监")
		say("我等拜见曹太师", 0, 2)
		say("免礼免礼。", 1140, 0, "曹公公")

		if JY.Person[742].好感度 >= 55 then
			say("（这不是那个红衣老人吗？居然是曹太师，福气啊，抱上大粗腿了，哈哈哈）", 0, 1)
		end

		say("今日我来，是代圣上选贤任能，你们的身世来历，学问名声，我都已经知道，现在宣布考察结果，第一名，今科状元是，锦州淮北道的李培申，任翰林院学士，正四品。", 1140, 0, "曹公公")
		say("第二名，当今解元是相州兰里城的陈思涵，任翰林院学士，副四品。第三名...。", 1140, 0, "曹公公")
		dark()
		light()
		say("第四百四十八名，是福州的" .. JY.Person[0].姓名 .. "，任福州州府参知，正九品。", 1140, 0, "曹公公")

		JY.Person[0].官阶 = 5
		JY.Person[0].宋罪恶值 = 0

		say("好了，大伙儿这就各去派地任职吧，做官与做学问不同，各位切记要踏实勤勉做事。", 1140, 0, "曹公公")
		say("是，我等谨记", 0, 2)
		say("各位，随我出宫。", 1254, 0, "老太监")
		say("是，多谢曹太师", 0, 2)
		dark()
		null(123, 68)
		null(123, 69)
		null(123, 70)
		null(123, 71)
		null(123, 72)
		null(123, 73)
		null(123, 75)
		null(123, 76)
		null(123, 77)
		null(123, 78)
		null(123, 82)
		null(123, 84)
		null(123, 85)
		My_Enter_SubScene(123, 42, 50, 1)
		light()
		say("怎么回事，其他进士都有各地官员来接，福州的官员怎么没到？", 0, 1)
		say("搞什么鬼？", 0, 1)

		if JY.Person[742].好感度 >= 55 then
			dark()
			addevent(123, 21, 1, 0, 1, 5928, -2, -2)
			light()
			say("年轻人，你就是福州的" .. JY.Person[0].姓名 .. "？", 1142, 0, "曹公公信使")
			My_Enter_SubScene(123, 42, 50, 0)
			say("你是？", 0, 1)
			say("我是太师门下葛参事，太师有事在身，无暇见你，特令我传一句话与你。", 1142, 0, "曹公公信使")
			say("请说。", 0, 1)
			say("太师让你好好做事，他都已安排好了。记住，不要让太师失望。", 1142, 0, "曹公公信使")
			say("是，晚辈知会的。", 0, 1)
			say("很好，相信我们还有再见的一天。", 1142, 0, "曹公公信使")
			dark()
			null(123, 21)
			addevent(128, 98, 1, 8820, 1, 10432, -2, -2)
			addevent(128, 133, 1, 12816, 1, 9392, -2, -2)
			addevent(128, 134, 1, 12816, 1, 9392, -2, -2)
			addevent(128, 135, 1, 12816, 1, 9392, -2, -2)
			addevent(128, 136, 1, 12816, 1, 9392, -2, -2)
			light()
		end
	elseif JY.Person[0].官阶 == 3 then
		say("娘，我考中举人了。", 0, 1)
		say("我儿真是有出息，比你那老爹强。", 1118, 0, "夫人")

		if var_46_0 > 90 then
			dark()
			addevent(128, 124, 1, 0, 1, 10590, -2, -2)
			light()
			say("好孩子，好好好，有了功名在身，以后做什么都高人一等，不枉爹给你这么费心。", 1052, 0, "铁捕头")
			say("你整天在外面跑，哪里管咱们孩子了？现在孩子考上了，你才知道来关心一下。", 1118, 0, "夫人")
			say("呵呵呵，夫人说得是。城西又出了命案，我一会还得看看去，咱们赶快吃饭吧。", 1052, 0, "铁捕头")
			say("你呀。", 1118, 0, "夫人")
			dark()
			null(128, 124)
			light()
		end

		say("好孩子，做官啊，靠的就是同窗帮衬，你多和他们来往来往，对以后有好处。", 1118, 0, "夫人")
		say("可惜咱们家里穷，帮不上你多少。", 1118, 0, "夫人")
		say("娘，我不用。", 0, 1)
		say("都是你爹不争气，还是我的孩儿最乖又能干。", 1118, 0, "夫人")
	elseif JY.Person[0].官阶 == 2 and JY.Person[741].好感度 ~= 20 then
		say("娘，我考中秀才了。", 0, 1)
		say("好孩子，我就知道你能行的。", 1118, 0, "夫人")
		say("小桃，去炖一只老母鸡，加点人参，给孩子补补。", 1118, 0, "夫人")
		say("是，夫人。", 1110, 1, "丫鬟")
		dark()
		addevent(128, 124, 1, 0, 1, 10590, -2, -2)
		light()
		say("好孩子，有出息，以后做官就对了，可不能学爹，整天辛劳拼命，结果还得看人眼色。", 1052, 0, "铁捕头")
		say("哎呀，孩子还小，说这些干什么？", 1118, 1, "夫人")
		say("我前一阵找门路结识了方司正，方司正与张学政乃是同窗，趁着今日大喜，我带孩子去认个脸，以后请学政大人多多关照。", 1052, 0, "铁捕头")
		say("不吃晚饭啦？", 1118, 1, "夫人")
		say("回来吃，回来吃。", 1052, 0, "铁捕头")
		dark()
		My_Enter_SubScene(128, 5, 53, 3)
		addevent(128, 131, 1, 0, 1, 9392, -2, -2)
		addevent(128, 132, 1, 0, 1, 10592, -2, -2)
		light()
		say("下官拜见司正大人。", 1052, 0, "铁捕头")
		say("原来是铁捕头，这位是？", 1026, 1, "方司正")
		say("这是我家孩儿，今次刚考中了秀才。", 1052, 0, "铁捕头")
		say("孩子，快快拜见司正大人。", 1052, 0, "铁捕头")
		say("是，拜见司正大人。", 0, 1)
		say("唔，好。铁捕头，你这是？", 1026, 0, "方司正")
		say("听说司正大人和学政大人乃是同窗，想请司正大人与学政大人美言几句，照顾一下我家孩子。", 1052, 1, "铁捕头")
		say("唔。", 1026, 0, "方司正")
		say("铁捕头，张学政你是知道的，他的门路可不好走，门槛很高的，我说话只怕不管用啊。", 1026, 0, "方司正")
		say("那是那是，我这些年来也积攒了一些银子，烦请司正大人帮一下忙。", 1052, 1, "铁捕头")
		say("唔，你这才一千多两啊？这哪够走门路的？最少也得五千两，或许能成。", 1026, 0, "方司正")
		say("这...。", 1052, 1, "铁捕头")

		if instruct_31(5000) == false then
			say("司正大人，这个，能不能想其他的法子？", 1052, 1, "铁捕头")
			say("舍不得出钱不是？下次举人考试他可是出题官之一，你以为五千两银子够使的？你们这些捕快，平时不知捞了多少进账，这点钱能没有？", 1026, 0, "方司正")
			say("大人，我这真的不够啊。", 1052, 1, "铁捕头")
			say("那就算了，慢走不送。", 1026, 0, "方司正")
			say("司正大人，这关系我孩子以后的前程，还请帮忙，也许有其他的法子？", 1052, 1, "铁捕头")
			say("铁捕头啊，有的话我就帮你了，真没有啊，你们走吧，就当咱们今天没有见过面。", 1026, 0, "方司正")
			say("爹，你放心，我一定能考上的。", 0, 1)
			say("哎，孩子，你先回去吧，我府衙还有点事，回去不要和你娘说，免得她担心。", 1052, 1, "铁捕头")
			dark()
			My_Enter_SubScene(128, 32, 37, 0)
			null(128, 131)
			null(128, 132)
			light()
			Cls()

			return
		end

		say("爹，我这儿有。", 0, 1)
		say("你从哪儿得到这么多钱？", 1052, 1, "铁捕头")
		say("这些就够了，好了，下次直接来考举人吧，放心，一定能过。", 1026, 0, "方司正")
		say("多谢大人。", 0, 1)
		instruct_32(174, -5000)

		JY.Person[741].好感度 = 20

		say("孩子，这钱，你可不能花黑心钱啊。", 1052, 1, "铁捕头")
		say("爹，你就放心吧。", 0, 1)
		say("你这孩子真懂事。", 1026, 0, "方司正")
		say("哎，孩子，你先回去吧，我和司正大人再说点事。", 1052, 1, "铁捕头")
		say("好。", 0, 1)
		dark()
		My_Enter_SubScene(128, 32, 37, 0)
		null(128, 131)
		null(128, 132)
		light()
	elseif var_46_0 == 50 and has_something(174, 100) then
		say("孩儿，身上又没钱了吗？来，娘这儿还有。", 1118, 0, "夫人")
		addthing(174, 5)
	elseif var_46_0 < 50 then
		say("孩儿，饿了吗？娘刚炖了一只老母鸡，你快去吃，还热着呢。", 1118, 0, "夫人")
	else
		say("孩儿，累了吗，累了就多睡睡，记着什么事都不要着急，别学你爹，整天风风火火的，总会办好的。", 1118, 0, "夫人")
	end
end
OEVENTLUA[8812] = function ()
	Cls()

	local var_47_0 = 0
	local var_47_1 = JY.Person[0].性别 == 1 and "小姐" or "小少爷"

	say(var_47_1 .. "，自从你回来后，夫人精神都好很多了。", 1110, 0, "丫鬟")
end
OEVENTLUA[8815] = function ()
	Cls()

	if JY.Person[0].官阶 > 10 then
		say("娘，爹不是升任知州了吗？怎么还住在这小屋子的？", 0, 1)
		say("我儿终于回来了，咱们没搬家，住惯这儿了，左右街坊都熟，去大宅子反而冷清。", 1118, 0, "夫人")
		say("小桃，快去把炖好的鸡汤盛一碗过来。", 1118, 0, "夫人")
		say("娘，先不忙。", 0, 1)
		say("爹呢？怎么不在家？", 0, 1)
		say("你爹做了那什么知州，更是忙的脚不沾地。", 1118, 0, "夫人")
		say("（爹娘都是实诚人啊）", 0, 1)
		say("娘，我在京城做大官了，你和爹都随我进京享福去吧。", 0, 1)
		say("我儿果然是有出息，京城我们就不去了，那儿都是大官，咱们待不惯。", 1118, 0, "夫人")
		say("娘，我不小心做了最大的官，你们到那儿谁都不敢欺负的。", 0, 1)
		say("最大的官？", 1118, 0, "夫人")
		say("我现在是皇帝了。", 0, 1)
		say("啥？", 1118, 0, "夫人")
		say("我儿你不是发烧了吧，小桃，快去叫老爷回来，不，先去叫医生。", 1118, 0, "夫人")
		say("哎，我说的是真的，小桃，去叫爹回来，这个什么知州也别做了，到京城做太上皇去。", 0, 1)
		say("是，少爷。", 1110, 1, "丫鬟")
		dark()
		light()
		say("还不去。", 0, 1)
		say("是，是（少爷这是发疯了）", 1110, 1, "丫鬟")
		dark()
		null(-2, 21)
		null(-2, 24)
		addevent(123, 40, 0, 0, 0, 10286, -2, -2)
		addevent(123, 41, 0, 0, 0, 10314, -2, -2)
		null(123, 6)
		null(123, 38)
		null(123, 39)
		null(123, 40)
		null(123, 41)
		null(123, 42)
		null(123, 43)
		null(123, 44)
		null(123, 45)
		null(123, 46)
		light()
		addtime(30)
		My_Enter_SubScene(123, 50, 23, 0)
		say("爹，娘，到了，以后这就是咱们的家。", 0, 1)
		say("这就是皇宫啊？真是富丽堂皇啊。", 1118, 0, "夫人")
		say("我儿啊，你既然做了皇帝，可要顾念天下百姓，让大家都过太平日子。", 1052, 1, "铁捕头")
		say("是，爹。", 0, 1)
		say("爹，娘，你们也累了，先行休息，孩儿晚点再过来。", 0, 1)
		say("也好，你去忙你的去吧。", 1052, 1, "铁捕头")
		dark()
		null(-2, 40)
		null(-2, 41)
		My_Enter_SubScene(123, 50, 43, 3)
		addevent(123, 52, 1, 8816, 1, 10286, -2, -2)
		addevent(123, 47, 1, 8817, 1, 10314, -2, -2)
		addevent(123, 38, 1, 8818, 1, 10336, -2, -2)
		light()
	else
		say("我儿回来了，累着了吧。", 1118, 0, "夫人")
		say("娘，我不累。", 0, 1)
		say("小桃，快去把炖好的鸡汤盛一碗过来。", 1118, 0, "夫人")
		say("是，夫人。", 1110, 1, "丫鬟")
		dark()
		light()
		say("孩儿，休息一觉再回去吧。", 1118, 0, "夫人")
		say("好。", 0, 1)
		dark()
		instruct_12()
		light()
	end
end
OEVENTLUA[8816] = function ()
	Cls()
	say("我最近和刑部的老方在研究完善刑法，儿啊，爹也帮你一把。", 1052, 1, "铁捕头")
	say("多谢爹爹。", 0, 1)
end
OEVENTLUA[8817] = function ()
	Cls()
	say("我儿回来了，累着了吧。", 1118, 0, "夫人")
	say("娘，我不累。", 0, 1)
	say("小桃，快去把炖好的鸡汤盛一碗过来。", 1118, 0, "夫人")
	say("是，夫人。", 1110, 1, "丫鬟")
	dark()
	light()
	say("孩儿，休息一觉再去忙吧。", 1118, 0, "夫人")
	say("好。", 0, 1)
end
OEVENTLUA[8818] = function ()
	Cls()
	say("参见皇上。", 1110, 1, "丫鬟")
	say("小桃，在家里不用客气，还叫我少爷就好。", 0, 1)
	say("小桃不敢。", 1110, 1, "丫鬟")
end
OEVENTLUA[8820] = function ()
	Cls()
	say("拜见府台大人。", 0, 1)
	say("你就是铁捕头那个孩子，好好好，果然有出息。", 1029, 1, "知府大人")
	say("府学房还缺一个人，正好，你去了好好锻炼锻炼，不要让你爹失望啊。", 1029, 1, "知府大人")
	say("是。", 0, 1)
	say("去吧，到府学后堂找方司正，他会给你安排的。", 1029, 1, "知府大人")
	say("是，多谢府台大人。", 0, 1)
	dark()
	null(-2, 98)
	null(-2, 130)
	addevent(128, 131, 1, 8821, 1, 9392, -2, -2)
	light()
end
OEVENTLUA[8821] = function ()
	Cls()
	say("末学后辈拜见司正大人。", 0, 1)
	say("好小子，我就知道铁家的小子不简单，没想到这么快就进入仕途了。", 1026, 0, "方司正")
	say("还请司正大人多多关照。", 0, 1)
	say("府学房都是一些文案工作，你先在这里锻炼锻炼，好好表现，以后有的是进步的机会。", 1026, 0, "方司正")
	say("是。", 0, 1)
	say("那个位置，都给你安排好了，年轻人，好好干吧。", 1026, 0, "方司正")
	say("是，我会努力的，司正大人。", 0, 1)
	dark()
	My_Enter_SubScene(128, 8, 48, 0)
	light()
	addtime(30)
	instruct_27(-1, 5974, 5982)
	say("哎，总算理清头绪了，该出去走走了，得换换脑子。", 0, 1)

	JY.Person[741].好感度 = JY.Person[741].好感度 + 1

	dark()
	My_Enter_SubScene(128, 32, 37, 0)
	addevent(128, 131, 1, 8822, 1, 9392, -2, -2)
	addevent(128, 98, 1, 8825, 1, 10432, -2, -2)
	light()
end
OEVENTLUA[8822] = function ()
	Cls()
	say("拜见司正大人。", 0, 1)
	say("年轻人，把这些资料整理好，好好干，我看好你。", 1026, 0, "方司正")
	say("是，我会努力的，司正大人。", 0, 1)
	dark()
	My_Enter_SubScene(128, 8, 48, 0)
	light()
	addtime(30)
	instruct_27(-1, 5974, 5982)
	say("哎，总算理清头绪了，该出去走走了，得换换脑子。", 0, 1)

	JY.Person[741].好感度 = JY.Person[741].好感度 + 1

	dark()
	My_Enter_SubScene(128, 32, 37, 0)
	light()
end
OEVENTLUA[8825] = function ()
	Cls()

	if JY.Person[742].好感度 >= 55 then
		say("拜见府台大人。", 0, 1)
		say("你这个孩子，你在京城有人怎么不早说，这多耽误人才。", 1029, 0, "知府大人")
		say("我", 0, 1)
		say("我身边还缺一个人，你先跟着我，做一下情报收集和归拢工作，可以出外勤。", 1029, 0, "知府大人")
		say("是，多谢府台大人。", 0, 1)
		say("给你配两伍精兵，来人！", 1029, 0, "知府大人")
		dark()
		addevent(128, 137, 1, 0, 1, 10064, -2, -2)
		addevent(128, 138, 1, 0, 1, 10064, -2, -2)
		light()
		say("拜见大人。", 1255, 1, "官军")
		say("这是新任参知大人，以后就是你们的直属上司，记住了吗？", 1029, 0, "知府大人")
		say("是，拜见参知大人。", 1255, 1, "官军")
		say("唔，那个，大家好。", 0, 1)
		say("年轻人，好好干，这些对你以后发展大有好处，以后发达了可别忘记我啊。", 1029, 0, "知府大人")
		say("下官理会的，多谢大人关照。", 0, 1)
		say("呵呵呵，好好好，和你的新下属多熟悉熟悉。", 1029, 0, "知府大人")
		say("福州道和扬州道近期匪患严重，你给我去查查是不是连云寨哪些盗匪又出了什么幺蛾子，有情况就报上来。", 1029, 0, "知府大人")
		say("是，大人。", 0, 1)
		dark()
		null(-2, 98)
		instruct_40(1)
		light()
		say("大人，你有什么安排？", 1255, 0, "官军")
		say("你们之前都是做什么的？", 0, 1)
		say("禀大人，我们之前主要就是训练，然后巡逻。", 1255, 0, "官军")
		say("有人上过战场吗？", 0, 1)
		say("有，我们几个伍长都上过战场。", 1255, 0, "官军")
		say("很好，你们接着抓紧训练，另外，分批在我家周围值守，有什么消息来找我报告。", 0, 1)
		say("是，大人。大人，不用我们安排几个人保护你吗？", 1255, 0, "官军")
		say("不用，都去吧。", 0, 1)
		say("是，大人。", 1255, 0, "官军")
		dark()
		null(-2, 137)
		null(-2, 138)
		addevent(128, 139, 1, 8826, 1, 10060, -2, -2)
		null(-2, 131)
		addevent(128, 98, 1, 8833, 1, 10432, -2, -2)
		addevent(128, 137, 1, 12810, 1, 10600, -2, -2)
		addevent(128, 143, 1, 12810, 1, 10600, -2, -2)
		addevent(128, 141, 1, 12810, 1, 10596, -2, -2)
		addevent(128, 142, 1, 12810, 1, 10596, -2, -2)
		addevent(69, 141, 1, 8830, 1, 9170, -2, -2)
		addevent(69, 142, 1, 8830, 1, 10272, -2, -2)
		light()
	elseif JY.Person[741].好感度 >= 60 then
		say("拜见府台大人。", 0, 1)
		say("是你啊，铁家的孩子，你勤勉可嘉，忠诚可靠，我身边还缺一个人，你先来做一下情报收集工作，多出外打探一下消息然后回报给我。", 1029, 0, "知府大人")
		say("不知大人要哪方面的消息？", 0, 1)
		say("福州道和扬州道近期匪患严重，你给我去查查是不是连云寨哪些盗匪又出了什么幺蛾子，有情况就报上来。", 1029, 0, "知府大人")
		say("这些可恶的土匪，我一定要剿灭了他们。", 1029, 0, "知府大人")
		say("是，府台大人。", 0, 1)
		say("给你配两伍精兵，给我好好干，来人！", 1029, 0, "知府大人")
		dark()
		addevent(128, 137, 1, 0, 1, 10064, -2, -2)
		addevent(128, 138, 1, 0, 1, 10064, -2, -2)
		light()
		say("拜见大人。", 1255, 1, "官军")
		say("这是新任参知大人，以后就是你们的直属上司，记住了吗？", 1029, 0, "知府大人")
		say("是，拜见参知大人。", 1255, 1, "官军")
		say("唔，那个，大家好。", 0, 1)
		say("年轻人，好好干，我等待你的汇报。", 1029, 0, "知府大人")
		say("是，大人。", 0, 1)
		dark()
		null(-2, 98)
		light()
		say("大人，你有什么安排？", 1255, 0, "官军")
		say("你们之前都是做什么的？", 0, 1)
		say("禀大人，我们之前主要就是训练，然后巡逻。", 1255, 0, "官军")
		say("有人上过战场吗？", 0, 1)
		say("有，我们几个伍长都上过战场。", 1255, 0, "官军")
		say("很好，你们接着抓紧训练，另外，分批在我家周围值守，有什么消息来找我报告。", 0, 1)
		say("是，大人。大人，不用我们安排几个人保护你吗？", 1255, 0, "官军")
		say("不用，都去吧。", 0, 1)
		say("是，大人。", 1255, 0, "官军")
		dark()
		null(-2, 137)
		null(-2, 138)
		addevent(128, 139, 1, 8826, 1, 10060, -2, -2)
		null(-2, 131)
		addevent(69, 141, 1, 8830, 1, 9170, -2, -2)
		addevent(69, 142, 1, 8830, 1, 10272, -2, -2)
		light()
	else
		say("这帮毛贼，真是让人心烦啊。", 1029, 1, "知府大人")
		say("府台大人好。", 0, 1)
		say("去去去，别来烦我。", 1029, 1, "知府大人")
		say("是，下官告退。", 0, 1)
	end
end
OEVENTLUA[8826] = function ()
	Cls()
	say("大人，你回来了？", 1255, 0, "官军")
	say("有什么事没有？", 0, 1)
	say("大人，一切安好。", 1255, 0, "官军")
	say("唔，好。", 0, 1)
end
OEVENTLUA[8830] = function ()
	Cls()
	say("少爷，我要回家了，你放过我吧。", 510, 0, "美女")
	say("美女，把面巾摘了，让我先看看你的俏模样，如何？", 1012, 1, "官二代")
	say("臭流氓，快让开。", 510, 0, "美女")
	say("美女，天色还早呢，你这什么急啊？不如随我回家我慢慢陪你玩？", 1012, 1, "官二代")
	say("你再不让开，我就喊救命了啊。", 510, 0, "美女")
	say("你喊啊，喊啊，我舅舅就是扬州总兵大人，你就算喊也没用。", 1012, 1, "官二代")
	say("哎，那个。", 0, 1)
	say("什么事？", 1012, 0, "官二代")
	say("其实她喊还是有用的，我就听见了。", 0, 1)
	say("你？不想死就滚开，滚远一点。", 1012, 0, "官二代")
	say("其实我也不是非要管，只是你穿这么华丽的衣服，还拿一把破扇子扇啊扇的装潇洒，让我看了就生气，你实在是不该出来碍我眼的。", 0, 1)
	say("找死，来人！给我把他抓起来。", 1012, 0, "官二代")

	if WarMain(551, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("你等着，我去叫我舅舅来。", 1012, 0, "官二代")
	say("等等。", 0, 1)
	say("啊？", 1012, 0, "官二代")
	say("我讨厌搬救兵的人，所以，死吧！", 0, 1)
	say("不~", 1012, 0, "官二代")
	dark()
	addevent(69, 142, 1, 0, 1, 5434, -2, -2)
	addevent(69, 140, 1, 0, 1, 8468, -2, -2)
	addevent(69, 94, 1, 0, 1, 10292, -2, -2)
	light()
	say("青妹，我没来晚吧。", 1077, 1, "牛王爷")
	say("哼，等你来了黄花菜也凉了，幸亏有这位" .. JY.Person[0].称呼 .. "在。", 510, 0, "美女")
	say("多谢" .. JY.Person[0].称呼 .. "相助。", 1077, 1, "牛王爷")
	say("晚青师妹，我和小王爷去查了一下粮草失踪的案子，你不要怪他。", 1018, 0, "诸葛向南")
	say("（小王爷？难道是哪位王爷出府来玩耍来了？）", 0, 1)
	say("哼，回去再和你们算账。", 510, 0, "美女")
	say(JY.Person[0].称呼 .. "，你杀了扬州总兵的侄子，只怕对你以后仕途大大不利啊。", 1077, 1, "牛王爷")
	say("仕途？你认识我？", 0, 1)
	say("啊？不认识，不认识，不过我听说过福州新出了一位俊杰，今日一见果然不凡。", 1077, 1, "牛王爷")
	say("牛兄客气了。", 0, 1)
	say(JY.Person[0].称呼 .. "，我还有事要办，今日的人情我记住了，他日必定相报，告辞。", 1077, 1, "牛王爷")
	dark()
	null(-2, 94)
	null(-2, 140)
	null(-2, 141)
	light()
	say("走这么快，还得我来善后，真是。", 0, 1)
	dark()
	null(-2, 142)
	light()
	say("我也赶快走吧，免得麻烦。", 0, 1)

	JY.Person[554].好感度 = 60
	JY.Person[0].宋罪恶值 = JY.Person[0].宋罪恶值 + 5

	addevent(116, 8, 0, 8831, 3, -2, -2, -2)
	addevent(116, 9, 1, 0, 1, 8468, -2, -2)
	addevent(116, 10, 1, 0, 1, 10292, -2, -2)
	addevent(116, 11, 1, 0, 1, 10064, -2, -2)
	addevent(116, 12, 1, 0, 1, 10064, -2, -2)
	addevent(116, 13, 1, 0, 1, 10064, -2, -2)
	addevent(116, 14, 1, 0, 1, 10098, -2, -2)
	addevent(116, 15, 1, 0, 1, 10098, -2, -2)
end
OEVENTLUA[8831] = function ()
	Cls()
	dark()
	null(-2, 8)
	light()
	say("牛兄弟，你们这是？", 0, 1)
	say("大人？我说怎么走漏了消息，原来是你。", 1255, 0, "官军")
	say("我？", 0, 1)
	say(JY.Person[0].称呼 .. "，咱们先将这些官兵拿下再说。", 1077, 1, "牛王爷")
	say("这", 0, 1)

	if yesno("要和牛兄弟一起动手么？") == true then
		say("好兄弟，咱们上。", 1077, 1, "牛王爷")

		if WarMain(552, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		dark()
		null(-2, 11)
		null(-2, 13)
		My_Enter_SubScene(116, 40, 41, 3)
		light()

		JY.Person[554].好感度 = 65

		say("别杀我，别杀我，我什么都不知道。", 1255, 0, "官军")
		say("什么都不知道？要你何用？给我杀了。", 1077, 1, "牛王爷")
		say("等等，别杀我，我说，这是知府大人安排下来的。", 1255, 0, "官军")
		say("什么？", 1077, 1, "牛王爷")
		say("牛兄弟，这是怎么回事？", 0, 1)
		say("可恶。" .. JY.Person[0].称呼 .. "，我们打探到有人倒卖粮食和军械给金国人，于是一路追查，没想到", 1077, 1, "牛王爷")
		say("是知府大人做的？怎么可能？你在说谎！", 0, 1)
		say("不敢不敢，兄弟们都在传是京里的大佬安排的此事，知府大人是实际执行人，其他就不知道了。", 1255, 0, "官军")
		say("大爷，你放我走吧。参知大人，放我走吧，我家里还有80老母，对了，她和你母亲也是认识的。", 1255, 0, "官军")
		say("这？", 0, 1)

		if yesno("要杀了此官军吗？") == true then
			say("哼，死！", 0, 1)
			say("啊~", 1255, 0, "官军")
			null(-2, 12)
			say("咱们正在和金国开战，没想到...", 0, 1)
			say("哼，卖国贼何其多，我总有一天杀尽这些狗官。", 1077, 0, "牛王爷")
			say("呃，" .. JY.Person[0].称呼 .. "，我不是说你啊。", 1077, 0, "牛王爷")
			say("...", 0, 1)
			say("你下来准备怎么办？", 1077, 1, "牛王爷")
			say("我先回去看看情况再说。", 0, 1)
			say("那你可得小心，不要轻举妄动，这种事情牵连一定不小。", 1077, 1, "牛王爷")
			say("哼。你不是什么王爷？难道没有办法？", 0, 1)
			say("呃，" .. JY.Person[0].称呼 .. "你误会了，我姓牛，人送外号牛王爷，可不是什么真的王爷。", 1077, 0, "牛王爷")
			say("...", 0, 1)
			say(JY.Person[0].称呼 .. "你放心，只要有我在，这条路上就没有军械粮草能偷运过去，你回去慢慢查就是。", 101, 0)
			say("也好。", 0, 1)
			say("兄弟们，咱们走，回山去也。", 1077, 0, "牛王爷")
			say("走了。", 1035, 0, "强盗")

			JY.Person[741].好感度 = 65

			dark()
			null(-2, 9)
			null(-2, 10)
			null(-2, 14)
			null(-2, 15)
			light()
		else
			say("多谢大人，多谢大人。", 1255, 0, "官军")
			null(-2, 12)
			say("兄弟，你真放他走啊。", 1077, 0, "牛王爷")
			say("怎么？", 0, 1)
			say("只怕他回去后会对你不利，你要小心一点。", 1077, 0, "牛王爷")
			say("他？怕他作甚。", 0, 1)
			say("呃，" .. JY.Person[0].称呼 .. "，你这次又帮了我大忙，以后有什么需要到连云山找我就是。", 1077, 0, "牛王爷")
			say("连云山？牛兄弟你到底是什么人？", 0, 1)
			say("兄弟们，咱们走，回山去也。", 1077, 0, "牛王爷")
			say("走了。", 1035, 0, "强盗")
			say("...", 0, 1)

			JY.Person[741].好感度 = 0

			dark()
			null(-2, 9)
			null(-2, 10)
			null(-2, 14)
			null(-2, 15)
			null(128, 21)
			null(128, 24)
			null(128, 124)
			null(128, 139)
			light()
		end
	else
		say("好大的胆子，居然敢和官军动手。", 0, 1)

		if WarMain(553, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		dark()
		null(-2, 14)
		null(-2, 15)
		My_Enter_SubScene(116, 40, 42, 1)
		light()
		say("大人，幸亏你及时赶到，不然这次这些盗匪就得逞了。", 1255, 0, "官军")
		say("牛兄弟，你是连云山的盗贼？", 0, 1)
		say("盗贼，我爷爷是岳飞账下牛皋是也，你说我是盗匪？哈哈哈哈哈", 1077, 0, "牛王爷")
		say("给我拿下他们。", 0, 1)
		say("是，大人。", 1255, 0, "官军")
		dark()
		null(-2, 9)
		null(-2, 10)
		My_Enter_SubScene(116, 40, 42, 2)
		light()
		say("你们这是运送的什么东西？怎么会被他们截住的。", 0, 1)
		say("禀大人，这是运送到前线的物质，咱们里面肯定有内鬼，不然消息不会泄露的。", 1255, 0, "官军")
		say("需要我护送你们再走一程吗？", 0, 1)
		say("不用不用，前面应该没有什么危险了。大人，此次的功劳我们会如实禀告知府大人的。", 1255, 0, "官军")
		say("唔。", 0, 1)

		JY.Person[741].好感度 = 61

		dark()
		null(-2, 11)
		null(-2, 12)
		null(-2, 13)
		null(101, 44)
		light()
	end

	addevent(128, 98, 1, 8833, 1, 10432, -2, -2)
	addevent(128, 137, 1, 12810, 1, 10600, -2, -2)
	addevent(128, 143, 1, 12810, 1, 10600, -2, -2)
	addevent(128, 141, 1, 12810, 1, 10596, -2, -2)
	addevent(128, 142, 1, 12810, 1, 10596, -2, -2)
end
OEVENTLUA[8833] = function ()
	Cls()

	if JY.Person[741].好感度 == 0 then
		say("好胆，你还敢回来，来人，给我拿下。", 1029, 0, "知府大人")

		if WarMain(554, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		say("居然还敢反抗，立即放下兵器投降，否则你的爹娘就要先你一步去了。", 1029, 0, "知府大人")
		say("卑鄙。", 0, 1)

		if yesno("你该如何抉择，要投降吗？") == true then
			say("给我拿下。", 1029, 0, "知府大人")
			say("可恶。", 0, 1)
			My_Enter_SubScene(128, 14, 39, 0)
			say("大人，已经绑上了，要如何处置？", 1255, 0, "官军")
			say("杀了杀了，将头给朝廷呈上去，和叛贼勾结，就是这个下场。", 1029, 0, "知府大人")
			say("是。（一刀挥下）", 1255, 0, "官军")
			say("噗~", 0, 1)
			instruct_15()
			Cls()

			return
		else
			say("可恶，我先杀了你！", 0, 1)
			say("你疯了，啊~", 1029, 0, "知府大人")
			dark()
			null(-2, 98)
			null(-2, 21)
			null(-2, 24)
			addevent(128, 139, 1, 8834, 1, 10602, -2, -2)
			light()
			say("抚台大人？抚台大人被杀了，抓住他，别让他跑了。", 1255, 0, "官军")
			dark()
			My_Enter_SubScene(116, 44, 31, 1)
			light()
			addtime(10)
			say("想抓我，你们做梦！", 0, 1)

			JY.Person[0].宋罪恶值 = 300
			JY.Person[0].官阶 = 0
			JY.Person[742].好感度 = 0
		end
	elseif JY.Person[0].官阶 == 5 and (JY.Person[741].好感度 >= 70 or JY.Person[741].好感度 >= 65 and JY.Person[742].好感度 >= 55) then
		say("参见大人。", 0, 1)
		say("打探到什么消息了吗？", 1029, 0, "知府大人")
		say("还没有。", 0, 1)
		say("废物！要你干什么吃的？这么点事都做不了。", 1029, 0, "知府大人")
		say("我", 0, 1)
		dark()
		addevent(128, 138, 1, 0, 1, 9390, -2, -2)
		light()
		say("福州知府何在？", 1251, 0, "巡抚")
		say("啊？巡抚大人，小人福州知府参见大人。", 1029, 1, "知府大人")
		say("你就是福州知府？左右，给我拿下。", 1251, 0, "巡抚")
		say("是。", 1250, 0, "捕快")
		say("大人，这是为何？这是为何？", 1029, 1, "知府大人")
		say("你的事犯了，牢里解释去吧。将他关入大牢，等待上府来人审理。", 1251, 0, "巡抚")
		say("是，大人。", 1250, 0, "捕快")
		say("大人，大人，小人冤枉啊。", 1029, 1, "知府大人")
		dark()
		null(-2, 98)
		instruct_40(1)
		light()
		say(JY.Person[0].姓名 .. "何在？", 1251, 0, "巡抚")
		say("小人就是，参见大人。", 0, 1)
		say("你就是" .. JY.Person[0].姓名 .. "？果然是年轻有为。", 1251, 0, "巡抚")
		say("大人谬赞了。", 0, 1)
		say("我说你能干就是能干，可不是什么谬赞。", 1251, 0, "巡抚")
		say("呃，大人慧眼如炬，小人佩服。", 0, 1)
		say("这就对了，上府有令，自今日起，" .. JY.Person[0].姓名 .. "升任福州府知府，即刻上任。", 1251, 0, "巡抚")
		say("这？下官领命。多谢大人。", 0, 1)
		say("不谢，不谢，以后就是同僚了，咱们以后多亲近亲近。", 1251, 0, "巡抚")
		say("是。恭敬不如从命，请大人到府上让下官尽一下地主之谊。", 0, 1)
		say("好，哈哈哈，哈哈哈。", 1251, 0, "巡抚")

		JY.Person[0].官阶 = 6
		JY.Person[741].好感度 = 70

		addevent(128, 99, 1, 6359, 1, 10296, -2, -2)
		addtime(3)
		dark()
		null(-2, 98)
		null(-2, 138)
		My_Enter_SubScene(128, 21, 22, 2)
		light()
		say("这官场应酬果然好累。", 0, 1)
		say("不过又升官了，大喜啊。", 0, 1)

		JY.Person[0].宋罪恶值 = 0

		null(69, 141)
		null(69, 142)
		null(116, 8)
		null(116, 9)
		null(116, 10)
		null(116, 11)
		null(116, 12)
		null(116, 13)
		null(116, 14)
		null(116, 15)
		null(69, 44)
		null(69, 117)
	elseif JY.Person[0].官阶 == 5 and JY.Person[741].好感度 < 62 then
		say("年轻人，我看过你的报告，你很有才能，很好，很好，我果然没有看错你。", 1029, 0, "知府大人")
		say("大人。", 0, 1)
		say("我这还有一件事要你去做。", 1029, 0, "知府大人")
		say("大人，你请吩咐。", 0, 1)
		say("你去扬州找到一个叫孟宗政的人，杀了他。", 1029, 0, "知府大人")
		say("这", 0, 1)
		say("怎么？", 1029, 0, "知府大人")
		say("好，我这就去。", 0, 1)
		say(JY.Person[0].姓名 .. "，不要让我失望。", 1029, 0, "知府大人")
		dark()
		null(-2, 98)
		null(69, 44)
		null(69, 59)
		null(69, 138)
		light()
		addevent(69, 44, 1, 8835, 1, 8712, -2, -2)
		addevent(69, 117, 1, 8836, 1, 10306, -2, -2)
	else
		say("官途沉浮，人心晦暗啊。", 1029, 0, "知府大人")
	end
end
OEVENTLUA[8834] = function ()
	Cls()
	say("铁家与反贼勾连，已然被依法处决，知府有令，严查相关叛党。", 1255, 0, "官军")
	say("混蛋。", 0, 1)
	say("好胆，你莫非与铁家有什么关系？", 1255, 0, "官军")
	say("给我拿下。", 1255, 0, "官军")

	if WarMain(514, 0, 1, 1) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("来人啊，发现反贼了，来人啊~", 1255, 0, "官军")
	say("可恶。", 0, 1)

	if WarMain(517, 0, 1, 1) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("反贼厉害，快请城卫军过来。", 1255, 0, "官军")
	say("（可恶。杀这些小兵真是杀不完的，等大军过来可就麻烦了）", 0, 1)
	say("懒得和你们纠缠。", 0, 1)
	dark()
	ReturnMMap2(371, 259)
	light()
	say("仗着对福州的熟悉，你轻易瞒过重重守卫，出了福州城。", 0, 2)
	say("爹，娘。", 0, 1)
	say("孩儿不孝，是我害了你们。", 0, 1)
	say("你不由心中一片悲凉，四顾茫然。", 0, 1)

	JY.Person[0].宋罪恶值 = JY.Person[0].宋罪恶值 + 100
end
OEVENTLUA[8835] = function ()
	Cls()
	say("敢问先生，可知道扬州有一个叫孟宗政的人？", 0, 1)
	say("你找孟宗政？你找他有什么事？", 1243, 0, "孟宗政")
	say("没什么事，就是问问。", 0, 1)
	say("看你鬼鬼祟祟的，不是好人，给我滚出去。", 1243, 0, "孟宗政")
	My_Enter_SubScene(69, 54, 45, 3)
	say("...", 0, 1)
end
OEVENTLUA[8836] = function ()
	Cls()
	say("你知道扬州有一个叫孟宗政的人吗？", 0, 1)
	say("你找孟大人？那找到我就对了，我是孟大人的副将。", 1056, 0, "副将")
	say("你怎么闯进来的，给我滚出去。", 1243, 0, "孟宗政")
	say("原来你就是孟宗政，受死吧。", 0, 1)
	say("哼，又是金国派来的吗？", 1243, 0, "孟宗政")
	say("来人，抓住他。", 1056, 0, "副将")

	if WarMain(555, 0) == false then
		instruct_15()
		Cls()

		return
	end

	dark()
	addevent(69, 44, 1, 0, 1, 10206, -2, -2)
	light()
	say("你，你居然杀了孟大人？金兵南下还有何人能挡？", 1056, 0, "副将")
	say("大人，黄泉路上我还是你的兵。阳世不容，我就随你征战地府。", 1056, 0, "副将")
	dark()
	addevent(69, 117, 1, 0, 1, 10206, -2, -2)
	light()
	say("有没有这么严重的，天塌下来有高个子顶着呢。", 0, 1)
	say("赶快清理一下，不要留下后患。", 0, 1)
	dark()
	null(-2, 44)
	null(-2, 117)
	light()
	instruct_37(-10)

	JY.Person[741].好感度 = 62

	addevent(128, 98, 1, 8837, 1, 10432, -2, -2)
end
OEVENTLUA[8837] = function ()
	Cls()
	say("事情办得怎么样了？", 1029, 0, "知府大人")
	say("禀大人，一切顺利。", 0, 1)
	say("很好很好。", 1029, 0, "知府大人")
	say("做得好，年轻人，我看好你，以后好生跟我做事，少不得你的好处。", 1029, 0, "知府大人")
	say("是，大人。", 0, 1)
	addthing(174, 1000)
	dark()
	null(-2, 98)
	light()
end
OEVENTLUA[8840] = function ()
	Cls()
	dark()
	null(123, 97)
	My_Enter_SubScene(123, 16, 16, 0)
	light()

	if JY.Person[742].好感度 >= 55 then
		say("学生" .. JY.Person[0].姓名 .. "拜见老师。", 0, 1)
		say("哦？我倒是忘了，我曾经答应过你，若是考中进士就将你收入门下。", 1140, 0, "曹公公")
		say("这个~，恳请大人收录。", 0, 1)
		say("也好，我今日就将你收入门下，你还有一个师兄曹芳亭，现任吏部侍郎，以后你们多亲近亲近。", 1140, 0, "曹公公")
		say("是，老师。", 0, 1)
		say("我给你介绍一下，这是兵部侍郎朱允朱大人。", 1140, 0, "曹公公")
		say("下官拜见朱大人。", 0, 1)
		say("免礼，免礼，恭喜太师收得佳徒啊。", 253, 0, "朱大人")
		say("朱大人客气，这次去襄阳还望照顾一下我这新收的弟子。", 1140, 0, "曹公公")
		say("襄阳？", 0, 1)
		say("不错，朱大人要前往襄阳接任西北军大元帅之职，我请他安排手下几个年轻人去锻炼一下。", 1140, 0, "曹公公")
		say("原来如此，还请朱大人多多指点。", 0, 1)
		say("好说，好说。太师如是无其它事情，我这就准备启程。", 253, 0, "朱大人")
		say("哈哈，西北诸事繁杂，有朱大人前往，圣上必然放心了。", 1140, 0, "曹公公")
		say("朱大人往皇城方向拱了拱手", 0, 2)
		say("必不负圣上期望。", 253, 0, "朱大人")

		JY.Person[742].好感度 = 60

		dark()
		null(115, 9)
		My_Enter_SubScene(115, 49, 29, 0)
		addevent(115, 29, 1, -2, 1, 9600, -2, -2)
		addevent(115, 30, 1, -2, 1, 9600, -2, -2)
		addevent(115, 106, 1, -2, 1, 9386, -2, -2)
		addevent(115, 107, 1, -2, 1, 9386, -2, -2)
		addevent(115, 108, 1, -2, 1, 10388, -2, -2)
		addevent(115, 109, 1, -2, 1, 9392, -2, -2)
		light()
		addtime(60)
		say("大人，我们到了。", 0, 1)
		say("我等参见朱大元帅~", 0, 2)
		say("诸位辛苦了。", 253, 0, "朱大人")
		say("元帅，我等在北风阁为大人布置了酒宴，给大人接风。", 1045, 1, "文官")
		say("诸位有心，请。", 253, 0, "朱大人")
		say("元帅，请。", 1045, 1, "文官")
		dark()
		null(115, 29)
		null(115, 30)
		null(115, 106)
		null(115, 107)
		My_Enter_SubScene(115, 49, 29, 0)
		light()
		addtime(10)
		say("这些天你们陪着我也辛苦了。", 253, 0, "朱大人")
		say("大人，你客气了。", 0, 1)
		say("你们都自己到城里转转吧，了解一下各处的军师配置，接下来不用陪我这个老头子了，太师可是对你们给予厚望。", 253, 0, "朱大人")
		say("是，大人。", 1077, 1, "文官")
		dark()
		null(-2, 108)
		null(-2, 109)
		light()
		say("大人的应酬可真是多啊，我也到处转转吧。", 0, 1)
	else
		say("下官" .. JY.Person[0].姓名 .. "拜见太师。", 0, 1)
		say("免礼。这是兵部的朱大人。", 1140, 0, "曹公公")
		say("下官拜见朱大人。", 0, 1)
		say("免礼。", 253, 0, "朱大人")
		say("听说你曾经指挥过连云山剿匪战？想必对行军之法有些造诣。", 1140, 0, "曹公公")
		say("啊？下官略知一二。", 0, 1)
		say("很好，朱大人要前往襄阳接任西北军大元帅之职，你此行同去。听从朱大人指挥。", 1140, 0, "曹公公")
		say("是，下官领命。", 0, 1)
		say("太师如是无其它事情，我这就准备启程。", 253, 0, "朱大人")
		say("好，西北诸事繁杂，有朱大人前往，圣上必然放心了。", 1140, 0, "曹公公")
		say("朱大人往皇城方向拱了拱手", 0, 2)
		say("必不负圣上期望。", 253, 0, "朱大人")
		dark()
		null(115, 9)
		My_Enter_SubScene(115, 49, 29, 0)
		addevent(115, 29, 1, -2, 1, 9600, -2, -2)
		addevent(115, 30, 1, -2, 1, 9600, -2, -2)
		addevent(115, 106, 1, -2, 1, 9386, -2, -2)
		addevent(115, 107, 1, -2, 1, 9386, -2, -2)
		addevent(115, 108, 1, -2, 1, 10388, -2, -2)
		addevent(115, 109, 1, -2, 1, 9392, -2, -2)
		light()
		addtime(60)
		say("大人，我们到了。", 0, 1)
		say("我等参见朱大元帅~", 0, 2)
		say("诸位辛苦了。", 253, 0, "朱大人")
		say("元帅，我等在北风阁为大人布置了酒宴，给大人接风。", 1045, 1, "文官")
		say("诸位有心，请。", 253, 0, "朱大人")
		say("元帅，请。", 1045, 1, "文官")
		dark()
		null(115, 29)
		null(115, 30)
		null(115, 106)
		null(115, 107)
		My_Enter_SubScene(115, 45, 18, 2)
		addevent(115, 9, 1, -2, 1, 10386, -2, -2)
		addevent(115, 110, 1, -2, 1, 9390, -2, -2)
		light()
		addtime(10)
		say("这些天你们陪着我也辛苦了。", 253, 1, "朱大人")
		say("大人，你客气了。", 1077, 0, "文官")
		say("你们都自己到城里转转吧，了解一下各处的军事配置，接下来不用陪我这个老头子了，我可是对你们给予厚望。", 253, 1, "朱大人")
		say("是，大人。", 1077, 0, "文官")
		say("是，大人。", 0, 1)
		dark()
		null(115, 9)
		null(115, 110)
		light()
		say("大人的应酬可真是多啊，我也到处转转吧。", 0, 1)
	end

	JY.Person[741].好感度 = 95
end
OEVENTLUA[8841] = function ()
	Cls()
	dark()
	null(115, 3)
	null(115, 11)
	light()
	say("幸好我们抓了一个百夫长，虽然官不大，多少还是能了解一些军情的。", 262, 1, "名剑三少")
	say("不错，这次事情办完，咱们可以回去了。", 1065, 0, "玄机道长")
	say("（这些是什么人？嗯？有高手来了，我且先躲起来看看）", 0, 1)
	dark()
	My_Enter_SubScene(115, 57, 40, 2)
	addevent(115, 3, 0, 0, 0, 8572, -2, -2)
	light()
	say("不，你们哪都不用去了。", 1044, 0, "江湖高手")
	say("你是三皇子的人？", 1065, 1, "玄机道长")
	say("不错，把蒙古人交给我，我留你们全尸。", 1044, 0, "江湖高手")
	say("那就是没得谈了？杀~", 262, 1, "名剑三少")
	say("哼，自不量力！", 1044, 0, "江湖高手")
	dark()
	addevent(115, 4, 0, 0, 0, 10206, -2, -2)
	addevent(115, 5, 0, 0, 0, 10220, -2, -2)
	light()
	say("很好，抓了这个蒙古将军，又灭了九皇子的手下，这次可是立了大功了。", 1044, 0, "江湖高手")

	if JY.Person[56].好感度 < 70 then
		say("（蒙古将军？这可是一个大功劳，不能放过）", 0, 1)
		dark()
		My_Enter_SubScene(115, 60, 40, 3)
		addevent(115, 3, 0, 0, 0, 8566, -2, -2)
		light()
		say("三皇子的人？果然够狠。", 0, 1)
		say("还有高手？一起死吧！", 1044, 0, "江湖高手")

		if WarMain(384, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		addevent(115, 3, 0, 0, 0, 7170, -2, -2)
		say("愿你们安息。蒙古人，随我走吧！", 0, 1)
		say("叽哩哇啦，叽哩哇啦。", 243, 0, "蒙古百夫长")
		say("？？，不知道你在说什么，先随我见大帅再说。", 0, 1)
	else
		say("（蒙古将军？三皇子？九皇子？这事我还是不掺和了）", 0, 1)
	end

	dark()
	null(115, 3)
	null(115, 4)
	null(115, 5)
	null(115, 97)
	addevent(115, 28, 0, 8842, 3, -2, -2, -2)
	addevent(115, 9, 1, 8842, 1, 10386, -2, -2)
	addevent(115, 110, 1, 8842, 1, 9390, -2, -2)
	light()
end
OEVENTLUA[8842] = function ()
	Cls()
	dark()
	null(115, 28)
	light()
	say(JY.Person[0].姓名 .. "，你回来了，我等你半天了。", 253, 0, "朱大人")
	say("大人。", 0, 1)
	dark()
	My_Enter_SubScene(115, 45, 18, 0)
	light()
	say("大人，刚才蒙古军来到城下了，幸亏", 0, 1)

	if JY.Person[742].好感度 >= 60 then
		say("我都知道了，现在的年轻人啊，你说你一个文官，和一帮江湖人混在一起，有什么好，还冒冒失失跑出城，丢了性命怎么办？我怎么和太师交代啊。", 253, 0, "朱大人")
		say("我", 0, 1)
		say("这是一封加急信，你赶快给我送回皇城去，交给皇上审阅。", 253, 0, "朱大人")
		say("我？", 0, 1)
		say("这是大捷报喜，你送去给圣上，有你的好处。", 253, 0, "朱大人")
		say("啊，是，多谢大人照顾。", 0, 1)
		say("去吧去吧。伯济啊，你派人四处查探一下，不要有什么后患，我和诸将还有会议要开。", 253, 0, "朱大人")
		say("是，大人。", 1077, 0, "文官")
	else
		say("我都知道了，现在的年轻人啊，你说你一个文官，和一帮江湖人混在一起，有什么好，还冒冒失失跑出城，幸亏没有丢了性命。", 253, 0, "朱大人")
		say("我", 0, 1)
		say("这是一封加急信，你赶快给我送回皇城去，交给皇上审阅。", 253, 0, "朱大人")
		say("我？", 0, 1)
		say("话这么多，快去快去。伯济啊，你派人四处查探一下，不要有什么后患，我和诸将还有会议要开。", 253, 0, "朱大人")
		say("是，大人。", 1077, 1, "文官")
	end

	dark()
	null(115, 9)
	light()
	say(JY.Person[0].姓名 .. "兄，你胆子也太大了，居然敢在蒙古军来的时候出城。", 1077, 0, "文官")
	say("呵呵，我胆子是大点。", 0, 1)

	if JY.Person[56].好感度 >= 70 then
		say("你既然在城外，知道蒙古军为啥退军吗？", 1077, 0, "文官")
		say("我", 0, 1)
		say("你不知道？", 0, 1)
		say("我怎么会知道？我又不是蒙古人，又不是沙场老将。", 1077, 0, "文官")
		say("那大帅知道吗？", 0, 1)
		say("不知道，刚才还让我去查呢。", 1077, 0, "文官")
		say("你说那蒙古人都是野蛮人，咱们谁能知道他们怎么想的？你知道啥？和我说说呗。", 1077, 0, "文官")
		say("（不知道？哈哈哈，机会机会）", 0, 1)
		say("我也不知道啊，也许是金人在后方进攻他们了？", 0, 1)
		say("这倒是有可能，唔，我想想，我得去改改给元帅的报告。", 1077, 0, "文官")
	else
		say("呵呵，佩服佩服。（傻缺，看你怎么死得快）", 1077, 0, "文官")
	end

	dark()
	null(115, 110)
	addevent(123, 2, 1, 8845, 1, 9592, -2, -2)
	addevent(123, 59, 0, -2, 0, 9908, -2, -2)
	addevent(123, 60, 0, -2, 0, 10604, -2, -2)
	addevent(123, 61, 0, -2, 0, 10604, -2, -2)
	addevent(123, 62, 0, -2, 0, 10604, -2, -2)
	addevent(123, 63, 0, -2, 0, 10604, -2, -2)
	addevent(123, 64, 0, -2, 0, 10608, -2, -2)
	addevent(123, 65, 0, -2, 0, 10608, -2, -2)
	addevent(123, 66, 0, -2, 0, 10608, -2, -2)
	addevent(123, 67, 0, -2, 0, 10608, -2, -2)
	addevent(123, 78, 0, -2, 0, 10394, -2, -2)
	addevent(123, 81, 0, -2, 0, 10612, -2, -2)
	light()

	if JY.Person[56].好感度 >= 70 then
		say("一帮傻蛋，啥都不知道。", 0, 1)
		say("唔，这样一来，或许我可以借一下杨兄弟的功劳，想必他不会在乎的，嗯，似乎可行，啊哈哈哈~，我先把信改改。", 0, 1)
	end
end
OEVENTLUA[8845] = function ()
	Cls()
	say("参见大人。", 1164, 0, "卫士")
	say("我有襄阳军情要上报皇上。", 0, 1)
	say("大人稍等，待我前往禀告。", 1164, 0, "卫士")
	dark()
	addevent(123, 2, 1, 12303, 1, 9592, -2, -2)
	light()
	instruct_25(34, 49, 31, 16)
	say("皇上，臣愿意前去襄阳议和。", 1251, 0, "大臣")
	say("可以许以黄金5000万两，绢1000万匹，岁贡黄金1000万两。一切就看你的了。", 1252, 1, "皇帝")
	say("皇上，臣必不辱命。", 1251, 0, "大臣")
	instruct_25(31, 16, 31, 49)
	say("皇上宣大人觐见。", 1164, 0, "卫士")
	say("是，有劳了。", 0, 1)
	dark()
	My_Enter_SubScene(123, 31, 18, 0)
	light()
	say("下官大理寺" .. JY.Person[0].姓名 .. "拜见陛下。", 0, 1)
	say("放肆，见了圣上还不赶快跪下？", 1254, 0, "老太监")
	say("啊？我跪，我跪，糟了。", 0, 1)
	say("皇上，那个，呃，草民跪不下去。", 0, 1)
	say("放肆，见了皇上不跪，想被灭九族吗？", 1251, 0, "大臣")
	say("我，我真的不行，从小到大我的膝盖就跪不下去，还请皇上恕罪。（我是真没有这个功能，可不怪我啊）", 0, 1)
	say("皇上，此人不敬皇上，该当死罪。", 1251, 0, "大臣")

	if JY.Person[742].好感度 >= 60 then
		say("圣上，这个" .. JY.Person[0].姓名 .. "是我的学生，他确实腿有残疾，跪不下去。", 1140, 0, "曹公公")
		say("即是太师如此说，那就饶你不敬之罪，先说说你要上报什么事情？", 1252, 0, "皇帝")
	else
		say("先等等，你，说说你要上报什么事情？", 1252, 0, "皇帝")
	end

	say("谢皇上。", 0, 1)

	if JY.Person[56].好感度 >= 70 then
		say("皇上，大喜啊，臣从襄阳而来，蒙古大军已经退兵了。", 0, 1)
		say("哗，大臣不由一阵大哗，又纷纷低声议论起来", 0, 2)
		say("真的？真的？啊哈哈哈，天佑我朝，天佑我朝啊。", 1252, 0, "皇帝")
		say("臣奉太师之命到襄阳任职，蒙古大军进逼襄阳，臣出城冒险打探敌军虚实，不想碰到蒙古大营火起，臣下眼尖，瞧见了蒙古大汗，于是悄悄潜行过去，托皇上洪福，趁大军混乱杀了蒙古大汗。", 0, 1)
		say("杀了蒙古大汗？啊？年轻人可不要信口开河。", 1252, 0, "皇帝")
		say("臣不敢，正是蒙古大汗被臣刺杀，蒙古大军人心惶惶，不得已才退兵。", 0, 1)
		say("可有证据？", 1252, 0, "皇帝")
		say("有，这事朱大帅给圣上的亲笔书信。", 0, 1)
		say("哦？呈上来孤看看。", 1252, 0, "皇帝")
		say("是，圣上。", 1254, 0, "老太监")
		dark()
		light()
		say("好好，果然是天佑我朝，天佑我朝啊。年轻人，没想到你做成如此大事，做得好，做得好。你立了大功，朕今日重重有赏，重重有赏。", 1252, 1, "皇帝")
		null(123, 62)
		addevent(123, 74, 0, 0, 0, 10610, -2, -2)
		say("皇上不可，万万不可。", 1251, 0, "大臣")
		say("嗯？怎么？", 1252, 1, "皇帝")
		say("皇上，万万不可赏赐啊。", 1251, 0, "大臣")
		say("童大人，你这是何意？", 1256, 0, "大臣")
		say("童大人？", 1252, 1, "皇帝")
		say("皇上，蒙古与我朝以前关系虽说不上好，但也不是死敌。今日杀死了蒙古大汗，算是个意外，但是，陛下若是赏赐了，那就是证明此乃朝廷所为，就是与蒙古结下了死仇啊。", 1251, 0, "大臣")
		say("这？", 1252, 1, "皇帝")
		say("皇上，我朝与金国已是连年争战不休，今蒙古势大，一时受挫，若是他们认定我朝乃是死敌，汇集大军再打过来，该当如何？", 1251, 0, "大臣")
		say("这？蒙古应该还在与大金打仗吧，能顾得上咱们？", 1252, 1, "皇帝")
		say("皇上，杀了对方大汗，只怕他们金国不打了，也会掉头打我们的。何况，若是蒙古与大金联合，又该如何？", 1251, 0, "大臣")
		say("这个，应该不会吧？", 1252, 1, "皇帝")
		say("蛮人狡诈，大家可不要忘了前朝之事。", 1251, 0, "大臣")
		say("这？", 1252, 1, "皇帝")
		say("皇上，臣有话说。", 0, 1)
		null(123, 74)
		addevent(123, 62, 0, -2, 0, 10604, -2, -2)
		null(123, 67)
		addevent(123, 74, 0, 0, 0, 10610, -2, -2)
		say("皇上，微臣提议，先将他关押起来，以待后议。", 1253, 0, "大臣")
		say("什么？皇上圣明，不要受小人蛊惑啊~", 0, 1)
		say("朕", 1252, 1, "皇帝")

		if JY.Person[75].好感度 >= 90 then
			say("各位，我认识清朝皇帝，我可以说服清朝皇帝，咱们两朝合作，夹击蒙古。", 0, 1)
			say("哈哈哈，你能说服清朝皇帝，你骗谁啊？你们信吗？", 1251, 0, "大臣")
			say("大殿里传来一片嘲笑之声", 0, 2)
			say("你们？", 0, 1)
		end

		if JY.Person[742].好感度 >= 60 then
			say("圣上，臣有本奏。", 1140, 0, "曹公公")
			say("啊，太师，太师请说。", 1252, 1, "皇帝")
			say("臣接到密报，此次蒙古大军分为两路，一路攻襄阳，一路攻大金都城。", 1140, 0, "曹公公")
			say("竟有此事？", 1251, 1, "大臣")
			say("不错，此次蒙古皇帝战死，两路大军都已撤退回去，几大亲王都在争夺大汗之位，如此一来，数年内只怕难以南顾了。", 1140, 0, "曹公公")
			say("太师，国家大事，岂能仅靠猜测，若是蒙古大军又集兵打来，倒是又该如何？", 1251, 1, "大臣")
			say("呵呵，无妨，臣已经派了特使联系大金国的六王爷，约定与他们签署互助条约，若是蒙古攻击我们，则金国从后攻击蒙古腹地，若是蒙古攻击金国，则咱们与金国合击蒙古。", 1140, 0, "曹公公")
			say("金国乃是虎狼之国，如何可信？", 1256, 1, "大臣")
			say("此一时彼一时也，如今他们也受到蒙古大军威胁，不得不与咱们合作尔。", 1140, 0, "曹公公")
			say("好！", 1252, 1, "皇帝")
			say("这样朕就放心了，太师真是朕的定海神针啊。", 1252, 1, "皇帝")
			say("臣身为当朝太师，愿为圣上肝脑涂地，死而后已。", 1140, 0, "曹公公")
			say("即是如此，朕决定了。", 1252, 1, "皇帝")
			say("大理寺" .. JY.Person[0].姓名 .. "立下大功，擢升三品宣光大夫，可参与朝政议事。", 1252, 0, "皇帝")
			say("谢主隆恩。", 0, 1)
			say("臣愿为圣上肝脑涂地，死而后已。", 0, 1)
			say("好好好，今日真是大喜，诸位卿家，可还有本要奏？", 1252, 0, "皇帝")
			say("臣有本奏，皇上，今年山东大旱，饥民遍野，还望皇上拨下赈灾粮款。", 1251, 1, "大臣")
			dark()
			light()
			say("（哎，站得好累，就不说给一个座位的？）", 0, 1)
			say("下一项~", 1140, 0, "曹公公")
			say("臣有本奏...", 1256, 1, "大臣")
			dark()
			light()
			say("好了，今日朕累了。", 1252, 1, "皇帝")
			say("退朝~", 1254, 0, "老太监")
			say("是，臣等告退~", 0, 2)
			dark()
			null(123, 59)
			null(123, 60)
			null(123, 61)
			null(123, 62)
			null(123, 63)
			null(123, 64)
			null(123, 65)
			null(123, 66)
			null(123, 67)
			null(123, 74)
			null(123, 81)
			light()
			say("老师？", 0, 1)
			say("先回你大理寺，我有事要找你。", 1140, 0, "曹公公")
			say("是。", 0, 1)
			dark()
			null(123, 78)
			My_Enter_SubScene(123, 8, 29, 0)
			addevent(123, 97, 0, 8848, 3, -2, -2, -2)
			addevent(123, 94, 1, 0, 1, 10394, -2, -2)
			addevent(123, 95, 1, 0, 1, 9388, -2, -2)
			addevent(123, 96, 1, 0, 1, 9602, -2, -2)
			light()
			say("呼，这皇帝也不好做啊，够累的。", 0, 1)
		else
			say("你们？你们这是要灭杀功臣吗？", 0, 1)
			say("叛徒！小人！皇上圣明，必能辨明忠奸，不受小人蛊惑。", 0, 1)
			say("放肆！黄口小儿，你懂什么国家大事？", 1253, 0, "大臣")
			say("皇上，微臣为国家之事，常常夜不能寐，日久研究之下，倒也是明白了一些外邦之事，今日杀了蒙古大汗，乃是大祸啊，一个处理不当，只怕就会亡国灭种。", 1253, 0, "大臣")
			say("有这么严重？怎么说？", 1252, 1, "皇帝")
			say("皇上，蒙哥大汗乃是少有的亲和派，蒙古国最可怕的人，不是蒙哥而是忽必烈，在他手下，不知道灭了多少民族，今杀了蒙哥，忽必烈必然上位，而忽必烈素来对我朝虎视眈眈，今日有了如此好的借口，他日必然会提兵前来，到时只怕岁贡也不可得啊。", 1253, 0, "大臣")
			say("啊？有这么严重？", 1252, 1, "皇帝")
			say("皇上，还请下令拿下此人。", 1251, 0, "大臣")
			null(123, 74)
			addevent(123, 67, 0, -2, 0, 10608, -2, -2)
			say("众大臣齐声道，还请皇上下令", 0, 2)
			say("哎，这个" .. JY.Person[0].姓名 .. "是吧，爱卿啊，还请以国家为重，先委屈一下。无论如何，在朕的心里，你都是朕的肱股之臣。", 1252, 1, "皇帝")

			if yesno("要放弃抵抗吗？") == true then
				say("来人啊，拿下他们！", 1251, 0, "大臣")
				dark()
				addevent(123, 71, 0, 0, 0, 9606, -2, -2)
				addevent(123, 72, 0, 0, 0, 9606, -2, -2)
				addevent(123, 73, 0, 0, 0, 9606, -2, -2)
				light()
				say("皇上，已经点了他的穴位，已经不能反抗了。", 1164, 0, "禁军护卫")
				say("哎，爱卿，委屈你了。杀了吧，将头腌制起来，过几日送与蒙古去。", 1252, 1, "皇帝")
				say("皇上，你？啊~", 0, 1)
				instruct_15(0)
				instruct_0()

				return
			end

			say("一帮蠢货，今日不陪你们玩了。", 0, 1)
			say("站住，来人，拿下他们。", 1251, 0, "大臣")
			dark()
			addevent(123, 71, 0, 0, 0, 9606, -2, -2)
			addevent(123, 72, 0, 0, 0, 9606, -2, -2)
			addevent(123, 73, 0, 0, 0, 9606, -2, -2)
			light()
			My_Enter_SubScene(123, 31, 18, 3)
			say("挡我者死。", 0, 1)

			if WarMain(385, 0, 1, 1) == false then
				instruct_15(0)
				instruct_0()

				return
			end

			dark()
			null(123, 73)
			null(123, 78)
			light()
			say("该死~，你们都该死！", 0, 1)
			say("敢在皇宫大殿内公然反抗，果然是乱臣贼子，禁军何在？拿下此僚！", 1253, 0, "大臣")
			say("拿下他！", 1164, 0, "禁军护卫")
			addevent(123, 74, 0, 0, 0, 9606, -2, -2)
			addevent(123, 75, 0, 0, 0, 9606, -2, -2)
			addevent(123, 76, 0, 0, 0, 9606, -2, -2)
			addevent(123, 77, 0, 0, 0, 9606, -2, -2)
			addevent(123, 78, 0, 0, 0, 9600, -2, -2)
			addevent(123, 79, 0, 0, 0, 9600, -2, -2)
			say("你们！今日非要和我死磕是吧？", 0, 1)
			dark()
			My_Enter_SubScene(123, 31, 14, 0)
			light()
			say("好快~，快拦住他！", 1164, 0, "禁军护卫")
			say("护驾~，护驾~", 1253, 0, "大臣")
			say(JY.Person[0].称呼 .. "，你要做什么？", 1254, 0, "老太监")
			say("哼。", 0, 1)
			dark()
			My_Enter_SubScene(123, 30, 10, 0)
			light()
			say("大胆，居然敢刺杀皇上！", 1164, 0, "禁军护卫")
			say("哎呀，救命啊~救命啊~", 1252, 1, "皇帝")
			say("皇上勿慌！", 1254, 0, "老太监")
			addevent(123, 80, 0, 0, 0, 10612, -2, -2)
			addevent(123, 81, 0, 0, 0, 10612, -2, -2)
			addevent(123, 82, 0, 0, 0, 10612, -2, -2)

			if WarMain(558, 0, 1, 1) == false then
				instruct_15(0)
				instruct_0()

				return
			end

			say("唔，好厉害！皇上，老奴有负皇恩~", 1254, 0, "老太监")
			null(123, 78)
			null(123, 79)
			null(123, 80)
			null(123, 81)
			null(123, 82)
			My_Enter_SubScene(123, 30, 9, 0)
			say("狗皇帝，今日不杀你我心不能通达，死吧！", 0, 1)
			say("别别别啊~", 1252, 1, "皇帝")

			if JY.Person[0].性别 == 0 then
				instruct_27(-1, 7674, 7680)
			else
				instruct_27(-1, 10636, 10640)
			end

			addevent(123, 59, 0, -2, 0, 9910, -2, -2)

			JY.Person[621].好感度 = 0
			JY.Person[0].宋罪恶值 = 1000

			say("大殿一片寂静，接着是大哗，殿内一片混乱", 0, 2)
			dark()
			null(123, 70)
			null(123, 72)
			null(123, 74)
			addevent(123, 80, 0, 0, 0, 9600, -2, -2)
			addevent(123, 81, 0, 0, 0, 9600, -2, -2)
			addevent(123, 82, 0, 0, 0, 9600, -2, -2)
			light()
			say("皇上，皇上啊~", 1251, 0, "大臣")
			say("竖子，老夫与你拼了。", 1253, 0, "大臣")
			say("此时不走，更待何时？", 0, 1)
			dark()
			My_Enter_SubScene(123, 30, 58, 3)
			light()
			say("这事搞大了，也不知该如何结局，哎。", 0, 1)

			JY.Person[0].官阶 = 0

			addevent(123, 0, 1, 6706, 1, 9592, -2, -2)
			null(128, 21)
			null(128, 24)
			addevent(128, 139, 1, 8834, 1, 10602, -2, -2)
			addevent(128, 139, 1, 8846, 1, 10060, -2, -2)
			addevent(128, 140, 1, 8846, 1, 10060, -2, -2)
		end
	else
		say("臣奉太师之命到襄阳任职，蒙古大军进逼襄阳，臣出城冒险打探敌军虚实，不想碰到蒙古大营火起，臣下趁大军混乱，抓了一个蒙古将军回来。", 0, 1)
		say("哦？人在什么地方？", 1252, 0, "皇帝")
		say("臣已经交给禁军看押。", 0, 1)
		say("带他上来朕看看。", 1252, 0, "皇帝")
		say("来人，带蒙古将军进殿~", 1254, 1, "老太监")
		say("是。", 1164, 0, "禁军护卫")
		dark()
		addevent(123, 70, 0, 0, 0, 10200, -2, -2)
		light()
		say("圣上，这就是我抓获的蒙古将军。", 0, 1)
		say("唔，蒙古人果然是长得野蛮。", 1252, 0, "皇帝")
		say("这位蒙古的将军，你们这次攻我南朝来了多少人？由谁统兵的？", 1252, 0, "皇帝")
		say("子丫户，亚二呼，质押娃子。", 243, 1, "蒙古百夫长")
		say("你说什么？", 1252, 0, "皇帝")
		say("子丫户，亚二呼，质押娃子。", 243, 1, "蒙古百夫长")
		say("谁知道他说的什么？", 1252, 0, "皇帝")
		say("众臣你望望我，我望望你，谁也不做声", 0, 2)
		say("满朝文武，就没有人知道他说的什么吗？", 1252, 1, "皇帝")
		say("一片静默", 0, 2)
		say("都是废物，要你们何用？", 1252, 1, "皇帝")
		dark()
		addevent(123, 74, 0, 0, 0, 9606, -2, -2)
		light()
		say("报，启禀皇上，大皇子求见。", 1164, 0, "禁军护卫")
		say("宣他进来。", 1252, 1, "皇帝")
		say("是。", 1164, 0, "禁军护卫")
		dark()
		null(123, 74)
		addevent(123, 83, 0, 0, 0, 8472, -2, -2)
		light()
		say("儿臣参见父皇。", 1093, 0, "大皇子")
		say("皇儿啊，你来有什么事吗？", 1252, 1, "皇帝")
		say("父皇，大喜啊。", 1093, 0, "大皇子")
		say("哦？什么喜啊？", 1252, 1, "皇帝")
		say("父皇，儿臣已经联系上蒙古大军统帅，他们同意议和了。", 1093, 0, "大皇子")
		say("啊？真的？", 1252, 1, "皇帝")
		say("顿时大殿上众臣一片议论之声", 0, 2)
		say("真的。只是他们有几个条件。", 1093, 0, "大皇子")
		say("什么条件？", 1252, 1, "皇帝")
		say("蒙古大军此次统帅是忽必烈，咱们这有人抓了他的儿子，他要咱们立刻将人放了。", 1093, 0, "大皇子")
		say("啊？", 1252, 1, "皇帝")
		say("大殿上众臣议论之声更大了", 0, 2)
		say("难道？你抓的这个人就是蒙古统帅的儿子？", 1252, 1, "皇帝")
		say("这？", 0, 1)
		say("他们还有什么条件？", 1252, 1, "皇帝")
		say("其次，他们要求咱们割让襄阳，再每年进攻金银，兵甲，茶盐等物事。", 1093, 0, "大皇子")
		say("众位爱卿，你们怎么看？", 1252, 1, "皇帝")
		null(123, 62)
		addevent(123, 76, 0, 0, 0, 10610, -2, -2)
		say("皇上，放人可以，进贡也好说，只是这襄阳乃是咱们在边境的唯一屏障，万万不可割让。", 1251, 0, "大臣")
		say("蒙古那边说同意了这些才会开始和谈，不然他们就围困襄阳城，等城破了他们大军会一路南下，直攻我们都城。", 1093, 0, "大皇子")
		say("众位爱卿，可有妙计？", 1252, 1, "皇帝")
		addevent(123, 77, 0, 0, 0, 10610, -2, -2)
		say("皇上，蒙古入侵我朝，不外乎是化外之民未见过盛朝繁华，想要得些东西回去，咱们先让他们平心静气，再慢慢商谈，总是可以谈拢的。", 1253, 0, "大臣")
		say("哦？平心静气？爱卿，这要如何做？", 1252, 1, "皇帝")
		say("咱们将这位将军隆重送回，再将去抓他的这个，这个匪徒也押送过去，想必他们便能知道咱们的诚心，到时候再慢慢和他们谈，只要是要金银物质，总是可以商量的。", 1253, 0, "大臣")
		say("你说什么？找死！", 0, 1)
		say("禁声，大殿之上禁止喧哗。", 1164, 0, "禁军护卫")
		say("果然还是年轻人，不知礼仪教化。还请皇上示下。", 1253, 0, "大臣")
		say("这？", 1252, 1, "皇帝")
		say("父皇，身为我朝子民，为国献身乃是他的荣幸。", 1093, 0, "大皇子")
		say("哎，这个" .. JY.Person[0].姓名 .. "是吧，爱卿啊，还请以国为重，委屈你了。来人，将他拿下。", 1252, 1, "皇帝")

		if JY.Person[75].好感度 >= 90 then
			say("等等，各位，各位，我和清朝皇帝交好，我可以说服清朝皇帝，咱们两朝合作，夹击蒙古。", 0, 1)
			say("哈哈哈，你能说服清朝皇帝，你骗谁啊？你们信吗？", 1251, 0, "大臣")
			say("大殿里传来一片嘲笑之声", 0, 2)
			say("你们？", 0, 1)
		end

		say("混蛋！", 0, 1)
		say("气死我了，什么为国献身，说来说去，就是你们怕死。怕个屁啊，兵来将挡，水来土掩。", 0, 1)
		say("无知小儿，我央央上国，岂能与蛮族野蛮争斗，真是丢尽上国气度。", 1253, 0, "大臣")
		say("不能争斗？等着被打吗？", 0, 1)
		say("哼，没有文化。我央央上国，当然是礼仪教化，以德服人，怎么能与野蛮人一样动不动就喊打喊杀的。", 1253, 0, "大臣")
		say("蠢货，蠢货。", 0, 1)
		say("难怪我南朝羸弱，原来是满朝的蠢货，一帮的猪猡。", 0, 1)

		if JY.Person[742].好感度 >= 60 then
			say("老师，救我啊。", 0, 1)
			say("哎，身为臣子，当为圣上肝脑涂地，死而后已，好徒儿，你好好去吧。", 1140, 0, "曹公公")
			say("我...", 0, 1)
		end

		if yesno("要听众人的道理，放弃抵抗吗？") == true then
			say("来人啊，拿下他！", 1251, 0, "大臣")
			dark()
			addevent(123, 71, 0, 0, 0, 9606, -2, -2)
			addevent(123, 72, 0, 0, 0, 9606, -2, -2)
			addevent(123, 73, 0, 0, 0, 9606, -2, -2)
			light()
			say("皇上，已经点了他的穴位，已经不能反抗了。", 1164, 0, "禁军护卫")
			say("爱卿，委屈你了，哎，押下去杀了吧。", 1252, 1, "皇帝")
			say("你们怎么能杀人？我都没有反抗啊？", 0, 1)
			say("将头腌制起来，过几日送与蒙古去。", 1252, 1, "皇帝")
			say("啊~", 0, 1)
			instruct_15(0)
			instruct_0()

			return
		end

		say("一帮蠢货，今日不陪你们玩了。", 0, 1)
		say("站住，来人，拿下他们。", 1251, 0, "大臣")
		dark()
		addevent(123, 71, 0, 0, 0, 9606, -2, -2)
		addevent(123, 72, 0, 0, 0, 9606, -2, -2)
		addevent(123, 73, 0, 0, 0, 9606, -2, -2)
		light()
		My_Enter_SubScene(123, 31, 18, 3)
		say("挡我者死。", 0, 1)

		if WarMain(385, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		null(123, 72)
		say("敢在皇宫大殿内公然反抗，果然是乱臣贼子，禁军何在？拿下此僚！", 1253, 0, "大臣")
		say("拿下他！", 1164, 0, "禁军护卫")
		addevent(123, 74, 0, 0, 0, 9606, -2, -2)
		addevent(123, 75, 0, 0, 0, 9606, -2, -2)
		addevent(123, 76, 0, 0, 0, 9606, -2, -2)
		addevent(123, 77, 0, 0, 0, 9606, -2, -2)
		addevent(123, 78, 0, 0, 0, 9600, -2, -2)
		addevent(123, 79, 0, 0, 0, 9600, -2, -2)
		say("你们！今日非要和我死磕是吧？", 0, 1)
		dark()
		My_Enter_SubScene(123, 32, 15, 3)
		light()
		say("你这么想让我死，我就送你下地狱吧！", 0, 1)
		say("父皇，救我。", 1093, 0, "大皇子")
		say("啊~", 1093, 0, "大皇子")
		addevent(123, 83, 0, 0, 0, 10222, -2, -2)
		say("皇儿，皇儿，快去看看皇儿怎么样了？", 1252, 0, "皇帝")
		say("皇上，此人凶狠，皇上万圣之躯，切不可靠近啊。", 1253, 1, "大臣")
		say("好凶恶的悍匪，禁卫，快快拿下他。", 1251, 0, "大臣")

		if WarMain(386, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("此时不走，更待何时？", 0, 1)
		dark()
		My_Enter_SubScene(123, 30, 58, 3)
		null(123, 59)
		null(123, 60)
		null(123, 61)
		null(123, 62)
		null(123, 63)
		null(123, 64)
		null(123, 65)
		null(123, 66)
		null(123, 67)
		null(123, 70)
		null(123, 74)
		null(123, 81)
		null(123, 83)
		light()
		say("这事搞大了，也不知该如何结局，哎。", 0, 1)

		JY.Person[0].官阶 = 0
		JY.Person[0].宋罪恶值 = 1000

		addevent(123, 3, 1, 12303, 1, 9592, -2, -2)
		null(128, 21)
		null(128, 24)
		addevent(128, 139, 1, 8834, 1, 10602, -2, -2)
		addevent(128, 139, 1, 8846, 1, 10060, -2, -2)
		addevent(128, 140, 1, 8846, 1, 10060, -2, -2)
	end
end
OEVENTLUA[8846] = function ()
	Cls()

	if JY.Person[0].宋罪恶值 >= 970 then
		say("是你？你还敢到皇城来！来人啊，抓住这个逆贼~", 1164, 0, "卫士")

		if WarMain(385, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("还敢反抗，快叫禁卫大军过来~", 1164, 0, "卫士")
		say("真是麻烦啊，还是不要硬闯好了。", 0, 1)
		dark()
		My_Enter_SubScene(123, 30, 58, 3)
		light()
	end
end
OEVENTLUA[8848] = function ()
	Cls()
	dark()
	null(-2, 97)
	light()
	instruct_30(16, 20, 16, 16)
	say("学生拜见老师，多谢老师相助。", 0, 1)
	say("有才学，有胆识，我没有看错你。", 1140, 0, "曹公公")
	say("都是老师指导有方，学生时刻以老师做榜样，如今略有所获。", 0, 1)
	say("唔，很好，很好！你在皇城已久，想来你也知道，我无子无女，孑然一身，如今想收一个义子以继承一生功业，不知你可愿意。", 1140, 0, "曹公公")
	say("弟子求之不得，义父在上，受孩儿一拜。", 0, 1)
	dark()
	light()
	say("好孩子，好孩子。", 1140, 0, "曹公公")
	say("孩子，你是真的跪不下去？", 1140, 0, "曹公公")
	say("不瞒义父，此乃我陈年旧疾，一直没有治好。", 0, 1)
	say("唔，无妨，无妨。孩儿啊，今日义父要你去做一件大事，不知你可愿意？", 1140, 0, "曹公公")
	say("义父尽管吩咐。", 0, 1)
	say("豺之啊，你让人周围看看，不要有人靠近。", 1140, 0, "曹公公")
	say("是，太师。", 1164, 1, "陈豺之")
	dark()
	light()
	say("四周都安排了暗哨，闯入者杀。", 1164, 1, "陈豺之")
	say("唔，好。", 1140, 0, "曹公公")
	say("好孩儿，来，我给你介绍一下，这是禁军统领陈豺之陈将军，这是兵部侍郎马耀强马大人。", 1140, 0, "曹公公")
	say("见过陈将军，见过马大人。", 0, 1)
	say("大家自己人，不用客气。", 1164, 0, "陈将军")
	say("正是，以后咱们就是兄弟了，以后相互关照就对了。", 1065, 0, "马大人")
	say("多谢两位。不知义父要孩儿做什么？", 0, 1)
	say("哎，幸得孩儿相助，真是天意。", 1140, 0, "曹公公")
	say("？", 0, 1)
	say("义父如今权势愈盛，朝内拥护者众。", 1140, 0, "曹公公")
	say("就是圣上对我，也是顾忌三分。", 1140, 0, "曹公公")
	say("义父乃是当朝太师，当代大儒，一人之下，万人之上，那也是应当。", 0, 1)
	say("呵呵，话是这样说，那是你不懂圣上的心思。", 1140, 0, "曹公公")
	say("圣上？难道？", 0, 1)
	say("不错，圣上对我已有猜疑之心，已是暗中安排人针对我了。", 1140, 0, "曹公公")
	say("今日你在堂上，坚不下跪，他知道你是我的学生，必然怀疑这是一个试探，是一个信号。", 1140, 0, "曹公公")
	say("这？", 0, 1)
	say("我从小看他长大的，他瞒不过我，他是准备对我下手了。", 1140, 0, "曹公公")
	say("义父，那咱们怎么办？", 0, 1)
	say("义父一生起起落落，不知经过了多少劫难，值此生死存亡之际，自然是先下手为强。", 1140, 0, "曹公公")
	say("义父？你这是要？", 0, 1)
	say("不错，我都已经安排好了，你随我连夜进宫拜见圣上，到时候你出手，务必一招制胜，不可拖延。", 1140, 0, "曹公公")
	say("我？我一切听从义父安排。", 0, 1)
	say("好。", 1140, 0, "曹公公")
	say("陈将军，马大人，开始执行吧。", 1140, 0, "曹公公")
	say("是。", 1164, 0, "陈将军")
	say("是。", 1065, 0, "马大人")
	dark()
	null(123, 94)
	null(-2, 95)
	null(-2, 96)
	light()
	say("好孩子，咱们这就进宫，放心，攻其不备，必然成功。", 1140, 0, "曹公公")
	say("是。", 0, 1)
	dark()
	addevent(123, 100, 1, 0, 1, 10438, -2, -2)
	addevent(123, 99, 1, 0, 1, 9908, -2, -2)
	addevent(123, 101, 1, 0, 1, 10612, -2, -2)
	My_Enter_SubScene(123, 44, 7, 0)
	light()
	say("老奴拜见圣上。", 1140, 0, "曹公公")
	say("太师来了，嗯？这侍卫是怎么搞的，太师来了也不通报一声。", 1252, 1, "皇帝")
	say("圣上勿怪，是老奴见圣上正在读书，怕打扰了圣上的兴致，不让他们通报的。", 1140, 0, "曹公公")
	say("不知太师深夜前来，所为何事？", 1252, 1, "皇帝")
	say("圣上，我这学生在襄阳时还获得了一份秘密名单，事关重大，老奴特意避开众人，要请圣上亲阅。", 1140, 0, "曹公公")
	say("是什么的秘密名单啊？", 1252, 1, "皇帝")
	say("是朝内有大臣和敌军私通款曲的名单，还不拿给圣上？", 1140, 0, "曹公公")
	say("是。", 0, 1)
	instruct_30(44, 7, 44, 6)
	say("站住，将名单交给我就好。", 1254, 0, "老太监")
	say("是。（倒真是谨慎）", 0, 1)
	say("给你。", 0, 1)
	dark()
	light()
	say("啊！小子使诈！护驾~，圣上小心。", 1254, 0, "老太监")

	if WarMain(558, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("唔，好厉害！皇上，老奴有负皇恩~", 1254, 0, "老太监")
	dark()
	null(123, 101)
	My_Enter_SubScene(123, 45, 5, 0)
	light()
	say("皇帝，为了义父的安危，你去死吧！", 0, 1)
	say("别别别啊~", 1252, 1, "皇帝")

	if JY.Person[0].性别 == 0 then
		instruct_27(-1, 7674, 7680)
	else
		instruct_27(-1, 10636, 10640)
	end

	addevent(123, 99, 0, -2, 0, 9910, -2, -2)
	say("屋内一片寂静，落针可闻，半饷后", 0, 2)
	say("呼，没想到真的成功了。", 1140, 0, "曹公公")
	say("我儿真是好本事。", 1140, 0, "曹公公")
	say("义父，现在怎么办？", 0, 1)
	say("都安排好了，放心吧。来人~", 1140, 0, "曹公公")
	dark()
	addevent(123, 103, 1, 0, 1, 9602, -2, -2)
	light()
	say("末将在。", 1164, 1, "陈豺之")
	say("陈将军，可以宣太子进宫了。", 1140, 0, "曹公公")
	say("是。", 1164, 1, "陈豺之")
	dark()
	null(123, 103)
	light()
	say("我儿，下来都是一些老套的情节了，你先回去休息吧，明天早上我派人去叫你。", 1140, 0, "曹公公")
	say("是，义父。", 0, 1)
	dark()
	null(123, 99)
	null(123, 100)
	My_Enter_SubScene(123, 15, 15, 0)
	light()
	say("四处寂静无声，你既紧张又兴奋，怎么也无法睡下", 0, 2)
	dark()
	light()
	say("也不知道怎么样了？别处什么差错才好。", 0, 1)
	dark()
	light()
	say("皇宫里突然隐隐出来一片哭声", 0, 2)
	dark()
	light()
	say("天色渐白，漫漫长夜终于过去了", 0, 2)
	say("怎么还没有动静？（你现在心里有些忐忑了）", 0, 1)
	dark()
	addevent(123, 97, 1, 0, 1, 9606, -2, -2)
	light()
	say("大人，朝会开始了，太师让你过去。", 1164, 1, "卫士")
	say("啊？好，好。", 0, 1)
	dark()
	null(123, 97)
	My_Enter_SubScene(123, 31, 20, 0)
	addevent(123, 60, 0, -2, 0, 10604, -2, -2)
	addevent(123, 61, 0, -2, 0, 10604, -2, -2)
	addevent(123, 62, 0, -2, 0, 10604, -2, -2)
	addevent(123, 63, 0, -2, 0, 10604, -2, -2)
	addevent(123, 64, 0, -2, 0, 10608, -2, -2)
	addevent(123, 65, 0, -2, 0, 10608, -2, -2)
	addevent(123, 66, 0, -2, 0, 10608, -2, -2)
	addevent(123, 67, 0, -2, 0, 10608, -2, -2)
	addevent(123, 82, 0, -2, 0, 10394, -2, -2)
	light()
	say("大殿里隐隐有一股压抑寂静的气氛", 0, 2)
	say("各位大人，这是大理寺少卿" .. JY.Person[0].姓名 .. "。昨夜太子伙同左相等人谋害先帝，意图篡位，大理寺卿不幸遇害。", 1140, 0, "曹公公")
	say("为保朝廷稳定，我举荐他担任大理寺卿一职，各位可有意见？", 1140, 0, "曹公公")
	say("我等无有意见。", 1260, 1, "大臣")
	say("我等无有意见", 0, 2)
	say("很好。" .. JY.Person[0].姓名 .. "，你既任大理寺卿，以后便要参与朝会。", 1140, 0, "曹公公")
	say("是。", 0, 1)

	JY.Person[0].官阶 = 9
	JY.Person[0].宋罪恶值 = 0

	dark()
	My_Enter_SubScene(123, 25, 24, 1)
	light()
	say("所谓国不可一日无君，圣上虽然不在，但他的子嗣血脉还在，有请新皇登基~", 1140, 0, "曹公公")
	say("......", 0, 1)
	dark()
	addevent(123, 78, 0, -2, 0, 10394, -2, -2)
	addevent(123, 82, 0, -2, 0, 7162, -2, -2)
	addevent(123, 81, 0, -2, 0, 10612, -2, -2)
	light()
	say("新皇即位~", 1254, 0, "老太监")
	say("我等拜见新皇~", 0, 2)
	say("太师？我", 368, 0, "小皇帝")
	say("没事的，你就说众卿平身。", 1140, 1, "曹公公")
	say("嗯。众卿平身。", 368, 0, "小皇帝")
	say("谢皇上~", 0, 2)
	say("太师？我，我想尿尿...", 368, 0, "小皇帝")
	say("......", 0, 2)
	say("新皇年幼，受不得寒气，快扶他回宫内吧。", 1140, 1, "曹公公")
	say("是，圣上，我们回去吧。", 1254, 0, "老太监")
	say("好。快一点走。", 368, 1, "小皇帝")
	dark()
	null(123, 81)
	null(123, 82)
	null(123, 78)
	addevent(123, 82, 0, -2, 0, 10394, -2, -2)
	light()
	say("圣上年幼，由我暂代国事。今日有何事要奏？", 1140, 0, "曹公公")
	say("......", 0, 2)
	say("臣有本奏。", 1257, 1, "大臣")
	say("陈大夫，你有何事？", 1140, 0, "曹公公")
	say("太子与左相党羽甚众，如今许多逃亡在外，臣请太师下令全国通缉，不可使乱臣贼子逃脱在外。", 1257, 1, "大臣")
	say("却是如此，" .. JY.Person[0].姓名 .. "何在？", 1140, 0, "曹公公")
	say("臣在。", 0, 1)
	say("这事交给你处理，务必一一抓捕归案，依法严惩。", 1140, 0, "曹公公")
	say("是。", 0, 1)
	say("禀太师，臣有本奏。", 1259, 0, "大臣")
	say("李侍郎，你有何事？", 1140, 1, "曹公公")
	say("太行山匪患严重，前几日下山杀了蒲县知府，鲁州知州上书请求朝廷派军镇压。", 1259, 0, "大臣")
	dark()
	light()
	say("还有何事要奏？", 1140, 1, "曹公公")
	say("禀太师，臣有本奏。", 1261, 0, "大臣")
	dark()
	light()
	say("还有何事要奏？", 1140, 0, "曹公公")
	say("禀太师，臣有本奏。", 1258, 1, "大臣")
	dark()
	light()
	say("一天很快过去...", 0, 2)
	say("今日就到此，有本明日再奏。", 1140, 0, "曹公公")
	say("是~", 0, 2)
	dark()
	null(123, 60)
	null(123, 61)
	null(123, 62)
	null(123, 63)
	null(123, 64)
	null(123, 65)
	null(123, 66)
	null(123, 67)
	null(123, 82)
	My_Enter_SubScene(123, 15, 15, 0)
	light()
	say("呼，好累，终于可以休息了。", 0, 1)
	dark()
	addevent(123, 97, 1, 0, 1, 9606, -2, -2)
	light()
	say("大人，礼部侍郎朗大人来访。", 1164, 1, "卫士")
	say("啊？快快有请！", 0, 1)
	dark()
	null(123, 97)
	My_Enter_SubScene(123, 16, 15, 2)
	addevent(123, 95, 1, 0, 1, 10424, -2, -2)
	addevent(123, 96, 1, 0, 1, 9602, -2, -2)
	light()
	say("朗大人，你怎么来了？", 0, 1)
	say("真是年轻有为，年轻有为啊。当年你刚入皇城的时候，我就知道你会飞黄腾达，今日果然不虚。", 1140, 0, "曹公公")
	say("朗大人你过奖了。来人，摆上宴席。", 0, 1)
	dark()
	light()
	say("一夜很快过去...", 0, 2)
	dark()
	null(123, 95)
	null(123, 96)
	addevent(123, 95, 1, 8854, 1, 9602, -2, -2)
	light()
end
OEVENTLUA[8854] = function ()
	Cls()

	local var_70_0 = {
		"户部侍郎纪大人",
		"大学士风大人",
		"吏部周大人",
		"翰林院张大人",
		"兵部侍郎刘大人",
		"禁军副统领高大人"
	}
	local var_70_1 = var_70_0[math.random(#var_70_0)]

	if JY.Person[741].好感度 < 100 then
		say("参见大人，今日朝会要开始了，请随我来。", 1164, 1, "卫士")
		say("走吧。", 0, 1)
		dark()
		My_Enter_SubScene(123, 25, 24, 1)
		addevent(123, 60, 0, -2, 0, 10604, -2, -2)
		addevent(123, 61, 0, -2, 0, 10604, -2, -2)
		addevent(123, 62, 0, -2, 0, 10604, -2, -2)
		addevent(123, 63, 0, -2, 0, 10604, -2, -2)
		addevent(123, 64, 0, -2, 0, 10608, -2, -2)
		addevent(123, 65, 0, -2, 0, 10608, -2, -2)
		addevent(123, 66, 0, -2, 0, 10608, -2, -2)
		addevent(123, 67, 0, -2, 0, 10608, -2, -2)
		addevent(123, 82, 0, -2, 0, 10394, -2, -2)
		light()
		say("今日有何事要奏？", 1140, 0, "曹公公")
		say("臣有本奏。", 1257, 1, "大臣")
		say("呼~，呼~~。", 0, 1)
		dark()
		light()
		say("还有何人要奏？", 1140, 0, "曹公公")
		say("禀太师，臣有本奏。", 1259, 0, "大臣")
		say("呼~，呼~~。", 0, 1)
		dark()
		light()
		say("一天很快过去...", 0, 2)
		say("今日已晚，有本明日再奏。退朝！", 1140, 0, "曹公公")
		say("是~", 0, 2)
		dark()
		null(123, 60)
		null(123, 61)
		null(123, 62)
		null(123, 63)
		null(123, 64)
		null(123, 65)
		null(123, 66)
		null(123, 67)
		null(123, 82)
		My_Enter_SubScene(123, 15, 15, 0)
		light()
		say("呼，好累，终于可以休息了。", 0, 1)
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人，" .. var_70_1 .. "来访。", 1164, 1, "卫士")
		say("啊？快快有请！", 0, 1)
		dark()
		null(123, 97)
		My_Enter_SubScene(123, 16, 15, 2)
		addevent(123, 95, 1, 0, 1, 10424, -2, -2)
		addevent(123, 96, 1, 0, 1, 9602, -2, -2)
		light()
		say("大人，你怎么来了？", 0, 1)
		say("真是年轻有为，年轻有为啊。当年你刚入皇城的时候，我就知道你会飞黄腾达，今日果然不虚。", 1257, 0, "大人")
		say("大人你过奖了。来人，摆上宴席。", 0, 1)
		dark()
		null(123, 95)
		null(123, 96)
		light()
		say("一夜很快过去...", 0, 2)
		addtime(1)
		addevent(123, 96, 1, 8854, 1, 9602, -2, -2)

		JY.Person[741].好感度 = JY.Person[741].好感度 + 1
	else
		JY.YEAR = JY.YEAR + 3

		say("三年以后......", 0, 2)
		say("你凭借太师的权势，渐渐形成了自己的势力，越来越多的鹰派官员汇聚在你的周围，唯你马首是瞻", 0, 2)
		dark()
		null(123, 95)
		null(123, 96)
		addevent(123, 95, 1, 8855, 1, 9602, -2, -2)
		light()
	end
end
OEVENTLUA[8855] = function ()
	Cls()
	say("参见大人，太师有急事召见，请随我来。", 1164, 1, "卫士")
	say("走吧。", 0, 1)
	dark()
	null(123, 97)
	null(123, 95)
	My_Enter_SubScene(123, 44, 6, 1)
	addevent(123, 100, 1, 0, 1, 10610, -2, -2)
	addevent(123, 105, 1, 0, 1, 10388, -2, -2)
	addevent(123, 106, 1, 0, 1, 10608, -2, -2)
	addevent(123, 101, 0, -2, 0, 10612, -2, -2)
	addevent(123, 102, 0, -2, 0, 10394, -2, -2)
	light()
	say("老师。", 0, 1)
	say("很好，人都到齐了。", 1140, 0, "曹公公")
	say("太师，你找我们来是？", 1257, 1, "大人")
	say("诸位都是我最信任的人，请你们来是有事拜托诸位。", 1140, 0, "曹公公")
	say("太师，这是？", 1258, 1, "大人")
	say("我已经老了，最近感觉已经有些力不从心了。", 1140, 0, "曹公公")
	say("老师。", 0, 1)
	say("无妨的。我想在离开前到处走走，再看看这个世界，我在宫里待了一辈子，都忘记了外面是什么样子了。", 1140, 0, "曹公公")
	say(",,,，老师。", 0, 1)
	say("可朝廷大事不可无主，烦请诸位担任辅政大臣，由我这徒儿" .. JY.Person[0].姓名 .. "主导，共主国事，诸位可是愿意？", 1140, 0, "曹公公")
	say("有太师之令，我等愿意全力辅助" .. JY.Person[0].姓名 .. "大人，太师请放心。", 1257, 1, "大人")
	say("谨尊太师之令。", 1258, 1, "大人")
	say("谨尊太师之令。", 1259, 0, "大人")
	say("很好，明日朝会上我便宣布此事，你等下去安排吧，" .. JY.Person[0].姓名 .. "，你且留下。", 1140, 0, "曹公公")
	say("是，老师。", 0, 1)
	dark()
	null(123, 100)
	null(123, 105)
	null(123, 106)
	light()
	say("孩儿。", 1140, 0, "曹公公")
	say("义父，你的身体？", 0, 1)
	say("呵呵，我的时日已经不多了。以后我的手下、势力都归你调遣，老师只能带你走到这里了。以后的路吗？你想做什么，就去做吧。", 1140, 0, "曹公公")
	say("义父...", 0, 1)
	say("这是龙苗公公，内宫总管，是我在宫里最信任的人，龙公公，以后我这徒弟就交给你照拂了。", 1140, 0, "曹公公")
	say("是，太师放心。", 1254, 0, "老太监")
	say("义父，我这儿有一套内功秘籍，若是修炼了，或能延续老师的寿命。", 0, 1)
	say("呵呵，我这老骨头了，可练不成武功了。徒儿不必伤心，老了老了，一生起起落落，权势富贵，我都经历过了，也没有什么看不开的了。", 1140, 0, "曹公公")
	say("所谓叶落归根，我也该回去了。", 1140, 0, "曹公公")
	say("义父...", 0, 1)
	say("好了好了，你回去吧，义父今日累了。以后成也好，败也好，老师都管不了了，你自己小心。", 1140, 0, "曹公公")
	say("是，义父，孩儿永记义父的恩德。", 0, 1)
	say("呵呵，去吧去吧。", 1140, 0, "曹公公")
	say("是，孩儿告退。", 0, 1)
	dark()
	null(123, 101)
	null(123, 102)
	My_Enter_SubScene(123, 15, 15, 0)
	light()
	say("哎，任你如何英雄了得，又有什么区别，终归都是一样的，最后都化作一杯黄土，哎。", 0, 1)
	say("一夜无话...", 0, 2)
	dark()
	light()
	say("一个月后，太师已经离开，你逐渐掌握了朝廷局势", 0, 2)
	addtime(30)
	dark()
	light()
	say("为了处理国家大事，你每天都很忙。但是每一天，你都感觉到无尽的野心在你血脉深处涌动，你充满了斗志", 0, 1)
	dark()
	addevent(123, 95, 1, 8856, 1, 9606, -2, -2)
	light()

	if JY.Person[634].好感度 == 51 then
		addevent(128, 26, 0, 13533, 3, -2, -2, -2)
		addevent(128, 28, 0, 13533, 3, -2, -2, -2)
		addevent(128, 29, 0, 13533, 3, -2, -2, -2)
	end
end
OEVENTLUA[8856] = function ()
	Cls()

	local var_72_0 = {
		"户部侍郎纪大人",
		"大学士风大人",
		"吏部周大人",
		"翰林院张大人",
		"兵部尚书刘大人",
		"禁军统领高大人"
	}
	local var_72_1 = var_72_0[math.random(#var_72_0)]

	if JY.Person[741].好感度 < 105 then
		say("参见大人，今日朝会要开始了，请随我来。", 1164, 1, "卫士")
		say("走吧。", 0, 1)
		dark()
		My_Enter_SubScene(123, 31, 12, 3)
		addevent(123, 60, 0, -2, 0, 10604, -2, -2)
		addevent(123, 61, 0, -2, 0, 10604, -2, -2)
		addevent(123, 62, 0, -2, 0, 10604, -2, -2)
		addevent(123, 63, 0, -2, 0, 10604, -2, -2)
		addevent(123, 64, 0, -2, 0, 10608, -2, -2)
		addevent(123, 65, 0, -2, 0, 10608, -2, -2)
		addevent(123, 66, 0, -2, 0, 10608, -2, -2)
		addevent(123, 67, 0, -2, 0, 10608, -2, -2)
		light()
		say("今日有何事要奏？", 0, 1)
		say("臣有本奏。", 1257, 1, "大臣")
		dark()
		light()
		say("还有何人要奏？", 0, 1)
		say("臣有本奏。", 1259, 0, "大臣")
		dark()
		light()
		say("一天很快过去...", 0, 2)
		say("今日已晚，有本明日再奏。退朝！", 0, 1)
		say("是~", 0, 2)
		dark()
		null(123, 60)
		null(123, 61)
		null(123, 62)
		null(123, 63)
		null(123, 64)
		null(123, 65)
		null(123, 66)
		null(123, 67)
		null(123, 95)
		My_Enter_SubScene(123, 15, 15, 0)
		light()
		say("呼，好累，终于可以休息了。", 0, 1)
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人，" .. var_72_1 .. "来访。", 1164, 1, "卫士")
		say("啊？快快有请！", 0, 1)
		dark()
		null(123, 97)
		My_Enter_SubScene(123, 16, 15, 2)
		addevent(123, 95, 1, 0, 1, 10424, -2, -2)
		addevent(123, 96, 1, 0, 1, 9602, -2, -2)
		light()
		say("辅政大人，今日朝堂所议，臣还有一些想法。", 1257, 0, "大人")
		say("哦？很好。来人，摆上宴席，来，咱们边吃边说。", 0, 1)
		say("是。", 1164, 1, "卫士")
		dark()
		light()
		say("一夜很快过去...", 0, 2)
		addtime(1)
		dark()
		null(123, 95)
		null(123, 96)
		addevent(123, 95, 1, 8856, 1, 9606, -2, -2)
		light()

		JY.Person[741].好感度 = JY.Person[741].好感度 + 1
	else
		JY.YEAR = JY.YEAR + 2

		say("两年过去......", 0, 2)
		say("你凭借太师留下的权势，在朝堂已经是一言九鼎，无人敢于违抗", 0, 2)
		say("你下了指令，将父亲升任为福州知州，不过局势正是关键时候，你却没有时间回家探望父母", 0, 2)
		say("（这么久的经营，也该是时候了。）", 0, 1)
		say("来人啊。", 0, 1)
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人。", 1164, 1, "卫士")
		say("去请圣上过来。", 0, 1)
		say("是。", 1164, 1, "卫士")

		for iter_72_0 = 1, 40 do
			NewDrawString(-1, -1, "夺位剧情---开启", C_GOLD, CC.DefaultFont + iter_72_0 * 2)
			ShowScreen()

			if iter_72_0 == 40 then
				lib.Delay(2000)
			else
				lib.Delay(1)
			end
		end

		dark()
		null(123, 97)
		addevent(123, 95, 0, -2, 0, 7178, -2, -2)
		addevent(123, 96, 0, -2, 0, 10614, -2, -2)
		light()
		say("老奴拜见辅政大臣。", 1254, 0, "老太监")
		say("大哥哥，你找我有什么事啊？我正抄写字帖呢，今天要是抄不完娘又要骂我了。", 368, 0, "小皇帝")
		say("公公，我和皇上说一下体己话，你先下去休息吧。", 0, 1)
		say("是，老奴告退。", 1254, 0, "老太监")
		dark()
		null(123, 96)
		light()
		say("大哥哥，什么叫体己话？", 368, 0, "小皇帝")
		say("体己话啊，就是咱们是好哥们，你有啥为难的事我帮你做，我有啥为难的事你帮我做。", 0, 1)
		say("真的？你能帮我做吗？", 368, 0, "小皇帝")
		say("当然，你先说你有啥不想做的事？", 0, 1)
		say("我不想看书，不想学习，不想，嗯，不想每天早起，还有还有，不想每天到点睡觉。", 368, 0, "小皇帝")
		say("这么多啊，有点为难啊。", 0, 1)
		say("没有，就这些了，没有再多的了。", 368, 0, "小皇帝")
		say("好，我交你这个朋友，这个忙我就帮你了。", 0, 1)
		say("真的假的？你怎么帮啊？我娘可凶了。", 368, 0, "小皇帝")
		say("放心，我可以做到的，不但能做到，以后你想玩什么都行，想吃什么都没人敢管，你看怎么样？", 0, 1)
		say("好啊好啊，大哥哥你太伟大了。", 368, 0, "小皇帝")
		say("呵呵，不过我也要你帮一个忙，你愿不愿意帮？", 0, 1)
		say("没问题啊，咱们是好哥们。", 368, 0, "小皇帝")
		say("很好，明天我要你在一帮老头子面前说一句话，我身体不适，今传位于" .. JY.Person[0].姓名 .. "大人，他必能重振我朝声威。记下了吗？", 0, 1)
		say("记下了，还有啥？", 368, 0, "小皇帝")
		say("没有了，记住，无论他们问什么，你都说，这是朕的决定，不可更改。", 0, 1)
		say("简单，没问题。", 368, 0, "小皇帝")
		say("你再多背几遍，免得说错了。如果说错了，咱们的约定就没有作用了，你还得每天做作业，每天早起，每天", 0, 1)
		say("我背还不行吗。说话可得算数，不许变。", 368, 0, "小皇帝")
		say("放心。这是咱们两的秘密，不许告诉任何人，记住了吗？", 0, 1)
		say("记住了，大哥哥，我还想吃桂花糕，来一块，不，来两块。", 368, 0, "小皇帝")
		say("好，来人，带皇上下去，给皇上准备两块，不，准备一整盘的桂花糕。", 0, 1)
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("是，大人。", 1164, 0, "卫士")
		say("将禁军统领高将军请过来。", 0, 1)
		say("是。", 1164, 0, "卫士")
		dark()
		null(123, 95)
		null(123, 97)
		light()
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人，高将军到。", 1164, 0, "卫士")
		say("请进来。", 0, 1)
		say("是。", 1164, 0, "卫士")
		dark()
		addevent(123, 95, 1, 0, 1, 9602, -2, -2)
		light()
		say("末将拜见辅政大臣。", 1243, 0, "高将军")
		say("高将军快快请起。", 0, 1)
		say("大人有何吩咐。", 1243, 0, "高将军")
		say("明天你将议政厅周围全布置上咱们的人，有些人也该清理了。", 0, 1)
		say("遵命，大人请放心。", 1243, 0, "高将军")
		say("很好，你去安排吧。", 0, 1)
		say("是，末将告辞。", 1243, 0, "高将军")
		dark()
		null(123, 95)
		light()
		say("来人。", 0, 1)
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人。", 1164, 0, "卫士")
		say("将兵部尚书刘大人请过来。", 0, 1)
		say("是，大人。", 1164, 0, "卫士")
		dark()
		null(123, 97)
		light()
		say("大人，刘大人到。", 1164, 0, "卫士")
		say("请进来。", 0, 1)
		say("是。", 1164, 0, "卫士")
		dark()
		null(123, 97)
		addevent(123, 95, 1, 0, 1, 9602, -2, -2)
		light()
		say("刘大人。", 0, 1)
		say("末将拜见辅政大臣，不知大人找在下来是？", 1258, 0, "刘大人")
		say("刘大人，你是我最信任的人，明天我要处理一些人，你派兵封锁京城周边，以防万一。", 0, 1)
		say("是，大人放心，有我在京城，他们翻不出什么浪来的。", 1258, 0, "刘大人")
		say("这就好。", 0, 1)
		dark()
		null(123, 95)
		light()
		say("一夜很快过去...", 0, 2)
		addtime(1)
		dark()
		addevent(123, 97, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人，天已经亮了。", 1164, 0, "卫士")
		say("这么快，好吧，万事俱备，咱们进宫吧。", 0, 1)
		say("是，大人。", 1164, 0, "卫士")
		dark()
		My_Enter_SubScene(123, 14, 7, 2)
		addevent(123, 107, 0, -2, 0, 10614, -2, -2)
		light()
		say("龙公公，咱们开始吧。", 0, 1)
		say("是，大人。", 1254, 0, "老太监")
		say("你不劝劝我？", 0, 1)
		say("不用，太师说过，你所做之事我帮你即可，必会成功。", 1254, 0, "老太监")
		say("都料到了啊，不愧是我的老师。", 0, 1)
		dark()
		My_Enter_SubScene(123, 14, 7, 2)
		light()

		JY.Person[0].宋罪恶值 = 0

		say("我看看，不错不错，看着还挺帅的。", 0, 1)
		say("...", 1254, 0, "老太监")
		say("好吧，龙公公，宣他们上朝吧。", 0, 1)
		say("是，皇上。", 1254, 0, "老太监")
		dark()
		My_Enter_SubScene(123, 30, 9, 3)
		addevent(123, 60, 0, -2, 0, 10604, -2, -2)
		addevent(123, 61, 0, -2, 0, 10604, -2, -2)
		addevent(123, 62, 0, -2, 0, 10604, -2, -2)
		addevent(123, 63, 0, -2, 0, 10604, -2, -2)
		addevent(123, 64, 0, -2, 0, 10608, -2, -2)
		addevent(123, 65, 0, -2, 0, 10608, -2, -2)
		addevent(123, 66, 0, -2, 0, 10608, -2, -2)
		addevent(123, 67, 0, -2, 0, 10608, -2, -2)
		addevent(123, 78, 1, 0, 1, 10612, -2, -2)
		light()
		say("你刚一露面，下面议论之声就突然停止，不少大臣都露出震惊惊讶之色，但是更多亲近你的人则露出果然如此的了然之色", 0, 2)
		say("诸位，今日朝会要宣布一件大事，请皇上。", 0, 1)
		say("是，有请皇上上殿。", 1254, 0, "老太监")
		dark()
		My_Enter_SubScene(123, 31, 9, 3)
		addevent(123, 82, 0, -2, 0, 7162, -2, -2)
		light()
		say("有请皇上宣旨。（你偷偷使了一个眼色）", 0, 1)
		say("我身体不适，今传位于" .. JY.Person[0].姓名 .. "大人，他必能重振我朝声威。", 368, 0, "小皇帝")
		say("不可，皇上不可啊。", 1253, 1, "大臣")
		say("皇上，还请皇上收回成命。", 1251, 0, "大臣")
		say("这是朕的决定，不容更改。", 368, 1, "小皇帝")
		say("皇上，不可啊。", 1251, 0, "大臣")
		say("多谢皇上，请皇上放心，你的心愿我一定会帮你完成的，请皇上回宫歇息。", 0, 1)
		say("是，皇上，请跟我来。", 1254, 0, "老太监")
		dark()
		null(123, 78)
		null(123, 82)
		light()
		say("你这个逆贼，你不得好死！", 1253, 1, "大臣")
		say("来人，将他带下去。", 0, 1)
		say("是。", 1164, 0, "卫士")
		dark()
		null(123, 62)
		addevent(123, 84, 1, 0, 1, 10610, -2, -2)
		addevent(123, 74, 1, 0, 1, 9606, -2, -2)
		addevent(123, 76, 1, 0, 1, 9606, -2, -2)
		addevent(123, 85, 1, 0, 1, 9606, -2, -2)
		light()
		say("大人请。", 1164, 0, "卫士")
		say("先皇啊，微臣无能，不能保住你的江山，微臣无能啊。", 1253, 1, "大臣")
		dark()
		null(123, 74)
		null(123, 84)
		light()
		say("刚才是谁，御史大夫曹大人，你刚才也是反对皇上的旨意是吧？", 0, 1)
		say("我", 1251, 0, "大臣")
		say("曹大人左右张望了一下，看了看周围人的脸色", 0, 2)
		say("那个，我，我是说，皇上传位这种事应该安排得更严肃一些，皇上不可太草率了。", 1251, 0, "大臣")
		say("你应变倒是快，将他也带下去。", 0, 1)
		say("是。大人请。", 1164, 0, "卫士")
		say("饶命啊，大人，不，皇上饶命啊~", 1251, 1, "大臣")
		dark()
		null(123, 67)
		null(123, 76)
		null(123, 85)
		light()
		say("还有人有异议吗？", 0, 1)
		say("恭喜我皇登基。", 1257, 0, "大臣")
		say("恭喜我皇登基。", 1258, 1, "大臣")
		say("恭喜我皇。", 1260, 0, "大臣")
		say("皇上登基乃是大喜之事，需得安排祭天仪式，诏令天下，普天同庆。", 1259, 0, "大臣")
		say("很好，这事就交给你去办。", 0, 1)
		say("遵旨。", 1259, 0, "大臣")
		say("不知我皇可定下国号？", 1260, 0, "大臣")
		say("国号？这个？咱们是汉民族，就叫大汉吧，希望能恢复汉唐时的荣光。", 0, 1)
		say("是，即刻诏令天下，国号大汉。", 1260, 0, "大臣")
		dark()
		light()
		QZXS(JY.Person[0].姓名 .. "登基为帝")

		JY.Person[0].官阶 = 12
		JY.MONTH = JY.MONTH + 3

		say("3个月后...", 0, 2)
		dark()
		null(123, 60)
		null(123, 61)
		null(123, 63)
		null(123, 64)
		null(123, 65)
		null(123, 66)
		null(123, 78)
		My_Enter_SubScene(123, 16, 6, 2)
		addevent(123, 107, 1, 8860, 1, 10614, -2, -2)
		null(115, 24)
		null(1, 21)
		null(61, 21)
		light()
		say("大事已定。", 0, 1)
	end
end
OEVENTLUA[8860] = function ()
	Cls()
	say("皇上，诸位大臣已经在殿前候着，该去上朝了。", 1254, 0, "老太监")
	say("有劳龙公公了。", 0, 1)
	dark()

	JY.Person[0].官阶 = 12

	light()
	say("不错，穿上这个还算有点威仪，龙公公，咱们走。", 0, 1)
	say("是，皇上。", 1254, 0, "老太监")
	dark()
	My_Enter_SubScene(123, 30, 9, 3)
	addevent(123, 60, 0, -2, 0, 10604, -2, -2)
	addevent(123, 61, 0, -2, 0, 10604, -2, -2)
	addevent(123, 62, 0, -2, 0, 10604, -2, -2)
	addevent(123, 63, 0, -2, 0, 10604, -2, -2)
	addevent(123, 64, 0, -2, 0, 9604, -2, -2)
	addevent(123, 65, 0, -2, 0, 9604, -2, -2)
	addevent(123, 66, 0, -2, 0, 9604, -2, -2)
	addevent(123, 67, 0, -2, 0, 9604, -2, -2)
	addevent(123, 78, 1, 0, 1, 10612, -2, -2)
	light()
	say("各位卿家，今日有何事要奏？", 0, 1)
	say("臣有本奏。", 1257, 1, "大臣")
	dark()
	light()
	say("还有何人要奏？", 0, 1)
	say("禀太师，臣有本奏。", 1259, 0, "大臣")
	dark()
	light()
	say("一天很快过去...", 0, 2)
	say("今日已晚，各位卿家且回去歇息，有本明日再奏。", 0, 1)
	say("退朝！", 1140, 0, "曹公公")
	say("是~，臣等告退", 0, 2)
	dark()
	null(123, 60)
	null(123, 61)
	null(123, 62)
	null(123, 63)
	null(123, 64)
	null(123, 65)
	null(123, 66)
	null(123, 67)
	null(123, 82)
	My_Enter_SubScene(123, 16, 6, 2)
	light()
	say("你勤奋的操劳国事，很快...", 0, 2)
	addtime(30)

	JY.Person[0].宋罪恶值 = 0
end
OEVENTLUA[8901] = function ()
	Cls()

	if JY.Person[0].官阶 > 0 then
		say("来人了，王著，有种跟我到破锣巷，咱们一次解决恩怨。", 1036, 0, "喽啰")
		say("胡虎，你以为我怕你啊，走啊。", 1126, 0, "王著")
		dark()
		null(-2, 47)
		null(-2, 48)
		null(-2, 49)
		light()

		return
	end

	say("王著，这次看你还能往哪里逃？", 1036, 0, "喽啰")
	say("胡虎，你敢对我下黑手？这次只要我不死，必定会让你生不如死。", 1126, 0, "王著")
	say("你们在干什么？", 0, 1)
	say("猛虎帮办事，闲人都给我滚远点！", 339, 0, "小喽啰")
	say("这么嚣张？", 0, 1)
	say(JY.Person[0].称呼 .. "，赶快离开，这些都是些恶徒，和他们是没有道理可讲的。你赶快去福州客栈后面找一个外号叫快手的家伙，告诉他猛虎帮已经动手了。", 1126, 0, "王著")
	say("拦住他！", 1036, 0, "喽啰")

	if WarMain(362, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("王著，这次算你走运。我们走。", 1036, 0, "喽啰")
	dark()
	null(-2, 47)
	null(-2, 48)
	null(-2, 49)
	light()
	say(JY.Person[0].称呼 .. "好本事，不如加入我们帮会吧。", 1126, 0, "王著")
	say("？", 0, 1)
	say("别的不说，咱们在福州这个地界也是有些名气的，大伙儿都给些面子。以你的本事，以后必定能混的风生水起，威风八面。怎么样？", 1126, 0, "王著")

	if JY.Person[0].门派 > 0 then
		say("我已经有门派了。", 0, 1)
		say("真是可惜。", 1126, 0, "王著")
		say("多谢你救了我，这是我藏身的宝物，就送给你了。", 1126, 0, "王著")
		addthing(0)
		null(-2, 46)

		return
	end

	if yesno("要加入帮派嘛？") then
		say("好好，以后你就是我王著的兄弟，有肉咱们一块儿吃肉，有汤咱们一块儿喝汤。", 1126, 0, "王著")
		say("咱们现在加你一共有十二个兄弟，都是讲义气的好兄弟。回头我带你去见见他们。", 1126, 0, "王著")
		say("？？", 0, 1)
		say("一共才十二个人？", 0, 1)
		say("是啊，哦，是咱们负责这条街的兄弟，其他地区是其他兄弟负责，咱们帮派吗？总得有几百人吧，在福州也是有字号的，怎么样？还可以吧？", 1126, 0, "王著")
		say("有字号？", 0, 1)
		say("就是在官府也是挂了号的，江湖上有威名嘛。", 1126, 0, "王著")
		say("......", 0, 1)
		say("记住了，咱们帮派叫野狗帮，以后出去就报这个名号。", 1126, 0, "王著")
		say("叫啥？野狗帮？（突然觉得有些牙疼）", 0, 1)
		say("你怎么这个表情？咱们这名号可是有来历的，咱们帮的五个大佬都是孤儿，小时候都是和野狗争食才活下来的。后来功成名就了仍然不忘小时候的经历，所以建立了帮派就叫野狗帮，教导我们江湖争斗时刻要像快饿死的野狗一样凶狠，不狠就得饿死，明白了吧？", 1126, 0, "王著")
		say("......", 0, 1)
		say("这是我年轻时喜欢使用的武功，就传给你了。", 1126, 0, "王著")
		addthing(288)

		local var_74_0 = JY.Person[0].主功体

		stop_ng(0)

		JY.Person[0].武功1 = 173
		JY.Person[0].武功等级1 = 50

		star_ng(0, var_74_0)
		say("咱们现在赶快赶去福州客栈后面，那是咱们的一个聚集点，我这儿受到了追杀，只怕其他兄弟也有危险。", 1126, 0, "王著")
		say("好。", 0, 1)

		JY.Person[0].门派 = 21
		JY.Person[0].门派等级 = 21

		DrawStrBox(-1, -1, "王著随队行动", C_ORANGE, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
		addevent(128, 50, 1, 8902, 1, 5410, -2, -2)
		addevent(128, 51, 1, 8902, 1, 5408, -2, -2)
	else
		say("还是算了。", 0, 1)
		say("可惜，以后到福州碰见麻烦，就报我王著的名号，一般人还是会给些面子的。", 1126, 0, "王著")
		say("......", 0, 1)
	end

	null(-2, 46)
end
OEVENTLUA[8902] = function ()
	Cls()
	dark()
	addevent(128, 52, -2, -2, -2, 9234, -2, -2)
	light()
	say("王大哥，你怎么受伤了？", 338, 0, "喽啰")
	say("别提了，猛虎帮对我动手了，幸亏有这位" .. JY.Person[0].称呼 .. "在，要不恐怕今天就回不来了。", 1126, 0, "王著")
	say("他们居然敢对王大哥动手，我这就回去叫人。", 338, 0, "喽啰")
	say("等等，猛虎帮突然动手，只怕后面有什么阴谋，我先和帮主汇报下这事，看怎么处理才好？", 1126, 0, "王著")
	say("对了，这位" .. JY.Person[0].称呼 .. "是新入帮的兄弟，快手，一会你带他去收下保护费，让他也熟悉一下咱们的情况。", 1126, 0, "王著")
	say("好的，大哥。", 266, 0, "快手")
	say("最近大家伙出门都警醒点，别让猛虎帮找到机会。好了，老二，咱们走。", 1126, 0, "王著")
	say("是，大哥。", 338, 0, "喽啰")
	null(-2, 51)
	null(-2, 52)
	say(JY.Person[0].称呼 .. "，咱们走，这次去那家药铺里收保护费，嗯，你长得太文弱了，表情要凶一点儿，像这样。", 266, 0, "快手")
	say("好。", 0, 1)
	null(-2, 50)
	DrawStrBox(-1, -1, "快手随队行动", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	addevent(128, 55, 0, 8903, 3, -2, -2, -2)
	addevent(128, 56, 0, 8903, 3, -2, -2, -2)
	addevent(128, 53, 0, 0, 0, 10328, -2, -2)
	addevent(128, 54, 0, 0, 0, 10328, -2, -2)
end
OEVENTLUA[8903] = function ()
	Cls()
	dark()
	null(-2, 55)
	null(-2, 56)
	light()
	say("可恶，是猛虎帮那些家伙。", 266, 0, "快手")
	My_Enter_SubScene(128, 35, 22, 0)
	addevent(128, 57, 0, 0, 0, 5408, -2, -2)
	say("你们这帮混蛋，到这儿干什么？这可是我们野狗帮的地盘。", 266, 0, "快手")
	say("那又怎样？从今儿起这儿就是我们的地盘了。", 339, 0, "小喽啰")
	say("你们想挑起两帮大战么？是不是有了什么后援？", 266, 0, "快手")
	say("嘿嘿，你就是那个救了王著的家伙？胡虎回去说你多么多么厉害，看你这小样？这文文弱弱的，我是不信的，今儿就称量称量你。", 339, 0, "小喽啰")
	say("哦？就凭你们这几个人？", 0, 1)
	say("兄弟们，出来吧，这位" .. JY.Person[0].称呼 .. "看不起咱们呢~", 339, 0, "小喽啰")

	if WarMain(363, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("怎么样？服了吗？", 0, 1)
	say("我们走。", 339, 0, "小喽啰")
	dark()
	null(-2, 53)
	null(-2, 54)
	light()
	say("好身手。这次我们大哥是捡到宝了。", 266, 0, "快手")
	My_Enter_SubScene(128, 35, 22, 2)
	say("大哥你客气了。", 0, 1)
	say("别别，你叫我快手就行。", 266, 0, "快手")
	say("老板，交保护费了。快拿过来。", 266, 0, "快手")
	My_Enter_SubScene(128, 35, 22, 0)
	say("我，我刚交了啊。", 1022, 0, "药店掌柜")
	say("交给谁了？", 266, 0, "快手")
	say("就是刚才那两个人。", 1022, 0, "药店掌柜")
	say("那个不算，快交过来。", 266, 0, "快手")
	say("大兄弟，实在是交不出了，刚才就将这个月挣的钱都交光了，你看能不能通融一下。", 1022, 0, "药店掌柜")
	say("放屁。我给你通融谁给我通融，你想让我回去被老大打死吗？快交！", 266, 0, "快手")
	say("兄弟，来，凶狠点。", 266, 0, "快手")
	say("快交，不然揍你。", 0, 1)
	say("等我找找，这儿，这是82两银子，剩下的18两银子实在是拿不出了，你看下个月再交可不可以。", 1022, 0, "药店掌柜")
	say("那怎么行？你这些药材包起来，作为抵当，快点。", 266, 0, "快手")
	say("是是。", 1022, 0, "药店掌柜")
	dark()
	light()
	say(JY.Person[0].称呼 .. "，来，这些你拿着。", 266, 0, "快手")
	say("这...，这合适吗？", 0, 1)
	say("有啥不合适的，拿着。", 266, 0, "快手")
	addthing(209, 5)
	say("好了，这周咱们就没有其他差使了，下来就自己玩。这是你这个月的花销，不要舍不得花，下个月还有。", 266, 0, "快手")
	say("这就完事了？", 0, 1)
	say("完事了，有空就去客栈后面，咱们一般有事就在那儿聚会。对了，最近出门也注意点，小心他们报复回来。", 266, 0, "快手")
	say("好。", 0, 1)
	dark()
	null(-2, 57)
	light()

	JY.Person[0].门派贡献 = JY.Person[0].门派贡献 + 2
	JY.Person[0].门派等级 = 22
end
