OEVENTLUA[1501] = function ()
	Cls()
	meet_self(600)
	say("一呀摸，二呀摸，摸到姐姐的头发边……唉，我韦小宝什么时候能离开这里，一定要发大财，取一堆漂亮老婆，开个特大的妓院，哈哈……", 225, 0, "韦小宝")
	Cls()

	if instruct_9() == false then
		Cls()

		return
	end

	instruct_26(1, 10, 1, 0, 0)
	instruct_26(1, 7, 1, 0, 0)

	if JY.Person[0].性别 == 0 then
		say("出去玩？＜这个家伙看着好像挺能打的，跟着他不会吃亏……我娘现在不在这……哈哈，就这么定了……＞好啊，出去找漂亮老婆，好爽好爽。", 225, 0, "韦小宝")
	else
		say("出去玩？＜这个姑娘看着好像挺能打的，跟着她不会吃亏……我娘现在不在这……哈哈，就这么定了……＞好啊，出去找漂亮老婆，好爽好爽。", 225, 0, "韦小宝")
	end

	Cls()
	DrawStrBoxWaitKey("韦小宝随队行动", C_ORANGE, CC.DefaultFont, 2)
	null(-2, 0)
	addevent(-2, 2, 0, 1502, 3, -2)
	addevent(-2, 12, 1, nil, nil, 8884)
	addevent(-2, 17, 1, nil, nil, 8634)
	addevent(-2, 18, 1, nil, nil, 8634)
	addevent(-2, 139, 1, nil, nil, 10596)
end
OEVENTLUA[1502] = function ()
	Cls()
	dark()
	null(-2, 2)
	light()
	say("都让开，都让开！给我抓住陈近南，不要让他跑了！", 1053, 0, "官兵")
	say("陈近南，这儿都让官兵重重包围了，你要想减少死伤，就赶快出来投案自首！", 1053, 0, "官兵")
	say("哎呀，清廷的官兵怎么都跑这儿来了。", 225, 1, "韦小宝")
	say("奉朝廷旨意，协助友邦擒拿要犯，闲人退避。", 221, 0, "捕快")
	say("我的姥姥，咱们快躲远一点儿。", 225, 1, "韦小宝")
	say("哎呀！", 225, 1, "韦小宝")
	say("小兄弟，你没事吧？", 268, 0, "陈近南")
	say("没事没事，快让开。", 225, 1, "韦小宝")
	say("咳咳，小兄弟，这儿有没有后门。", 268, 0, "陈近南")
	instruct_3(69, 13, 1, 0, 0, 0, 0, 7022, 7022, 7022, -2, -2, -2)
	meet_self(587)
	meet_self(588)
	say("啊，陈大侠，小人拜见陈当家。", 269, 1, "茅十八")
	say("哎，你这老黑，快让开。", 225, 0, "韦小宝")
	say("咳咳，小兄弟，现在这儿都被官兵围住了，出不去了，可有后门？", 268, 1, "陈近南")
	say("倒霉，怎么办？怎么办？，有了。", 225, 0, "韦小宝")
	say("快，这后面是我们妓院阿黄经常往外跑的洞口，咱们赶快从这儿跑出去吧。", 225, 0, "韦小宝")
	say("阿黄？", 268, 1, "陈近南")
	say("哦，是我养的一条黄狗，老在外面偷肉吃，不过就听我的话。", 225, 0, "韦小宝")
	say("什么，你要陈大侠钻钻狗洞？", 269, 1, "茅十八")
	say("陈大侠，如今事态紧急，没有什么不可以的，想当年韩信...", 0, 0)
	say("这位" .. JY.Person[0].称呼 .. "说的对，我走了，多谢各位，容当后报。", 268, 1, "陈近南")
	null(-2, 12)
	instruct_3(69, 14, 1, 0, 0, 0, 0, 8658, 8658, 8658, -2, -2, -2)
	say("你们都围在这儿做什么？嗯，那是谁？抓住陈近南，陈近南跑了！来人啊~", 318, 0, "官兵")
	say("陈大侠，今日就是拼了这条命我也帮你拖住这些官兵。", 269, 1, "茅十八")
	say("" .. JY.Person[0].称呼 .. "，你快挡一挡。", 225, 0, "韦小宝")

	if JY.Person[0].性别 == 0 then
		say("喂！大个儿们！我这个朋友说你们都是垃圾，他一个能打赢你们两个！", 225, 4, "韦小宝")
	else
		say("喂！大个儿们！我这个朋友说你们都是垃圾，她一个能打赢你们两个！", 225, 4, "韦小宝")
	end

	say("什么！你找死！", 318, 0, "官兵")

	if JY.Person[0].性别 == 0 then
		say("兄弟，我来帮你。", 269, 1, "茅十八")
	else
		say("姑娘，我来帮你。", 269, 1, "茅十八")
	end

	say("你就别捣乱了，快去守住洞口。", 225, 0, "韦小宝")
	null(-2, 0)
	null(-2, 13)

	if WarMain(300) == false then
		instruct_15(0)
		instruct_0()

		do return end

		Cls()
	end

	null(-2, 17)
	null(-2, 18)
	null(-2, 14)
	say("妈呀，好凶悍的强人，赶快去禀报参将大人。", 221, 0, "捕快")
	null(-2, 139)
	say("呼，再多待会，官兵就会越来越多了，我也赶快走吧。", 0, 1)
	say("小兄弟，咱们也赶快走吧。咦，都跑得好快，这小兄弟有点滑溜啊，连那黑大汉居然也跟着跑了。", 0, 1)

	JY.Person[0].宋罪恶值 = JY.Person[0].宋罪恶值 + 10

	DrawStrBoxWaitKey("你勾结乱党，你被南朝官府通缉了", C_ORANGE, CC.DefaultFont, 2)
	addevent(107, 0, 0, 1503, 3)
	addevent(107, 3, 1, nil, nil, 7022)
	addevent(107, 4, 1, nil, nil, 8632)
	addevent(107, 7, 1, nil, nil, 8660)
	addevent(107, 8, 1, nil, nil, 8632)
end
OEVENTLUA[1503] = function ()
	Cls()
	instruct_30(21, 50, 21, 35)
	say("茅十八，这下逃不掉了吧，乖乖的跟本副总管走吧！", 221, 0, "瑞栋")
	say("茅十八，你怎么在这儿？", 0, 1)
	say("嗯？还有同党？给我一同拿下！", 221, 0, "瑞栋")

	if WarMain(261, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	null(-2, 4)
	null(-2, 7)
	null(-2, 8)
	instruct_37(1)

	JY.Person[0].清罪恶值 = JY.Person[0].清罪恶值 + 100

	DrawStrBoxWaitKey("你击杀了大内高手", C_ORANGE, CC.DefaultFont, 2)
	DrawStrBoxWaitKey("你被清朝官府通缉了", C_ORANGE, CC.DefaultFont, 2)
	light()
	say("这是什么？", 0, 1)
	addthing(143)
	say("好运气啊好运气。", 0, 1)
	My_Enter_SubScene(107, 17, 35, 0)
	say(JY.Person[0].称呼 .. "，多谢你了。", 269, 0, "茅十八")
	say("茅大哥客气了，你怎么伤的这么重？", 0, 1)
	say("这说来惭愧……如此如此……这般这般……后来小宝毒瞎了那老太监，自己扮成小太监，让我先逃了出来。", 269, 0, "茅十八")
	say("原来如此，那小宝现在人呢？", 0, 1)
	say("他现在还在宫里，可惜我现在行动不便，连个侍卫都打不过，真不知道如何救他……", 269, 0, "茅十八")
	say("茅兄先去我的小村养伤吧，救小宝的事情，我再想想办法。", 0, 1)
	dark()
	null(-2, 3)
	instruct_3(70, 88, 1, 0, 1681, 0, 0, 7022, 7022, 7022, -2, -2, -2)
	null(-2, -2)
	light()

	if has_thing(318) == false then
		say("这进皇宫可不容易，先周围转转，看有没有什么办法？", 0, 1)
	end
end
OEVENTLUA[1504] = function ()
	Cls()

	if instruct_16(588) then
		if has_thing(318) == false then
			say("老板，跟你打听点事？", 0, 1)
			say("要买啥就说，其他的该说的我说，不说的不能说。", 1022, 0, "钱老板")
			say("老板，是这样，我兄弟被抓进皇宫了，我想进去探望，不知你可有办法？", 0, 1)
			say("搞啥？我一个卖杂货的，能知道怎么混进皇宫吗？那还想不想活了。", 1022, 0, "钱老板")
			say("知道就说，那么大声干什么？", 269, 0, "茅十八")
			say("你是谁？我怎么看你有点面熟呢？", 1022, 0, "钱老板")
			say("我就是茅十八，通缉令上的画像就是我。", 269, 0, "茅十八")
			say("~", 0, 1)
			say("哎呀，茅爷。就是你救了韦小宝韦少爷。", 1022, 0, "钱老板")
			say("啥少爷，那是我的兄弟。", 269, 0, "茅十八")
			say("小人见过茅爷，茅爷，你们要进皇宫难道是为了见韦少爷。", 1022, 0, "钱老板")
			say("那是。", 269, 0, "茅十八")
			say("不敢瞒茅爷，小人是天地会的，在京城做些小生意，要进皇宫也不是没办法，不过可能需要些花费。", 1022, 0, "钱老板")
			say("要多少花费？", 0, 1)
			say("需要白银2000两左右。", 1022, 0, "钱老板")

			if DrawStrBoxYesNo(-1, -1, "要给这些银子吗？", C_WHITE, CC.DefaultFont) then
				if instruct_31(2000) == false then
					say("你的银子不够啊。", 1022, 0, "钱老板")
					Cls()

					return
				end

				say("今天下午有一批雕翎花猪要送进皇宫，你们扮作送货进去，将花猪送入到御膳房。", 1022, 0, "钱老板")
				say("好，这就乔装改扮，送猪进京。", 0, 1)
				addthing(319, 1)
				Cls()
				instruct_32(174, -2000)
				say("咱们快去救韦兄弟去。", 269, 0, "茅十八")
				say("这趟活儿做完，我这生意也不能做了，几位，告辞。", 1022, 0, "钱老板")
				dark()
				null(-2, 9)
				null(-2, 10)
				null(-2, 12)
				addevent(-2, 78, 1, 1505, 1, -2)
				light()
			end
		else
			say("老板，和你打听一个人，你知道我的韦兄弟在哪里吗？", 269, 0, "茅十八")
			say("原来是茅爷，你说的韦兄弟可是韦少爷？", 1022, 0, "钱老板")
			say("啥少爷，那是我的兄弟。", 269, 0, "茅十八")
			say("韦兄弟奉总舵主之令，混入皇宫去了。", 1022, 0, "钱老板")
			say("皇宫啊，这可怎么找？这么久没见，实在是不能放心。", 269, 0, "茅十八")
			say("这倒是正好，今天下午有一批雕翎花猪要送进皇宫，你们扮作送货进去御膳房，将花猪交给厨师，他就明白了，会帮你们的。", 1022, 0, "钱老板")
			say("啥？连皇宫的厨师也是你们的人？", 269, 0, "茅十八")
			say("嘘，小点声，这趟活儿做完，我这生意也不能做了，几位，告辞。", 1022, 0, "钱老板")
			addthing(319, 1)
			say("咱们快去救韦兄弟去。", 269, 0, "茅十八")
			dark()
			null(-2, 9)
			null(-2, 10)
			null(-2, 12)
			addevent(-2, 78, 1, 1505, 1, -2)
			light()
		end
	else
		say("本店独家售卖高档烹煮调料香料了，松茸，松露什么的可都有，客官你要什么？", 1022, 0, "钱老板")
	end
end
OEVENTLUA[1505] = function ()
	Cls()

	if has_thing(319) and inteam(588) then
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
		say("官爷，小弟是给御膳房送定制的雕翎花猪的。", 0, 1)
		say("我看看，果然是雕翎花猪，你们进去吧。", 300, 0, "皇宫禁卫")
		say("是，官爷。", 0, 1)
		dark()
		My_Enter_SubScene(108, 31, 51, 0)
		light()
		addevent(-2, 41, 0, 1508, 3)
		addevent(-2, 31, 1, 1509, 1, -2)
	elseif instruct_16(600) then
		say("让开！", 225, 0, "韦小宝")
		say("是，韦大人。韦大人，你老走好。", 300, 0, "皇宫禁卫")
		dark()
		My_Enter_SubScene(108, 31, 51, 0)
		light()
	elseif has_thing(318) then
		say("这是通行令牌。", 0, 1)
		say("你可以过去了。", 300, 0, "皇宫禁卫")
		dark()
		My_Enter_SubScene(108, 31, 51, 0)
		light()
	elseif JY.Person[0].清罪恶值 >= 500 then
		say("站住，你怎么长得有点像这一阵在通缉的通缉犯？", 300, 0, "皇宫禁卫")
		say("我不是，你看错了。", 0, 1)
		say("快离开，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
	else
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
	end
end
OEVENTLUA[1506] = function ()
	Cls()

	if has_thing(319) then
		say("大师傅，你定制的雕翎花猪送来了。", 0, 1)
		say("哦，放那边吧。", 257, 0, "厨子")
		say("好的，大师傅，你知道有个叫韦小宝的小太监在哪吗？", 0, 1)
		say("他啊，不在他的房间里的话，那多半在御书房吧。", 257, 0, "厨子")
		say("大师傅，我走了，下次再来看你。", 0, 1)
		say("好，好。", 257, 0, "厨子")
		addthing(319, -1)
		addevent(-2, 40, 1, 1507, 1, 8648)
	else
		say("大师傅，你做的菜真香。", 0, 1)
		say("呵呵呵，多看看，你也可以的。", 257, 0, "厨子")
	end
end
OEVENTLUA[1507] = function ()
	Cls()
	say("小宝，你在这儿啊。", 0, 1)
	say("小宝，我们来救你来了。", 269, 0, "茅十八")
	say("" .. JY.Person[0].称呼 .. "大侠，茅大哥，你们怎么进来了？", 225, 1, "韦小宝")
	say("当然是来救你出去了，小宝，咱们快走吧。", 269, 0, "茅十八")
	say("" .. JY.Person[0].称呼 .. "大侠，茅大哥，我太感动了，不过我还不能走。", 225, 1, "韦小宝")
	say("为啥？", 269, 0, "茅十八")
	say("好吧，其实我是天地会的香主，奉我师父之命，进入皇宫打探重要的秘密。", 225, 1, "韦小宝")
	say("你师父？", 0, 0)
	say("陈近南大侠已经收了我做徒弟了。你们来的正好，帮我在皇宫找一件东西，我师父说这个东西对反清复明有大用。", 225, 1, "韦小宝")
	say("好，陈舵主的事我们一定帮，回头你和陈舵主说说，也收收我做徒弟呗。", 269, 0, "茅十八")
	say("~", 0, 1)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(600)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 225, 0, "韦小宝")
		Cls()

		return
	end
end
OEVENTLUA[1508] = function ()
	Cls()

	if inteam(600) then
		dark()
		addevent(-2, 44, 1, nil, nil, 8614)
		addevent(-2, 45, 1, nil, nil, 8634)
		addevent(-2, 46, 1, nil, nil, 8634)
		addevent(-2, 43, 1, nil, nil, 8612)
		light()
		say("海大富，太后有命，要你交出那本书，你敢抗旨？", 258, 0, "太监总管")
		say("老奴不敢，老奴是个瞎子，不知道什么书不书的？我这儿也没有什么书。", 313, 1, "海大富")
		say("大胆，给我搜。~", 258, 0, "太监总管")
		say("咳~咳~", 313, 1, "海大富")
		say("＜那叫海大富的老太监突然动手，居然几下就将几人都点到，那太监总管眼看不是路，急叫“太后救命”＞", 0, 2)
		say("＜突然窗外窜出一个人来，与海大富对了一掌，反手抓起太监总管窜出窗外＞", 0, 2)
		say("太后？", 313, 0, "海大富")
		dark()
		null(-2, 44)
		null(-2, 45)
		null(-2, 46)
		light()
		say("咳~咳~还是老了啊？", 313, 0, "海大富")
		say("咳~咳~小宝啊，你带人来陪本公公玩来了？", 313, 0, "海大富")
		say("海公公，想不到，书居然在你这里。", 225, 1, "韦小宝")
		say("你也要这本书？还带了几个人来，以为就能对付我吗？", 313, 0, "海大富")
		say("本来没有把握，不过我看你刚才使了不少力气，现在喘气像风箱似的，你也该休息休息了。", 225, 1, "韦小宝")
		say("真想不到皇宫里面还有这样的瞎子高手。", 0, 1)
		say("咳~咳~年轻人真不懂礼貌！", 313, 1, "海大富")

		if WarMain(259, 0) == false then
			instruct_15()
			Cls()

			return
		end

		dark()
		null(-2, 41)
		null(-2, 43)
		light()
		say("＜这老太监好厉害＞", 0, 1)
		say("咦，这老太监掉了什么东西？", 0, 1)
		addthing(318)
		say("我们好好找找，看太后她们是要什么书？", 225, 0, "韦小宝")
	end
end
OEVENTLUA[1509] = function ()
	Cls()

	if instruct_16(600) then
		say("找到了，在这儿呢。", 225, 0, "韦小宝")

		if has_thing(228) then
			say("又是半部《四十二章经》？这下我正好可以凑成一部了。", 225, 1, "韦小宝")
			addthing(229, 1)
			instruct_32(228, -1)
			instruct_39(90)
		else
			addthing(228, 1)
		end

		say("小宝，这是什么书？怎么大家都来抢啊？", 0, 1)
		say("这是什么书我也不知道，不过我师父说里面藏着清廷的大秘密，我一定要找到。", 225, 0, "韦小宝")
		say("几位帮我大忙了，皇上命我去查抄鳌拜府，大家一起去，一起发财发财。", 225, 0, "韦小宝")

		if JY.Person[601].好感度 == 0 then
			say("皇上？我怎么听说前段时间皇宫出事了啊？", 0, 1)
			say("这你也知道？已经换了一个了，而且神神秘秘的，听说前一阵秘密出京去了。", 225, 0, "韦小宝")
			say("这样？干什么去了？", 0, 1)
			say("那谁知道？谁敢问啊。现在是三大顾命大臣执掌京师事务。", 225, 0, "韦小宝")
		else
			say("小宝你真讲义气，对了，咱们在皇宫逛半天了，怎么没有见到皇上？", 0, 1)
			say("皇上啊，前一阵秘密出京去了。", 225, 0, "韦小宝")
			say("干什么去了？", 0, 1)
			say("那谁知道？谁敢问啊。现在是三大顾命大臣执掌京师事务。", 225, 0, "韦小宝")
		end

		null(-2, 31)
		addevent(-2, 50, 0, 1534, 3)
		addevent(-2, 30, 0, -2, -2, 8664)
		addevent(-2, 39, 0, -2, -2, 7266)
	end
end
OEVENTLUA[1510] = function ()
	Cls()

	if instruct_16(600) then
		say("好了，这儿没有你们什么事了，都离开吧。", 225, 0, "韦小宝")
		say("是，韦大人！", 222, 1, "官兵")
		null(107, 13)
		null(107, 14)
	else
		say("官府重地，闲人闪避！", 222, 0, "官兵")
	end
end
OEVENTLUA[1511] = function ()
	My_Enter_SubScene(107, 22, 8, 3)
end
OEVENTLUA[1512] = function ()
	My_Enter_SubScene(110, 27, 28, 0)
end
OEVENTLUA[1513] = function ()
	My_Enter_SubScene(107, 13, 11, 3)
end
OEVENTLUA[1514] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(174, 5000)
	Cls()
	Cls()
end
OEVENTLUA[1515] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(174, 5000)
end
OEVENTLUA[1516] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(60, 1)
	Cls()
	Cls()
end
OEVENTLUA[1517] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(174, 5000)
	Cls()
	Cls()
end
OEVENTLUA[1518] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	addthing(56, 1)
	Cls()
end
OEVENTLUA[1519] = function ()
	Cls()

	if instruct_16(600) then
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
		say("小宝，咱们进去看看。", 0, 0)
		say("让开！", 225, 0, "韦小宝")
		say("是，韦大人。韦大人，你老走好。", 300, 0, "皇宫禁卫")
		dark()
		My_Enter_SubScene(108, 1, 28, 0)
		light()
	else
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
	end
end
OEVENTLUA[1520] = function ()
	if instruct_16(600) then
		say("小宝，咱们出去吧。", 0, 0)
		say("让开！", 225, 0, "韦小宝")
		say("是，韦大人。韦大人，你老走好。", 300, 0, "皇宫禁卫")
		dark()
		My_Enter_SubScene(108, 1, 34, 3)
		light()
	else
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
	end
end
OEVENTLUA[1521] = function ()
	Cls()
	say("陈当家，你怎么被关在这儿了？", 0, 1)
	say("哎，真是一言难尽啊。", 75, 0)
	say("我们先将你救出来再说吧。", 0, 1)
	say("小宝，只怕为难你了。", 0, 1)
	say("咱们兄弟义气，哪能见死不救的！走吧。", 225, 0, "韦小宝")
	say("陈当家，霍青桐姑娘呢？", 0, 1)
	say("进宫之前我将她安排在我天地会的分舵了，也不知道如今怎么样了。", 75, 0)
	say("咱们先出去再说！走吧。", 225, 1, "韦小宝")

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 0, 2)

		return
	end

	null(-2, 29)
	instruct_10(75)
	instruct_37(1)
	addevent(107, 15, 1, 1522, 1, 7004, -2, -2)
	null(107, 36)
	null(-2, 28)
end
OEVENTLUA[1522] = function ()
	Cls()
	say("青桐妹子。", 75, 1)
	addevent(107, 54, 1, 0, 1, 7050, -2, -2)
	say("陈公子，你回来了。出什么事了？", 74, 0)
	say("哎，此事当真离奇。如今的当今圣上是我的亲哥哥。", 75, 1)
	say("什么？", 74, 0)

	if JY.Person[601].好感度 == 0 then
		say("（皇帝是陈兄的哥哥？这下糟了，皇帝已经被我杀了，只怕现在宫内众皇子还在争执不下，这可如何与陈兄弟说）", 0, 1)
		say("（算了，且走一步看一步，我自问做事无愧于心）", 0, 1)
		say("正是，我已经看过爹娘遗物，确然无疑。", 75, 0)
		say("那你怎么会被关起来了？", 74, 0)
		say("我当时知道他是我哥哥后，心中十分高兴，便劝他驱除鞑子，复我汉室江山。他也十分意动，向我问了半天情况。", 75, 0)
		say("然后他说先要办一件大事，要我先忍耐一下，就安排人将我秘密关起来了。", 75, 0)
		say("？？？", 0, 1)
		say("他没有说，不过我观他意向，确是不甘平凡，想要开创一番秦唐汉武的伟绩来。", 75, 0)
		say("陈公子，只怕这件事情信不过。他是当今鞑子的皇上，要推翻鞑子，岂不是说要他推翻自己？", 74, 1)
		say("哎，我也不知道他怎么想的，但总是对我们恢复我们汉人江山有帮助吧，总是个希望。", 75, 0)
		say("...", 0, 1)
		say("陈兄下来作何打算？", 0, 1)
		say("我先回红花会和众位哥哥汇合，再商大计。", 75, 0)
		say("" .. JY.Person[0].称呼 .. "，你和我一起去如何？", 75, 0)
		say("我还有事要办，陈兄，咱们后会有期。", 0, 1)
		say("（我就不和你走了。等你发现我杀了你哥哥，嘴上不说，只怕你心里还是怪我的，以后咱们后会无期了）", 0, 1)
		say("好，后会有期。", 75, 0)
		null(-2, 15)
		null(107, 54)
		instruct_21(75)
		null(70, 37)
		instruct_21(74)
		null(70, 36)
	else
		say("竟有此事？", 0, 1)
		say("正是，我已经看过爹娘遗物，确然无疑。", 75, 0)
		say("那你怎么会被关起来了？", 0, 1)
		say("我当时知道他是我哥哥后，心中十分高兴，便劝他驱除鞑子，复我汉室江山。他也十分意动，向我问了半天情况。", 75, 0)
		say("然后他说先要办一件大事，要我先忍耐一下，就安排人将我秘密关起来了。", 75, 0)
		say("这是什么意思？", 0, 1)
		say("他没有说，不过我观他意向，确是不甘平凡，想要开创一番秦唐汉武的伟绩来。", 75, 0)
		say("陈公子，只怕这件事情信不过。他是当今鞑子的皇上，要推翻鞑子，岂不是说要他推翻自己？", 74, 1)
		say("哎，我也不知道他怎么想的，但总是对我们恢复我们汉人江山有帮助吧，总是个希望。", 75, 0)
		say("" .. JY.Person[0].称呼 .. "，咱们现在该当如何？", 75, 0)
		say("我不知道他为什么要将你关起来，却又没有杀你，但是你从牢里出来了，想必他很快就会知道。", 0, 1)
		say("现在他不在京城，咱们正可以先做些准备，以防万一。你先回帅府，调集精兵强将，咱们要尽快行动。", 0, 1)
		say("好。", 75, 0)
		say("我一会去帅府和你汇合。", 0, 1)
		null(-2, 15)
		null(107, 54)
		null(-2, 28)
		null(-2, 30)
		instruct_21(75)
		null(70, 37)
		instruct_21(74)
		null(70, 36)
		addevent(107, 60, 1, 1523, 1, 9196, -2, -2)
		addevent(107, 61, 1, 1523, 1, 7004, -2, -2)
	end
end
OEVENTLUA[1523] = function ()
	Cls()

	if instruct_16(600) then
		say("陈兄。", 0, 1)
		say("" .. JY.Person[0].称呼 .. "，你来了。", 75, 0)
		say("小宝，你前面说现在是三大顾命大臣共同执掌朝政？", 0, 1)
		say("是啊，本来是四个的，有索尼﹑苏克萨哈﹑遏必隆﹑鳌拜，后来鳌拜被皇上给杀了，就剩下三个了。", 225, 0, "韦小宝")
		say("这三大顾命大臣都是什么性格的？", 0, 1)
		say("这三个？都是那个老奸巨猾的？不够滑头的那个已经死了。", 225, 0, "韦小宝")
		say("老奸巨猾？老奸巨猾好啊。你知道皇宫的圣旨在什么地方吧？", 0, 1)
		say("那当然知道，不过没有皇帝的玉玺，就没什么用了？", 225, 0, "韦小宝")
		say("" .. JY.Person[0].称呼 .. "，你这是要？", 75, 0)
		say("陈兄，你说过要复我汉室江山，愿意陪我再来一次大的冒险吗？", 0, 1)
		say("那是自然。", 75, 0)
		say("好，今晚你将勤政殿都安排上咱们的人，御林军和城卫军也尽量换上咱们的人。", 0, 1)
		say("城卫军没有问题，大半都是咱们的人了，不过御林军大部分都是满人，却难以安排那么多咱们的兄弟。", 75, 0)
		say("不能排那么多咱们的兄弟？那就把满人都调开，咱们都安排高手扮作御林军去。", 0, 1)
		say("小宝，你回宫去拟一份圣旨，就写皇帝因为还有要事不能回京，命福康安为大清摄政王代为执政，三大顾命大臣要全力协助云云。去吧。", 0, 1)
		say("" .. JY.Person[0].称呼 .. "大侠？", 225, 0, "韦小宝")
		say("怎么，有困难？", 0, 1)
		say("困难倒是没有？不过我不识字啊？", 225, 0, "韦小宝")
		say("这个简单，我请三哥陪你一起去就是。", 75, 0)
		say("好啊。", 225, 0, "韦小宝")
		say("陈兄，这次你可要凶恶一点才行，咱们这就见见几位顾命大臣，如此如此。", 0, 1)
		say("明白。", 75, 0)
		dark()
		null(107, 60)
		null(107, 61)
		addevent(108, 13, 1, 1526, 1, 9196, -2, -2)
		addevent(108, 15, 1, 1526, 1, 7004, -2, -2)
		addevent(108, 16, 1, -2, 1, 8668, -2, -2)
		addevent(108, 19, 1, -2, -2, 8608)
		addevent(108, 21, 1, -2, -2, 8608)
		addevent(108, 24, 1, -2, -2, 8608)
		addevent(108, 18, 1, -2, -2, 8608)
		addevent(108, 25, 1, -2, -2, 8608)
		addevent(108, 26, 1, -2, -2, 8638)
		addevent(108, 17, 1, -2, -2, 8638)
		addevent(108, 51, 1, -2, -2, 8638)
		My_Enter_SubScene(108, 48, 26, 0)
		light()
		say("第二天", 0, 2)

		for iter_23_0 = 1, 40 do
			NewDrawString(-1, -1, "篡清剧情---开启", C_GOLD, CC.DefaultFont + iter_23_0 * 2)
			ShowScreen()

			if iter_23_0 == 40 then
				lib.Delay(1500)
			else
				lib.Delay(1)
			end
		end

		say("圣旨到~", 225, 0, "韦小宝")
		say("微臣接旨。", 1025, 1, "索尼")
		say("微臣接旨。", 316, 0, "苏克萨哈")
		say("微臣接旨。", 1148, 1, "遏必隆")
		say("奉天承运~，皇帝诏曰~，朕有要事暂不能回京，特命福康安为大清摄政王，代为执政，各位顾命大臣，要全力协助不可有违。钦此~", 225, 0, "韦小宝")
		say("这是怎么回事？这圣旨是真的假的？", 362, 1, "遏必隆")
		say("大胆~，遏必隆，你这是要抗旨造反吗？", 225, 0, "韦小宝")
		say("微臣不敢，只是", 362, 1, "遏必隆")
		say("你是怀疑我伪造圣旨吗？遏必隆？好大的胆子，来人，给我拉下去砍了！", 75, 0)
		say("是。", 1058, 1)
		say("你敢，我乃是先皇任命的顾命大臣，福康安，福康安~你要做什么？", 362, 0, "遏必隆")
		say("啊！", 362, 0, "遏必隆")
		dark()
		null(-2, 26)
		light()
		say("真是啰嗦！", 75, 0)
		say("你们两位，还要抗旨吗？", 75, 0)
		say("微臣不敢，微臣接旨。", 1025, 1, "索尼")
		say("微臣不敢，微臣接旨。", 316, 1, "苏克萨哈")
		say("甚好，甚好，还请两位在皇宫里陪我住几天，有许多事还要两位相助。", 75, 0)
		say("~", 1025, 1, "索尼")
		say("~", 316, 1, "苏克萨哈")
		dark()
		null(-2, 17)
		null(-2, 51)
		null(-2, 16)
		addevent(108, 23, 1, -2, -2, 8638)
		addevent(108, 52, 1, -2, -2, 8638)
		addevent(108, 53, 1, -2, -2, 8608)
		addevent(108, 55, 1, -2, -2, 8608)
		addevent(108, 54, 1, 1525, -2, 8608)
		null(-2, 21)
		null(-2, 18)
		null(-2, 19)
		light()
		say("命人看住他们，任何人不能接近。他们都很聪明，会配合咱们做事的。", 0, 1)
		say("" .. JY.Person[0].称呼 .. "，大事已定了，不如你留在皇宫主持大局吧，我只怕出了错漏，坏了大好形势。", 75, 0)
		say("这却是不行的，我还有很多事要办，不能一直留在这里。下来我已有计议，你不用担心，将二爷三爷四爷他们全安排进来，霍姑娘和小宝留下来协助你，定然无事。", 0, 1)
		say("另外，安排弟兄们出去打探皇帝去哪了？得到消息后立即将皇帝控制起来，我们现在还不知道他到底帮那边呢？", 0, 1)
		say("" .. JY.Person[0].称呼 .. "，他要是不帮我们？", 75, 0)
		say("那他就是我族的叛徒，放心，我知道你想什么，他是你的哥哥，不会杀他的。", 0, 1)
		say("如此就好。", 75, 0)
		say("如此，这段时间你们小心谨慎些，有事的话就派人通知我。", 0, 1)

		if has_thing(318) == false then
			say("等等，这个给你。", 75, 0)
			addthing(318)
		end

		instruct_21(600)
		dark()
		instruct_3(108, 16, 1, 0, 1683, 0, 0, 8668, 8668, 8668, -2, -2, -2)
		addevent(100, 17, 1, -2, 1, 7174)
		addevent(100, 18, 1, 1524, 1, 5188)
		addevent(100, 19, 1, 1524, 1, 5188)
		My_Enter_SubScene(107, 22, 8, 3)
		light()
		say("陈兄弟，我可不想被纠缠在皇宫里，这些事就你来操心吧。", 0, 1)
	else
		say("" .. JY.Person[0].称呼 .. "，都安排好了。", 75, 0)
		say("很好，不过小宝不在，这事缺了他不行，等我赶快将他找来。", 0, 1)
	end
end
OEVENTLUA[1524] = function ()
	Cls()

	if instruct_16(600) then
		say("你就不回去了吗？儿臣~，儿臣~", 1028, 0, "大清皇帝")
		say("阿弥陀佛。痴儿，当年我做错了很多事情，如今这样才好。", 250, 1, "老和尚")
		say("那儿臣走了，不知道什么时候才能再来看你。", 1028, 0, "大清皇帝")
		say("哎，走吧，走吧。＜又低声的说＞，若是汉人不欢迎咱们，咱们就回去吧，不要勉强了。", 250, 1, "老和尚")
		say("＜突然愤怒起来＞，我们辛辛苦苦打下的江山，如何能够就这样放弃，咱们的血不是白流了吗？", 1028, 0, "大清皇帝")
		say("哎，这些年你杀了不少汉人了吧？", 250, 1, "老和尚")
		say("都是乱臣贼子，都该杀，不杀天下何时能平。", 1028, 0, "大清皇帝")
		say("谁是对？谁又是错呢？只是苦了天下百姓，我佛慈悲。", 250, 1, "老和尚")
		say("这声音，这是大清皇帝的声音。", 225, 0, "韦小宝")
		say("什么人？", 1048, 1, "大内密卫")

		if WarMain(301) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("来人啊，快救驾~", 1048, 0, "大内密卫")

		if WarMain(302) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(-2, 17)
		null(-2, 18)
		null(-2, 19)
		null(-2, 20)
		null(-2, 21)
		addevent(100, 17, 1, -2, 1, 7216)
		light()
		say("你们究竟是什么人？", 1028, 0, "大清皇帝")
		say("果然是大清皇帝。", 225, 0, "韦小宝")
		say("小桂子，是你？你怎么知道我在这里，这些人是？", 1028, 0, "大清皇帝")
		say("皇帝，我正在找你，不想你躲在这儿。你杀了香香公主，今日我来取你狗命。", 0, 1)
		say("小桂子，你要杀我？", 1028, 0, "大清皇帝")
		say("" .. JY.Person[0].称呼 .. "大侠，你答应陈总舵主不杀他的，咱们做人要讲义气，答应兄弟的就一定要做到。", 225, 0, "韦小宝")
		say("兄弟？是陈家洛叫你们来的？就知道所谓兄弟都靠不住。另外，香香公主也不是我杀的，她是自杀的，你要帮她报仇也不能找我。", 1028, 0, "大清皇帝")
		say("哼。鞑子皇帝，还是该死！", 0, 1)
		say("不不不，我不是鞑子，我不是鞑子，我也是汉人，你是陈家洛的兄弟，你可以问他，我是汉人，是他的亲哥哥。", 1028, 0, "大清皇帝")
		say("汉人？哈哈哈，你刚才的话我都听见了，你说我们的抗清义士都是乱臣贼子，统统该杀！你不是汉人，你才是正正的鞑子。", 0, 1)
		say("这是真的？你真的是汉人？", 250, 0, "老和尚")
		say("他确实是汉人，不过却是汉人里最大的叛徒！所以才最该死。", 0, 1)
		say("哎，冤孽啊。", 250, 0, "老和尚")
		say("别杀我，你要重启汉室江山是吧，别杀我，让我帮你。你知道要我帮你复兴汉室是轻而易举的。", 1028, 0, "大清皇帝")
		say("你到确实能帮我一个忙。", 0, 1)
		say("好吧，我答应你。", 1028, 0, "大清皇帝")
		say("我只是一个小小的要求，从今天起，你出家做和尚吧。或者你现在就死，你选吧。", 0, 1)
		say("你？我堂堂大清帝国皇帝，你敢让我做和尚？", 1028, 0, "大清皇帝")
		say("那就是没得商量了？", 0, 1)
		say("别别别，我愿意做和尚。", 1028, 0, "大清皇帝")
		say("你是真心的吧，不会反悔？", 0, 1)
		say("哼。", 1028, 0, "大清皇帝")
		say("老和尚，借你一件袈裟用一下。", 0, 1)
		dark()
		addevent(-2, 17, 1, -2, 1, 6152)
		light()
		say("不错，看着顺眼多了。把你放别的地方我也不放心，你跟我回小村吧。", 0, 1)
		say("对了，还有这个，这个是玉玺吧，你拿着也没用，借我玩几天了。", 0, 1)
		say("哼。", 1028, 0, "大清皇帝")
		dark()
		null(100, 17)
		addevent(70, 90, 1, -2, 1, 6152)
		addevent(70, 97, 1, 1525, 1, 5186)
		addevent(70, 101, 1, 1525, 1, 5186)
		My_Enter_SubScene(70, 14, 10, 1)
		light()
		say("如果有任何异常，立即将他杀了。", 0, 1)
		say("是。", 1047, 0, "守卫")
		say("小宝，我们又该写圣旨了。", 0, 1)
		say("这个我现在拿手了，趁现在东西都全，咱们写上千儿八百张的，以后慢慢的用。", 225, 0, "韦小宝")
		say("哈哈哈，那倒是不用。好东西一张就够使了。这样，如此如此写，小宝，你将圣旨带回给陈兄，让他好好安排，我随后赶去京城。", 0, 1)
		say("好。", 225, 0, "韦小宝")
		instruct_21(600)
		instruct_3(108, 16, 1, 0, 1683, 0, 0, 8668, 8668, 8668, -2, -2, -2)
		addevent(108, 18, 0, 1527, 3, -2)
		addevent(108, 59, 1, -2, -2, 8638)
		addevent(108, 60, 1, -2, -2, 8638)
		addevent(108, 61, 1, -2, -2, 8638)
		addevent(108, 26, 1, -2, -2, 8638)
		addevent(108, 17, 1, -2, -2, 8638)
		addevent(108, 51, 1, -2, -2, 8638)
		addevent(108, 56, 1, -2, -2, 8638)
		addevent(108, 57, 1, -2, -2, 8638)
		addevent(108, 58, 1, -2, -2, 8638)
	else
		say("大师有事不能打扰，你赶快离开这儿。", 1048, 0, "守卫")
	end
end
OEVENTLUA[1525] = function ()
	Cls()
	say("怎么样了？", 0, 1)
	say("他过的挺好的，都长胖了一圈了。", 1047, 0, "守卫")
	say("很好，多给他找些佛经看看，化解他的戾气。", 0, 1)
	say("是。", 1047, 0, "守卫")
end
OEVENTLUA[1526] = function ()
	Cls()

	if ts_num() >= 5 and has_thing(152) == false then
		say("" .. JY.Person[0].称呼 .. "，你可回来了，兄弟们在皇宫宝库里找到了一本无字天书，你来看看。", 75, 0)
		say("我看看，《书剑恩仇录》，果然如此，太好了。", 0, 1)
		say("你能看见书上的字？", 75, 0)
		say("那是自然，丑叔说我是天命之人，注定为天下共主，区区天书如何能难住我。", 0, 1)
		say("" .. JY.Person[0].称呼 .. "，你果然是天生圣人，与众不同。", 75, 0)
		say("圣人可不敢说，陈兄，不知这本天书可否送与我？", 0, 1)
		say("那是自然，" .. JY.Person[0].称呼 .. "你尽管拿去。", 75, 0)
		addthing(152, 1)

		JY.Person[0].清罪恶值 = 0
	else
		say("兄弟们都还好啊？", 0, 1)
		say("" .. JY.Person[0].称呼 .. "，你可回来了，没你真的不行啊。", 75, 0)
		say("" .. JY.Person[0].称呼 .. "，你可回来了。", 74, 0)
		say("" .. JY.Person[0].称呼 .. "，这个皇帝不如你来做吧，我江湖上混惯了，这个皇帝只怕做不好，别误了大事。", 75, 0)
		say("无妨，别担心，有我呢，咱们会做好的。", 0, 1)

		JY.Person[0].清罪恶值 = 0
	end
end
OEVENTLUA[1527] = function ()
	Cls()
	dark()
	light()
	say("人都到齐了，小宝，咱们开始吧。", 75, 0)
	say("是。", 225, 1, "韦小宝")
	say("皇上有旨~", 225, 0, "韦小宝")
	say("皇上万安，微臣接旨。", 1025, 1, "众大臣")
	say("奉天承运皇帝诏曰~，朕已厌倦红尘，现已出家为僧，福康安忠君体国，能力卓著，现朕传大清皇帝位于福康安，望众大臣能全力辅助福康安帝，建设全新的中兴帝国。钦此~", 225, 0, "韦小宝")
	say("什么？皇上身体安康，怎么会突然出家的？", 1025, 1, "众大臣")
	say("此事非同小可，我们要查验圣旨。", 308, 1, "众大臣")
	say("大胆，你们要抗旨吗？", 75, 0)
	say("微臣不敢，只是兹事体大，还望展示圣旨以安民心。", 308, 1, "众大臣")
	say("小桂子，将圣旨给他们仔细看看。", 75, 0)
	dark()
	light()
	say("都看清楚了吗？", 75, 0)
	say("看清楚了，福大帅", 308, 1, "大臣")
	say("嗯？", 75, 0)
	say("啊，皇上。但不知前皇到哪里出家了？", 1025, 1, "大臣")
	say("前皇一心出家，不想沾染尘世，你就不要想去打搅了。他若想回来自会回来，知道了吗？", 75, 0)
	say("是。", 1025, 1, "大臣")
	say("各位爱卿，本帝新登基，正需各位大展才华，帮朕安靖地方，整顿朝纲，望大家不要让朕失望。", 75, 0)
	say("是，微臣等定当全力辅助。", 308, 1, "众大臣")
	say("很好，你们都下去吧，各司其职，不得有误。", 75, 0)
	say("是，微臣领旨，微臣告退。", 1025, 1, "众大臣")
	dark()
	null(-2, 59)
	null(-2, 60)
	null(-2, 61)
	null(-2, 26)
	null(-2, 17)
	null(-2, 51)
	null(-2, 56)
	null(-2, 57)
	null(-2, 58)
	null(-2, 23)
	null(-2, 52)
	null(-2, 53)
	null(-2, 54)
	null(-2, 55)
	addevent(108, 13, 1, 1528, 1, 8620)
	light()
	null(-2, 18)
end
OEVENTLUA[1528] = function ()
	Cls()
	say("" .. JY.Person[0].称呼 .. "，你可回来了。", 75, 0)
	say("做的不错。", 0, 1)
	say("" .. JY.Person[0].称呼 .. "，接下来咱们怎么做？", 75, 0)
	say("我们还有很多事要做。现在才刚开始复兴的第一步而已。", 0, 1)
	say("是，一切全赖" .. JY.Person[0].称呼 .. "才有今天，接下来做什么，你说吧，我相信你。", 75, 0)
	say("陈兄，我问你一个问题。咱们汉人的人口是大清的数十倍，资源是大清的数十倍？为什么我们总是打不过他们，最后反被奴役？", 0, 1)
	say("这个？是因为咱们打仗不行。", 75, 0)
	say("不是，是因为咱们汉人，已经少了血性。", 0, 1)
	say("唔。", 75, 0)
	say("所以咱们得慢慢计划，不能着急。", 0, 1)
	say("你说吧。", 75, 0)
	say("首先，在大清推行满汉平等政策。", 0, 1)
	say("啊，这个不能吧，这个蛮子如何能答应。", 225, 0, "韦小宝")
	say("呵呵，你就说为了实现大清的世代统治，必须要实行这个政策。他们不会反对的。", 0, 1)
	say("咱们本来要杀鞑子，现在又和他们平等了？", 225, 0, "韦小宝")
	say("嗯，推行满汉平等后，咱们就可以大幅安插汉人进入各个重要职位了，慢慢替代鞑子占据主动。", 0, 1)
	say("这个倒是可行。另外咱们红花会的弟兄虽然厉害，但是数量还是太少。", 75, 0)
	say("正是，所以咱们要打仗。", 0, 1)
	say("听不明白了。", 225, 0, "韦小宝")
	say("近期大金和南宋是在打仗吧？", 0, 1)
	say("正是，应该说是大金在打南宋。", 75, 0)
	say("南宋也都是咱们汉人，咱们出兵帮助南宋攻打大金国。要派鞑子精兵去打，不计损伤。", 0, 1)
	say("明白。", 75, 0)
	say("派使者去南宋吧，和他们结盟，共同进攻大金。", 0, 1)
	say("打仗好，抢他们的金子，抢他们的女人来，咱们大家都发财。", 225, 0, "韦小宝")
	say("~", 0, 1)
	say("接下来，大举招兵扩军，组成汉人新军，名义上是扩军进攻大金，实际上是练兵，要练出咱们汉人的精兵来。", 0, 1)
	say("可惜我不懂军事，兄弟们也在江湖上打杀，真正地大战这方面却都不行。", 75, 0)
	say("无妨，现在培养也还来得及。", 0, 1)
	say("好，我这就安排。", 75, 0)

	if inteam(80) then
		say("张召重留在你这里吧，让他清查鞑子的大官，反对满汉平等的也抓了，要把最仇视汉人的一批鞑子都先干掉。", 0, 1)
		say("张召重？我信不过他。", 75, 0)
		say("哈哈，张召重一心要建功立业，却是不分什么满汉。你如今是皇帝，他自然就又对你忠心耿耿了。", 0, 1)
		say("好吧，我相信" .. JY.Person[0].称呼 .. "。", 75, 0)
		instruct_21(80)
		null(107, 2)
	end

	addevent(70, 102, 1, 1529, 1, 5188)
	addevent(108, 13, 1, 1526, 1, 8620, -2, -2)
	addevent(108, 15, 1, 1526, 1, 7004, -2, -2)

	JY.Person[550].儒学修为 = 1
	JY.Person[75].好感度 = 90
	JY.Person[0].清罪恶值 = 0
end
OEVENTLUA[1529] = function ()
	Cls()

	if JY.Person[0].官阶 < 10 then
		say("你是什么人？", 0, 1)
		say("大人，小人是陈总舵主派来的。", 1009, 0, "信使")
		say("陈总舵主让小的告知大人，和南宋结盟失败了。", 1009, 0, "信使")
		say("哦？是怎么回事？", 0, 1)
		say("我们派了使者到了南宋，见着了南宋皇帝，说了结盟一事后，不想被南宋皇帝一口拒绝。", 1009, 0, "信使")
		say("说什么，大宋是礼仪之邦，非是蛮夷治国，如何能兴兵动枪，岂不让天下耻笑。", 1009, 0, "信使")
		say("哦？就没有同意联兵共击大金的人么？", 0, 1)
		say("没有，众大臣皆道，大清这是要挑起大金和南宋的战事，说咱们不是君子所为，将咱们给赶了出来。", 1009, 0, "信使")
		say("哎，烂泥扶不上墙。", 0, 1)
		say("你回去告诉陈兄弟，此事交给我来办吧，让他先按原定计划实行。", 0, 1)
	else
		say("你是什么人？", 0, 1)
		say("大人，小人是陈总舵主派来的。", 1009, 0, "信使")
		say("陈总舵主让小的告知大人，和南宋结盟失败了。", 1009, 0, "信使")
		say("哦？是怎么回事？", 0, 1)
		say("我们派的使者一直没有机会见到皇上，现在南朝守卫太森严了。", 1009, 0, "信使")
		say("无妨，我知道了。你回去吧。", 0, 1)
		say("我汉人孱弱百年，非一朝一夕可以翻身，总有一天，总有一天会重新站起来的。", 0, 2)
	end

	say("是。", 1009, 0, "信使")
	null(-2, 102)
end
OEVENTLUA[1530] = function ()
	Cls()

	if instruct_16(600) then
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
		say("小宝，咱们进去看看。", 0, 0)
		say("让开！", 225, 0, "韦小宝")
		say("是，韦大人。韦大人，你老走好。", 300, 0, "皇宫禁卫")
		dark()
		My_Enter_SubScene(108, 61, 28, 0)
		light()
	else
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
	end
end
OEVENTLUA[1531] = function ()
	Cls()

	if instruct_16(600) then
		say("小宝，咱们出去吧。", 0, 0)
		say("让开！", 225, 0, "韦小宝")
		say("是，韦大人。韦大人，你老走好。", 300, 0, "皇宫禁卫")
		dark()
		My_Enter_SubScene(108, 61, 34, 2)
		light()
	else
		say("站住，此乃皇宫禁地，闲人退避！", 300, 0, "皇宫禁卫")
	end
end
OEVENTLUA[1532] = function ()
	Cls()

	if JY.Person[588].好感度 == 100 then
		say("香香公主，我来看你来了...", 0, 1)
	else
		say("＜香香公主之墓＞", 0, 1)
		say("不~", 0, 1)
		dark()
		light()
		dark()
		light()
		say("啊啊~，谁？谁干的？我要他死！！！", 0, 1)

		JY.Person[588].好感度 = 100

		dark()
		light()

		if instruct_16(74) then
			say("妹妹，怎么会这样？怎么会这样？", 74, 0)
		end
	end
end
OEVENTLUA[1533] = function ()
	Cls()
	say("这儿是怎么回事？", 0, 1)
	say("我不知道，我不知道，我就是个扫地的，每天来这儿打扫。", 260, 0, "宫女")

	if instruct_16(74) then
		say("是不是皇帝杀了我妹妹？", 74, 0)
		say("我不知道，我真的不知道，我就是个扫地的。", 260, 0, "宫女")
	end
end
OEVENTLUA[1534] = function ()
	Cls()
	dark()
	light()
	say("太后呢？怎么一直没有见到了？", 258, 0, "内侍卫")
	say("不知道，从昨天就没有回来，到处也没有看到。", 260, 1, "宫女")

	if instruct_16(600) then
		say("这箱子里是什么？怎么有股怪味？", 258, 0, "内侍卫")
		say("~", 260, 1, "宫女")
		My_Enter_SubScene(108, 14, 8, 2)
		say("把它打开！", 225, 0, "韦小宝")
		say("这是太后的东西，若是太后知道~", 260, 1, "宫女")
		say("打开！", 225, 0, "韦小宝")
		say("是。", 258, 1, "内侍卫")
		dark()
		addevent(-2, 38, 1, -2, 1, 8314, -2, -2)
		light()
		say("这是？", 225, 0, "韦小宝")
		say("啊？太后！奴才参见太后。", 258, 1, "内侍卫")
		say("啊？", 225, 0, "韦小宝")
		say("太后，太后你怎么了？", 258, 1, "内侍卫")
		say("神龙教！神龙教！你们关了我十几年，今天我终于出来了。", 1237, 0, "太后")
		say("小太监，你叫什么名字？", 1237, 0, "太后")
		say("是，微臣韦小宝，参见太后。", 225, 1, "韦小宝")
		say("给我下旨，立即派水师去辽东剿灭神龙教，立即！马上！。", 1237, 0, "太后")
		say("是，微臣领旨。", 225, 1, "韦小宝")
		say("快，宣太医，送太后回寝宫休息。", 225, 0, "韦小宝")
		say("是。", 258, 1, "内侍卫")
		dark()
		null(-2, 30)
		null(-2, 38)
		null(-2, 39)
		null(-2, 50)
		light()
		addevent(-2, 63, 1, 1535, 1, 8300)
		addevent(119, 1, 0, 1547, 3)
		addevent(119, 2, 0, 1547, 3)
	end
end
OEVENTLUA[1535] = function ()
	Cls()

	if instruct_16(600) then
		say("微臣见过韦大人。", 318, 0, "施琅")
		say("你就是施琅？", 225, 1, "韦小宝")
		say("是，微臣奉旨协助韦大人出征辽东神龙岛，一切都听从韦大人号令。", 318, 0, "施琅")
		say("甚好，甚好。施大哥啊，", 225, 1, "韦小宝")
		say("啊，小人不敢。", 318, 0, "施琅")
		say("这儿没有外人，咱哥俩就不用客气了，这个兵事吗？我不懂，一切由你安排，事成后咱们都有功劳，你明白？", 225, 1, "韦小宝")
		say("小人明白，小人明白，一切都是韦大人指挥有方。", 318, 0, "施琅")
		say("好，你下去安排，先派大军围住神龙岛，一个都别让跑出来。", 225, 1, "韦小宝")
		say("是，小人这就去安排。", 318, 0, "施琅")
		dark()
		addevent(71, 5, 1, 1536, 1, 8300)
		addevent(71, 7, 1, 1552, 1, 8630)
		addevent(71, 8, 1, 1552, 1, 8632)
		addevent(71, 9, 1, 1552, 1, 8636)
		addevent(71, 10, 1, 1552, 1, 8632)
		addevent(71, 21, 1, 1552, 1, 8632)
		addevent(71, 22, 1, 1552, 1, 8632)
		addevent(71, 23, 1, 1552, 1, 8632)
		null(71, 6)
		addevent(71, 2, 1, -2, 1)
		addevent(71, 3, 1, -2, 1)
		addevent(71, 4, 1, -2, 1)
		addevent(71, 11, 1, -2, 1)
		addevent(71, 13, 1, -2, 1)
		addevent(71, 14, 1, -2, 1)
		addevent(71, 16, 1, -2, 1)
		addevent(71, 24, 1, 1538, 1)
		null(-2, 63)
		light()
	else
		say("你是什么人？皇城之内不要乱闯知道吗。", 318, 0, "施琅")
	end
end
OEVENTLUA[1536] = function ()
	Cls()

	if instruct_16(600) then
		say("施大人，事情办得怎么样了？", 225, 0, "韦小宝")
		say("微臣见过韦大人，微臣已经派兵将神龙教团团围困。", 318, 1, "施琅")
		say("神龙教有一批首脑人物还在负隅顽抗，不过大军重重包围之下，擒获他们是迟早之事。", 318, 1, "施琅")
		say("办得好，我到前面去看看。", 225, 0, "韦小宝")
		say("大人，匪首十分凶恶，大人千金之躯~", 318, 1, "施琅")
		say("无妨，大风大浪我见得多了。", 225, 0, "韦小宝")
		say("是。", 318, 1, "施琅")
		say("" .. JY.Person[0].称呼 .. "大侠，你要保护好我啊，我的小命就交给你了。", 225, 0, "韦小宝")
		say("呵呵。", 0, 1)
		null(-2, 8)
		addevent(-2, 20, 0, 1537, 3)
	else
		say("什么人？官府办案，速速离开。", 318, 0, "施琅")
	end
end
OEVENTLUA[1537] = function ()
	Cls()

	if instruct_16(600) == false then
		say("什么人？官府办案，速速离开。", 222, 0, "官兵")
		My_Enter_SubScene(71, 30, 24, 3)

		return
	end

	instruct_30(30, 21, 30, 13)
	null(-2, 20)
	say("呵呵呵……", 353, 0)
	Cls()
	say("喂，你瞧，瞧……", 225, 1, "韦小宝")
	Cls()
	say("什么啊？", 0, 1)
	Cls()
	say("大美女啊……", 225, 1, "韦小宝")
	Cls()
	say("这个，小宝，那可是犯人家属啊。", 0, 1)
	Cls()
	say("想想办法，搞过来啊。", 225, 1, "韦小宝")
	Cls()
	say("什么犯人，你们到底为什么攻打我神龙教？", 71, 0)
	meet_self(71)
	say("啊？我不是来攻打你们的，那是外面官兵的事，我就是来找找有没有我要的书。", 225, 1, "韦小宝")
	Cls()
	say("你要找什么书？", 71, 0)
	Cls()
	say("四十二章经", 225, 1, "韦小宝")
	Cls()
	say("没听说过，我这没有。", 71, 0)
	Cls()
	say("那你这有什么书？", 0, 1)
	Cls()
	say("没有……我哪有什么书？……什么也没有……", 71, 0)
	Cls()
	say("？？？你好像心里有鬼啊？", 0, 1)
	Cls()
	say("我有什么鬼？没有就是没有，你要是再不滚蛋，就休怪我不客气了！", 71, 0)
	Cls()
	say("不想死就赶快跪地求饶。", 0, 1)
	Cls()
	say("啊，这就开打啦，你们先上，我掩护。", 225, 1, "韦小宝")
	Cls()
	say("等一下，等一下，我还有件重要的事……", 225, 1, "韦小宝")
	Cls()
	say("？？？", 0, 1)
	Cls()
	say("千万要注意，别伤到美女。好，你们继续！", 225, 1, "韦小宝")
	Cls()

	if WarMain(95, 0) == false then
		instruct_15()
		Cls()
		Cls()

		return
	end

	null(-2, 11)
	null(-2, 13)
	null(-2, 14)
	null(-2, 16)
	Cls()
	instruct_13()
	addthing(322, 3)
	say("这回不横了吧？还不把书拿来。", 0, 1)
	Cls()

	if has_thing(228) then
		instruct_26(1, 10, 1, 0, 0)
		instruct_26(1, 7, 1, 0, 0)
		say("又是半部《四十二章经》？这下我正好可以凑成一部了。", 225, 1, "韦小宝")
		Cls()
		addthing(229, 1)
		instruct_39(90)
		Cls()
		instruct_32(228, -1)
		say("这位美女，啊不，教主夫人，仙福永享，寿与天齐，那个，你若没什么事，跟我们一起走吧。", 225, 1, "韦小宝")
		Cls()
		say("你说什么！休打我夫人的主意。", 71, 0)
		Cls()
		say("我原本以为呢，你就是武功天下第一了，没想到随便来几个人，就把你打得落花流水，唉……", 353, 0)
		Cls()
		say("我，我……", 71, 0)
		Cls()
		say("你什么你，你都七老八十了，还霸占着这么漂亮的美眉，你够了你。夫人，咱们走吧。", 225, 1, "韦小宝")
		Cls()
		say("走？好啊。不过我为什么要跟你走啊？我不会自己走吗？", 353, 0)
		Cls()
		instruct_14()
		null(-2, 4)
		instruct_13()
		say("夫人，夫人……", 71, 0)
		Cls()
		say("来人，把他们都抓起来。", 225, 1)
		say("是，大人。", 319, 0, "官兵")
		dark()
		null(-2, 3)
		null(-2, 2)
		light()
		Cls()
		say("唉，遇见两个大美女，都被你放跑了，看来跟着你甭想泡到妞了，我要自己去追！！", 225, 1, "韦小宝")
		say("美女等等我。", 225, 1)
		Cls()
		instruct_21(600)
		instruct_3(108, 16, 1, 0, 1683, 0, 0, 8668, 8668, 8668, -2, -2, -2)
		say("小宝，正事要紧，。小宝？", 0, 0)
		say("（韦小宝离队）", 0, 1)
		addevent(71, 5, 1, 1551, 1, 8300)

		return
	end

	addthing(228, 1)
	Cls()
	say("这是什么书？看你的样子一定有问题，我先替你保管着吧。", 0, 1)
	Cls()
	say("这位美女，啊不，教主夫人，仙福永享，寿与天齐，那个，你若没什么事，跟我们一起走吧。", 225, 1, "韦小宝")
	Cls()
	say("你说什么！休打我夫人的主意。", 71, 0)
	Cls()
	say("我原本以为呢，你就是武功天下第一了，没想到随便来几个人，就把你打得落花流水，唉……", 353, 0)
	Cls()
	say("我，我……", 71, 0)
	Cls()
	say("你什么你，你都七老八十了，还霸占着这么漂亮的美眉，你够了你。夫人，咱们走吧。", 225, 1, "韦小宝")
	Cls()
	say("走？好啊。不过我为什么要跟你走啊？我不会自己走吗？", 353, 0)
	null(-2, 4)
	Cls()
	instruct_14()
	instruct_3(-2, 2, 1, -2, 88, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 3, 1, 0, 88, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 4, 1, 0, 88, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("夫人，夫人……", 71, 0)
	say("来人，把他们都抓起来。", 225, 1)
	say("是，大人。", 319, 0, "官兵")
	dark()
	null(-2, 3)
	null(-2, 2)
	light()
	addevent(71, 5, 1, 1551, 1, 8300)
end
OEVENTLUA[1538] = function ()
	Cls()
	addthing(168, 1)
	null(-2, 24)
end
OEVENTLUA[1539] = function ()
	Cls()
	say("什么人？此乃神龙教驻地，无关人等速速离开。", 258, 0, "神龙教众")
end
OEVENTLUA[1540] = function ()
	Cls()
	dark()
	light()
	say("什么人？擅闯者死！", 308, 0, "大清密卫")
	say("勇士们，我们世代相传，守护了这儿数百年！如今敌人终于到了，用我们的鲜血，护卫我族的昌盛吧！", 316, 1, "大清密卫")
	say("放出雪怪，拼死一搏！", 308, 0, "大清密卫")
	say("杀！", 308, 1, "大清密卫")
	say("杀！", 316, 0, "大清密卫")

	if WarMain(303) == false then
		instruct_15(0)
		instruct_0()

		do return end

		Cls()
	end

	say("啊，可恶啊！你究竟是谁？你究竟是谁？", 316, 0, "大清密卫")
	say("啰嗦。", 0, 1)
	say("啊~", 316, 0, "大清密卫")
	null(-2, 0)
end
OEVENTLUA[1541] = function ()
	Cls()
	dark()
	light()
	say("这？难道这是就是传说中的龙脉？", 0, 1)
	null(-2, 10)
end
OEVENTLUA[1542] = function ()
	Cls()
	say("此地乃我女真龙脉，但为女真族人，必以性命守护，天佑我族大兴", 0, 1)
end
OEVENTLUA[1543] = function ()
	Cls()
	say("这个山洞里面堆满了兵器铠甲，还有粮食", 0, 2)
	null(-2, 5)
	null(-2, 7)
	null(-2, 12)
	null(-2, 13)
end
OEVENTLUA[1544] = function ()
	Cls()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 2492, 2492, 2492, -2, -2, -2)
	addthing(150, 1)
	addthing(229, -1)
	null(123, 29)
end
OEVENTLUA[1545] = function ()
	Cls()
	say("上好的黄玉？宝贝啊，发财了发财了。我切切切，我砍砍砍，好幸福~", 0, 1)

	if has_thing(36) or has_thing(56) or has_thing(37) then
		addthing(334, 198)
		DrawStrBoxWaitKey("你获得了一大批宝玉", C_ORANGE, CC.DefaultFont, 2)
		null(-2, 1)
	else
		say("这是什么玉石啊~，太硬了吧。", 0, 1)
	end
end
OEVENTLUA[1546] = function ()
	Cls()
	say("上好的黄玉？宝贝啊，发财了发财了。我切切切，我砍砍砍，好幸福~", 0, 1)

	if has_thing(36) or has_thing(56) or has_thing(37) then
		addthing(334, 190)
		DrawStrBoxWaitKey("你获得了一大批宝玉", C_ORANGE, CC.DefaultFont, 2)
		null(-2, 2)
	else
		say("这是什么玉石啊~，太硬了吧。", 0, 1)
	end
end
OEVENTLUA[1547] = function ()
	Cls()

	if instruct_16(600) then
		dark()
		light()
		say("哇哦，看那边，好漂亮的小娘。", 225, 0, "韦小宝")
		addevent(119, 0, 1, 1548, 1, 9300)
		say("" .. JY.Person[0].称呼 .. "，咱们过去打个招呼。", 225, 0, "韦小宝")
		say("~", 0, 1)
		null(-2, 1)
		null(-2, 2)
	end
end
OEVENTLUA[1548] = function ()
	Cls()

	if instruct_16(600) then
		say("美女，你好啊。", 225, 0, "韦小宝")
		say("~", 0, 1)
		say("~", 86, 0, "阿珂")
		meet_self(86)
		say("太美了，这样美貌的小美人儿，普天下也只有你一个了，啧啧啧！真是瞧得我魂飞天外。", 225, 0, "韦小宝")
		say("滚开。", 86, 1, "阿珂")
		say("美女，聊聊天嘛，这么凶做什么？", 225, 0, "韦小宝")
		say("小宝~，这位姑娘，我代这小兄弟向你道歉啊，我这兄弟爱开点玩笑，人其实不坏的。", 0, 1)
		say("这么油腔滑调的，就像个小流氓。", 86, 0, "阿珂")
		say("呵呵，姑娘不要误会，我这小兄弟不但不是小流氓，还是天地会的英雄，就是有那么点小毛病。", 0, 1)
		say("你是做什么的？", 86, 0, "阿珂")
		say("我？我是一位行侠仗义的侠客。", 0, 1)
		say("真的？看你样子，倒似乎有点像。", 86, 0, "阿珂")
		say("不敢相瞒姑娘，其实在我剑下不知死了多少恶霸，多少贪官。", 0, 1)
		say("师父一直教导我们要锄强扶弱，不过我刚下山，还没有找到一个恶霸。", 86, 0, "阿珂")
		say("找恶霸还不容易，姑娘，咱们去集市酒楼左右转一转，就能打听到这儿都有什么恶霸。", 0, 1)
		say("好啊好啊。", 86, 0, "阿珂")
		say("好啊好啊。", 225, 1, "韦小宝")
		say("你不要学我说话，离我远点。", 86, 0, "阿珂")
		say("我是真的要说好啊的。", 225, 1, "韦小宝")
		dark()
		addevent(119, 12, 1, -2, 1, 9300)
		addevent(119, 13, 1, -2, 1, 8652)
		My_Enter_SubScene(119, 37, 16, 2)
		null(-2, 0)
		light()
		say("姑娘，你看这个是比武招亲的擂台。", 0, 1)
		say("据说前一阵韦陀帮主的女儿就是在这儿比武招亲的。", 0, 1)
		say("真有意思，可是如果找了个老头儿怎么办？", 86, 0, "阿珂")
		say("那自然是要求18-35岁的才能参加比赛。", 225, 1, "韦小宝")
		say("哎呀，好香好香，我要晕倒了。", 225, 1, "韦小宝")
		addevent(119, 14, 1, -2, 1, 8896)
		meet_self(139)
		say("你，离这位姑娘远点。", 139, 0, "郑克爽")
		say("你干什么？", 225, 1, "韦小宝")
		say("这位姑娘，你没事吧？", 139, 0, "郑克爽")
		say("喂喂，我们说话说得好好地，你推开我做什么？", 225, 1, "韦小宝")
		say("这位姑娘，小生有礼了。这小流氓没有把你怎么样吧？", 139, 0, "郑克爽")
		say("这位兄台，你误会了。", 0, 1)
		say("你你，好大的胆子，敢推开你韦大爷，" .. JY.Person[0].称呼 .. "，咱们扁他。", 225, 0, "韦小宝")
		addevent(119, 15, 1, -2, 1, 8888)
		say("小宝。", 268, 0, "陈近南")
		say("师父？你怎么在这儿？", 225, 0, "韦小宝")
		say("这是你的徒弟？你看看你教的好徒弟，真是丢脸。", 139, 1, "郑克爽")
		say("你才丢脸，你丢你们全家的脸，丢的明年都找不到。", 225, 0, "韦小宝")
		say("小宝，不得无礼，这位是台湾延平郡王郑小王爷。", 268, 0, "陈近南")
		say("你~", 225, 0, "韦小宝")
		say("这位" .. JY.Person[0].称呼 .. "，咱们又见面了。", 268, 0, "陈近南")
		say("陈总舵主你好。", 0, 0)
		say("陈参军，你倒真是侠名满天下，什么人你都认识。", 139, 1, "郑克爽")
		say("二公子，那都是借郑王爷的面子。", 268, 0, "陈近南")
		say("哼，我晚上要见见天地会湖广一片的负责人，你现在去安排吧。", 139, 1, "郑克爽")
		say("是。", 268, 0, "陈近南")
		say("你这个徒弟要好好管教，咱们是郑王府制下，不是什么江湖混混。", 139, 1, "郑克爽")
		say("是，微臣这就去安排。", 268, 0, "陈近南")
		dark()
		null(-2, 15)
		light()
		say("好大的面子，怎么连师父都听他的。", 225, 1, "韦小宝")
		say("这位姑娘，一会在桃园有个咏诗大会，可肯赏脸同去听一听。", 139, 0, "郑克爽")
		say("我刚和这位公子说去找恶霸~", 86, 1, "阿珂")
		say("就是就是，我们说好的。", 225, 0, "韦小宝")
		say("找恶霸？找恶霸做什么？", 139, 1, "郑克爽")
		say("那个，找恶霸，然后~", 86, 0, "阿珂")
		say("哈哈哈，找恶霸也行，只要能找到，我一个命令，多少个恶霸也能处置了。", 139, 1, "郑克爽")
		say("这？", 86, 0, "阿珂")
		say("桃园诗会可是会来很多中原名流，风流文士，咱们可以先去诗会，完了有时间咱们再找恶霸，你看如何？", 139, 1, "郑克爽")
		say("喂喂，有没有先来后到的？", 225, 0, "韦小宝")
		say("你先来难道这位姑娘就是你的？首先得要看姑娘愿意做什么？你说是吧姑娘。", 139, 1, "郑克爽")
		say("唔，那好吧。", 86, 0, "阿珂")
		dark()
		null(-2, 12)
		null(-2, 14)
		light()
		say("这小娘皮，不给韦爷面子。" .. JY.Person[0].称呼 .. "，你也不说说什么。", 225, 1, "韦小宝")
		say("这有什么说的。", 0, 1)
		say("我知道我没戏了，可她明明都对你有好感了，结果半路让这个什么小王爷给拐跑了，什么小王爷，很了不起吗？", 225, 0, "韦小宝")
		say("呵呵，咱们走吧。", 0, 1)
		say("哼哼，咱们下次再见到这小子，要好好教训他一下，只是别让我师父知道了。", 225, 0, "韦小宝")
		null(-2, 13)
		addevent(76, 12, 0, 1549, 3)
		instruct_3(76, 0, 1, 0, 0, 0, 0, 8884, 8884, 8884, -2, -2, -2)
		instruct_3(76, 1, 1, 0, 0, 0, 0, 9004, 9004, 9004, -2, -2, -2)
		instruct_3(76, 2, 1, 0, 0, 0, 0, 8368, 8368, 8368, -2, -2, -2)
		instruct_3(76, 11, 1, 0, 0, 0, 0, 9302, 9302, 9302, -2, -2, -2)
		null(69, 39)
	end
end
OEVENTLUA[1549] = function ()
	Cls()

	if instruct_16(600) == false then
		Cls()

		return
	end

	dark()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	light()
	instruct_25(29, 43, 29, 32)
	meet_self(150)
	say("…………", 86, 0)
	Cls()
	say("冯锡范，你为何对我忽施暗算？", 268, 0, "陈近南")
	Cls()
	say("我奉命拿你！", 150, 1)
	Cls()
	say("陈永华，你还把我放在眼里么？", 139, 0)
	Cls()
	say("二公子何出此言？", 268, 0, "陈近南")
	Cls()
	say("嘿嘿，台湾就快成你姓陈的一个人的了。", 150, 0)
	Cls()
	say("陈某人对郑王爷一片忠心。", 268, 0, "陈近南")
	Cls()
	say("你目无主上，不敬重我，就是不敬重父王。我瞧你所作所为，早有不臣之心，哼，你在中原拚命培植自己势力，扩充天地会，哪里还把台湾郑家放在心上。你想自立为王，是不是？", 139, 0)
	Cls()
	say("绝无此事！", 268, 0, "陈近南")
	Cls()
	say("你早得到此书，却不肯交给我，你心里还有父王没有？", 139, 0)
	Cls()
	say("Ｌ＜什么书？＞", 0, 1)
	Cls()
	say("二公子不用跟他多废话，先把他拿下再说来人！", 150, 0)
	Cls()
	say("不好，那是我师父，快救人。", 225, 1, "韦小宝")
	Cls()

	if WarMain(136, 0) == false then
		instruct_15()
		Cls()
		Cls()

		return
	end

	My_Enter_SubScene(76, 27, 33, 1)
	addevent(76, 14, 1, -2, 1, 8646, -2, -2)
	Cls()
	instruct_13()
	say("哼，你竟敢害我师父，活得不耐烦了，看我……", 225, 1, "韦小宝")
	Cls()
	say("你别杀他！", 86, 0)
	Cls()
	say("＜乖乖，小娘怎么帮他说话，这才在一起几天啊？＞", 225, 1, "韦小宝")
	Cls()
	say("你别杀他，要杀就杀我吧。", 86, 0)
	Cls()
	say("好啊，那我就先杀你。", 225, 1, "韦小宝")
	Cls()
	say("郑公子，永别了，我们来世再做夫妻。", 86, 0)
	Cls()
	say("你们两个我只能放一个，你说我该放谁呢？姓郑的，你怎么不说话？", 225, 1, "韦小宝")
	Cls()
	say("……求求你放了我，我……", 139, 0)
	Cls()
	say("郑公子！不要向他求饶！", 86, 1)
	Cls()
	say("求" .. JY.Person[0].称呼 .. "放了我……", 139, 0)
	Cls()
	say("我要是放了你，就得杀这妞！", 225, 1, "韦小宝")
	Cls()
	say("郑公子，你是做大事的人，还是让他杀了我吧……", 86, 0)
	Cls()
	say("小宝~", 0, 1)
	Cls()
	say("小宝，不可。", 268, 0, "陈近南")
	Cls()
	say("……唉，没想到你这么喜欢这小白脸……算了，看在美女的面子上，今天就放了你……", 225, 1, "韦小宝")
	Cls()
	say("~", 86, 0)
	Cls()
	say("谢谢几位……", 139, 1)
	Cls()
	say("滚吧！", 0, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("师父，你没事吧。", 225, 1, "韦小宝")
	Cls()
	say("小宝，你来的正好。我没事。多谢这位" .. JY.Person[0].称呼 .. "相助。", 268, 0, "陈近南")
	Cls()
	say("总舵主，不知你们刚才说的什么书？", 0, 1)
	Cls()
	say("哦，我们已经打探到神龙教有四十二章经。", 268, 0, "陈近南")
	Cls()
	say("师父，这个我们早知道了。师父，我们好不容易见了面，就一起多住几日。", 225, 1, "韦小宝")
	Cls()
	say("刚才他们要抓总舵主？不知为了何事？", 0, 1)
	Cls()
	say("哎，郑王爷刚去，他们就迫不及待的要投靠大清。小宝，这位" .. JY.Person[0].称呼 .. "，如今事态紧急，咱们后会有期。", 268, 0, "陈近南")

	if has_thing(262) or has_thing(261) then
		say("总舵主且慢！", 0, 1)
		say("总舵主如是一心要恢复汉室江山的话，我们倒是可以合作。", 0, 1)
		say("这位" .. JY.Person[0].称呼 .. "，此话怎说。", 268, 0, "陈近南")
		say("如何恢复汉室江山，我已经有个可行计划！总舵主若是信得过在下，不妨咱们合作，且看重振华夏威风，就在今朝。", 0, 1)
		say("咳咳，小宝，你这位" .. JY.Person[0].称呼 .. "？", 268, 0, "陈近南")
		say("我知你不会这么容易相信我，可是我是从小村出来的。", 0, 1)
		say("小村？是江湖传说的那个小村？", 268, 0, "陈近南")
		say("正是，南贤、北丑乃是我的管家。", 0, 1)
		say("好，若你真是小村的，我相信你，想不到，想不到，小村又有人入世了，我汉族大兴有望了。", 268, 0, "陈近南")
		say("我近期会在扬州，你若有什么需要帮助的，可到扬州寻我。", 268, 0, "陈近南")
		addevent(69, 0, 1, 1550, 1, 8888)
	end

	instruct_14()
	null(-2, 0)
	instruct_13()
	say("姑娘，如今郑公子已经走了，不知道姑娘可有去处？", 0, 1)
	say("我，我~，呜呜呜。", 86, 0, "阿珂")
	say("哎呀，最见不得娘们哭了，不行你就先跟着我们吧。", 225, 0, "韦小宝")
	say("你家在什么地方？我送你回去。", 0, 1)
	say("我没有家，从小就是师傅带着我的。", 86, 0, "阿珂")
	say("那你师父在什么地方？", 0, 1)
	say("我，我不知道，我们走散了。", 86, 0, "阿珂")
	say("怎么这么~", 225, 0, "韦小宝")
	say("还不是都怪你，你们约我去杀恶霸，本来师父让我在那儿等她的。", 86, 0, "阿珂")
	say("我~", 225, 0, "韦小宝")
	say("别着急，那你门派在什么地方？", 0, 1)
	say("在华山，可是师父说过她不回去了，呜呜呜。", 86, 0, "阿珂")
	say("~", 0, 1)
	say("那你先跟我们走吧，或许能找到你师父。", 0, 1)

	if instruct_20() then
		Cls()
		say("你的队伍已满，呜呜。", 86, 0, "阿珂")
		null(76, 14)
		null(76, 11)

		return
	end

	instruct_10(86)
	null(76, 14)
	null(76, 11)
end
OEVENTLUA[1550] = function ()
	Cls()

	if JY.Person[601].好感度 == 0 then
		say("总舵主，我们又见面了。", 0, 1)
		say("咳咳，" .. JY.Person[0].称呼 .. "，可是需要什么帮助。", 268, 0, "陈近南")
		say("那个，最近不小心把清朝皇帝杀了，现在正被清廷通缉。", 0, 1)
		say("什么？", 268, 0, "陈近南")
		say("听闻天地会反清复明，不知...", 0, 1)
		say("此事当真？", 268, 0, "陈近南")
		say("这种事做不了假的吧。", 0, 1)
		say(JY.Person[0].称呼 .. "，你真是当世的大英雄，大豪杰。", 268, 0, "陈近南")
		say("太好了太好了。", 268, 0, "陈近南")
		say("通缉的事我帮你想想办法，天地会在清朝宫中也有些势力，做些鱼目混珠的事还是不难的。", 268, 0, "陈近南")
		say("多谢总舵主。", 0, 1)
		say("好说好说。这天大的好消息，我这就回台湾告诉王爷，复兴有望，复兴有望啊。", 268, 0, "陈近南")
		say("郑王爷会出兵？", 0, 1)
		say("额...", 268, 0, "陈近南")
		say("身为臣子，自当劝说主上以天下为重。", 268, 0, "陈近南")
		say("这个送给你，希望对你有所帮助。", 268, 0, "陈近南")

		JY.Person[0].清罪恶值 = 0

		addthing(92)
		addthing(327, 3)
	elseif JY.Person[550].儒学修为 == 1 then
		say("总舵主，我们又见面了。", 0, 1)
		say("咳咳，" .. JY.Person[0].称呼 .. "，可是需要什么帮助。", 268, 0, "陈近南")
		say("那个，我和红花会的陈家洛舵主做了一件大事。", 0, 1)
		dark()
		light()
		say("如此如此。总之现在是陈兄弟在做着清朝皇帝了。", 0, 1)
		say("此事当真？", 268, 0, "陈近南")
		say("这种事做不了假的吧。", 0, 1)
		say(JY.Person[0].称呼 .. "，你真是当世的大英雄，大豪杰。", 268, 0, "陈近南")
		say("太好了太好了。", 268, 0, "陈近南")
		say("复兴有望，复兴有望啊，如此形势，我这就安排天地会北上，倾力相助。", 268, 0, "陈近南")
		say("这就好，有陈舵主相助，何愁大事不成。", 0, 1)
		say("我这就去见陈兄弟，告辞。", 268, 0, "陈近南")
		addevent(108, 19, 1, 1555, 1, 8884)
	elseif has_thing(329) and has_thing(217) and has_thing(218) then
		say("总舵主，我们又见面了。", 0, 1)
		say("咳咳，" .. JY.Person[0].称呼 .. "，可是需要什么帮助。", 268, 0, "陈近南")
		say("正是，听闻天地会在清朝宫中也有不小势力，我已经混入福康安麾下，若是有事，到时还望总舵主相助。", 0, 1)
		say("好说好说，我这就传书京城的兄弟，只要是反清的大业，定会全力相助。", 268, 0, "陈近南")
		say("多谢总舵主。", 0, 1)
		AddPersonAttrib(550, "医疗能力", 1)
	else
		say("总舵主，我们又见面了。", 0, 1)
		say("咳咳，" .. JY.Person[0].称呼 .. "，可是需要什么帮助。", 268, 0, "陈近南")
		say("今日无事，请总舵主喝上一杯。", 0, 1)
		say("好说好说。", 268, 0, "陈近南")
		dark()
		light()
		say(JY.Person[0].称呼 .. "，我还有要务，咱们有缘再见。", 268, 0, "陈近南")
	end

	null(69, 0)
end
OEVENTLUA[1551] = function ()
	Cls()

	if instruct_16(600) then
		say("施大人，事情办得不错，收队吧。", 225, 0, "韦小宝")
		say("是，大人。", 318, 1, "施琅")
	else
		say("事情办完，撤。", 318, 1, "施琅")
	end

	dark()
	null(-2, 5)
	null(-2, 7)
	null(-2, 9)
	null(-2, 10)
	null(-2, 21)
	null(-2, 22)
	null(-2, 23)
	light()
end
OEVENTLUA[1552] = function ()
	Cls()

	if instruct_16(600) then
		say("小的参见韦大人。", 222, 1, "官兵")
		say("唔。", 225, 0, "韦小宝")
	else
		say("官府办案，赶快离开这里。", 222, 1, "官兵")
	end
end
OEVENTLUA[1555] = function ()
	Cls()
	say("复兴有望，复兴有望啊，如此形势，我天地会定会倾力相助。", 268, 0, "陈近南")
end
OEVENTLUA[1601] = function ()
	Cls()
	meet_self(77)
	say("老伯，你这个是什么东西啊？", 77, 0)
	say("姑娘，这个是藏边进的牦牛角乐器，你看这儿有个吹嘴，可以吹出低沉悠扬的音乐。", 0, 1)
	say("年轻人说的不错。", 1055, 0, "卖货老伯")
	say("真有意思，你怎么知道的？", 77, 0)
	say("我去西藏的时候听过当地人吹奏，声音与咱们这儿的音乐大有不同，别有韵味。", 0, 1)
	say("你还去过西藏？", 77, 0)
	say("何止西藏，我去过很多地方，见过许多奇妙的事情。", 0, 1)
	say("真的吗？那你能不能带我去看看？", 77, 0)
	say("当然~可以！有姑娘这样的美女相伴，那是我走了大运了。", 0, 1)
	say("呵呵，你可真会说话。", 77, 0)
	say("老伯，这个多少钱？", 77, 0)
	say("5两银子。", 1055, 0, "卖货老伯")
	say("好，我买一个。", 77, 0)
	say("好好，姑娘，我再送你一个纯铜的吹嘴，不易磨损的，音质还好。", 1055, 0, "卖货老伯")
	say("多谢老伯了。这位" .. JY.Person[0].称呼 .. "，咱们走？", 77, 0)
	say("姑娘，您请。", 0, 1)

	if instruct_20() then
		Cls()
		say("你的队伍已满。", 1, 0)

		return
	end

	instruct_10(77)
	null(-2, 21)
	addevent(116, 0, 0, 1602, 3, -2)
	addevent(116, 1, 0, 1602, 3, -2)
	addevent(116, 2, 1, 0, 1, 8308)
	addevent(116, 3, 1, 0, 1, 2784)
	addevent(116, 4, 1, 0, 1, 2786)
	addevent(116, 5, 1, 0, 1, 5318)
	addevent(116, 6, 1, 0, 1, 5188)
	addevent(116, 7, 1, 0, 1, 5186)
end
OEVENTLUA[1602] = function ()
	Cls()

	if instruct_16(77) then
		dark()
		null(-2, 0)
		null(-2, 1)
		light()
		say("各位好朋友，今日押的什么镖啊？", 1075, 0, "袁冠南")
		say("敢问先生是哪条道上的好汉？在下途径宝地，还请朋友给个面子，大家交个朋友。", 1148, 1, "周威信")
		say("张镖师，取200两银子来，给朋友做个酒钱。", 1148, 1, "周威信")
		say("酒钱啥的我是不要的，听说你押的镖里有一对鸳鸯双刀，甚是奇异，不知可否借来一观？", 1075, 0, "袁冠南")
		say("朋友想必是误会了，我们这是给和顺商行押的一些货物，里面可没有什么宝刀？", 1148, 1, "周威信")
		say("所谓明人不讲暗话，总镖头既如此说，那就免不了动手了。", 1075, 0, "袁冠南")
		say("说话之间，突然跃出，运指如风，居然几下就将镖局的人都点翻在地，从周威信马上取出一个长条包裹来", 0, 2)
		say("风紧扯呼。", 1148, 1, "周威信")
		dark()
		null(-2, 5)
		null(-2, 6)
		null(-2, 7)
		light()
		say("传说中的鸳鸯刀？" .. JY.Person[0].称呼 .. "，咱们去抢过来，正好给我爹爹做寿礼。 ", 77, 0)
		say("等一等，树林里还有人。", 0, 1)
		dark()
		light()
		say("什么人？鬼鬼祟祟的。", 1075, 0, "袁冠南")
		addevent(116, 5, 1, 0, 1, 8192)
		say("袁兄弟，又在这里装神弄鬼，只是这个东西却不是你的，拿来吧。", 1232, 1, "卓天雄")
		say("两人不到两句话，就动起手来，那瞎子武功极为了得，打得那书生不住倒退，眼看就有性命之忧", 0, 2)
		meet_self(625)
		say("" .. JY.Person[0].称呼 .. "，咱们救一救这书生吧。 ", 77, 0)
		say("正有此意。", 0, 1)
		say("住手！", 0, 1)
		say("居然还埋伏有帮手。<刚才怎么一点没听见声音，从哪儿冒出的高手？>", 1232, 0, "卓天雄")
		say("你们居然埋伏了这么多人，老瞎子记住了，青山绿水，后会有期。", 1232, 0, "卓天雄")
		dark()
		null(-2, 5)
		My_Enter_SubScene(116, 33, 31, 3)
		light()
		say("怎么一架没打就跑了？ ", 77, 1)
		say("多谢各位相救之恩。", 1075, 0, "袁冠南")
		say("喂，我要那把宝刀，你给不给我？ ", 77, 1)
		say("各位刚救了小生性命，既要这把宝刀，自然双手奉上。", 1075, 0, "袁冠南")
		say("你的良心倒是不坏，咦，怎么只有一把宝刀？ ", 77, 1)
		say("想必另一把被镖局的人藏起来了。", 1075, 0, "袁冠南")
		say("" .. JY.Person[0].称呼 .. "", 77, 1)
		say("他们往东边走了，咱们追上去。", 0, 1)
		say("恩公告辞了，有缘再会。", 1075, 0, "袁冠南")
		say("书生再见。", 77, 1)
		say("有缘再会。", 0, 1)
		addthing(217)
		dark()
		null(-2, 2)
		light()
		addevent(1, 31, 0, 1603, 3)
		addevent(1, 32, 0, 1603, 3)
	end
end
OEVENTLUA[1603] = function ()
	Cls()

	if instruct_16(77) then
		dark()
		null(-2, 31)
		null(-2, 32)
		addevent(1, 24, -2, -2, -2, 8192)
		addevent(1, 25, -2, -2, -2, 6094)
		addevent(1, 27, -2, -2, -2, 6094)
		addevent(1, 23, -2, -2, -2, 8896)
		addevent(1, 26, -2, -2, -2, 8948)
		light()
		say("老瞎子，快闪开。", 1130, 0, "林玉龙")
		say("往哪里跑，你还我孩子来。", 1242, 1, "任飞燕")
		say("快闪开！哎呦，你这老瞎子干什么？", 1130, 0, "林玉龙")
		say("装神弄鬼，你们是哪条道上的？", 1232, 1, "卓天雄")
		say("什么道？你快松开我穴道。", 1130, 0, "林玉龙")
		say("老瞎子，你敢欺负我老公，我砍死你。", 1242, 1, "任飞燕")
		say("哼。", 1232, 0, "卓天雄")
		say("" .. JY.Person[0].称呼 .. "，是那个老瞎子。", 77, 1)
		say("哎呦。", 1242, 0, "任飞燕")
		say("燕妹，你咋的了？", 1130, 1, "林玉龙")
		say("死汉子，你往谁的面前跑不是跑，你非要往这个老瞎子面前跑。", 1242, 0, "任飞燕")
		say("要不是你追的这么紧，我又怎么会跑得这么急？又怎么可能被这瞎子点着穴道。", 1130, 1, "林玉龙")
		say("我昨晚上让你照顾孩子你为啥偷懒，我做什么要打你，难道不是你个犯了错，你说你今天还偷偷带了孩子想撇开我自个出去玩。", 1242, 0, "任飞燕")
		say("好了，别演戏了，你们究竟是哪条道上的？", 1232, 1, "卓天雄")
		say("我们是你爹妈那条道上的，你个死瞎子，快放开姑奶奶。", 1242, 0, "任飞燕")
		say("不知死活。", 1232, 1, "卓天雄")
		say("啊~", 1130, 0, "林玉龙")
		say("死汉子，你怎么了？", 1242, 1, "任飞燕")
		say("哎呦~，我被这死瞎子在肚子上刺了一剑，哎呦，好疼，我要死了。", 1130, 0, "林玉龙")
		say("死瞎子，有本事就冲我来，干嘛伤我老公。你个死瞎子，臭瞎子，王八蛋。", 1242, 1, "任飞燕")
		say("你们两想死，我就成全你们。", 1232, 0, "卓天雄")
		say("住手！", 0, 1)
		say("又是你！上次是你们人多势众，让你跑了，今次看你怎么跑。", 1232, 0, "卓天雄")
		say("" .. JY.Person[0].称呼 .. "，咱们什么时候跑了？我怎么不知道？", 77, 1)
		say("妹子，你去救人，这个老瞎子装模作样的，还真以为自己是大高手，你看我怎么教训他。", 0, 0)

		if WarMain(304) == false then
			say("哎，失手了，这老瞎子怎么这么厉害！", 0, 1)
			say("妹子，我们快走，留得青山在！", 0, 1)
			dark()
			My_Enter_SubScene(1, 23, 51, 3)
			null(-2, 23)
			null(-2, 26)
			light()
			say("快走，快走！", 1242, 1, "任飞燕")
			say("咱们要跑么？往哪儿跑？", 77, 0)
			say("离这儿不远有个废弃的寺庙，咱们去那儿躲躲。", 1242, 1, "任飞燕")
			say("" .. JY.Person[0].称呼 .. "，跟着你可真刺激，咱们要不要化妆逃跑？书上都说躲避仇家化妆就好了。", 77, 0)
			say("~", 0, 1)
			dark()
			null(-2, 24)
			null(-2, 25)
			null(-2, 27)
			My_Enter_SubScene(63, 20, 44, 0)
			light()
			addevent(63, 22, 0, 1604, 3)
			addevent(63, 23, 0, 1604, 3)
			addevent(63, 24, 0, 1604, 3)
			addevent(63, 29, 0, 1605, 3)
		else
			say("老瞎子，你就这点本事？老装个高手的样子干什么？刀呢？拿出来！", 0, 1)
			say("哼。", 1232, 0, "卓天雄")
			say("哼什么哼，你不给我不会自己拿？", 0, 1)
			addthing(218)
			addthing(109)
			dark()
			My_Enter_SubScene(1, 22, 19, 3)
			null(-2, 24)
			null(-2, 25)
			null(-2, 27)
			light()
			say("嘻嘻，得到鸳鸯双刀了，我看看有什么大秘密？仁者~，无敌~，这，什么嘛，大骗子。", 77, 0)
			say("我看看，刀背上还有个数字，鸳刀上是426。", 0, 1)
			say("果然有，鸯刀上是37。这是什么意思？", 77, 0)
			say("似乎是地图的坐标，看这位置是在东方海外啊。", 0, 1)
			say("要出海啊，好啊好啊。" .. JY.Person[0].称呼 .. "，我还没有看见过大海呢，海外仙岛，秘籍和宝藏，哎呀哎呀，真刺激。", 77, 0)
			say("~，真是充满活力和干劲啊。", 0, 1)
			say("多谢两位相助之恩。", 1130, 0, "林玉龙")
			say("多谢两位相助，我要送龙哥去治伤，咱们有缘再见。", 1242, 1, "任飞燕")
			null(-2, 23)
			null(-2, 26)
			instruct_39(125)
		end
	end
end
OEVENTLUA[1604] = function ()
	Cls()

	if instruct_16(77) then
		dark()
		addevent(-2, 4, -2, -2, -2, 7986)
		addevent(-2, 13, -2, -2, -2, 6096)
		addevent(-2, 19, -2, -2, -2, 6096)
		light()
		say("大人，他们就在前面。", 1053, 0, "官兵")
		say("不好，他们追来了。", 1242, 1, "任飞燕")
		say("咱们先躲到庙里去。", 1130, 0, "林玉龙")
		dark()
		My_Enter_SubScene(63, 16, 17, 0)
		addevent(-2, 26, -2, -2, -2, 8602)
		addevent(-2, 27, -2, -2, -2, 8878)
		addevent(-2, 28, -2, -2, -2, 8950)
		light()
		say("这可麻烦了，咱们被堵在庙里了。", 0, 1)
		say("咱们再打出去吧。", 77, 0)
		say("咱们可以打出去，可是林大哥这伤势，只怕~。", 0, 1)
		say("死就死，你们趁他们还没有围死，赶快逃出去吧。", 1130, 0, "林玉龙")
		say("我们不走，要死一起死，咱们和他们拼了。", 77, 1)
		say("龙哥~。", 1242, 0, "任飞燕")
		say("燕妹~。", 1130, 1, "林玉龙")
		say("哎呀，看不下去去了。咱们赶快出去拼了吧。", 77, 0)
		say("等一等，我们还有个办法，只是不知道能不能成。", 1242, 1, "任飞燕")
		say("我们有一套刀法，威力极大，只是需要两人同使，而且这两人要心有灵犀，夫妻同心才能发挥这武功的威力。", 1242, 1, "任飞燕")
		say("那你们干嘛不早早使用？", 77, 0)
		say("哎，我们两性子急躁，使这刀法总是不行。现下我教给你们，时间这么紧，也不知道行也不行。", 1130, 1, "林玉龙")
		say("我没有问题。", 0, 0)
		say("哎呀，你这人，这是说能行就能行的吗？姑娘，你呢？", 1242, 1, "任飞燕")
		say("啊，我~，我~", 77, 0)
		say("别婆婆妈妈的了，赶快的，一会他们就冲进来了。", 1130, 1, "林玉龙")
		dark()
		null(-2, 4)
		null(-2, 13)
		null(-2, 19)
		addevent(-2, 22, -2, -2, -2, 7986)
		addevent(-2, 23, -2, -2, -2, 6096)
		addevent(-2, 24, -2, -2, -2, 6096)
		light()
		addthing(140)

		local var_57_0 = JY.Person[0].主功体
		local var_57_1 = JY.Person[77].主功体

		stop_ng(0)
		stop_ng(77)
		instruct_35(77, 1, 62, 50)
		instruct_35(0, 2, 62, 50)
		star_ng(0, var_57_0)
		star_ng(77, var_57_1)
		say("把刀交出来吧，我可以饶你们不死。", 1232, 0, "卓天雄")
		say("少侠，交给你们了，大佛，大佛你保佑我们啊。", 1130, 1, "林玉龙")
		say("放心，我们一定把你救出去。", 77, 0)

		if WarMain(236) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		null(-2, 22)
		null(-2, 23)
		null(-2, 24)
		null(-2, 29)
		addthing(218)
		addthing(166)
		say("大哥，大姐，我们打赢了。", 77, 0)
		say("嘻嘻，又得到一把宝刀了，我看看有什么大秘密？仁者~，无敌~，这，什么嘛，大骗子。", 77, 0)
		say("我看看，刀背上还有个数字，鸳刀上是426。", 0, 1)
		say("果然有，鸯刀上是37。这是什么意思？", 77, 0)
		say("似乎是地图的坐标，看这位置是在东方海外啊。", 0, 1)
		say("要出海啊，好啊好啊。" .. JY.Person[0].称呼 .. "，我还没有看见过大海呢，海外仙岛，秘籍和宝藏，哎呀哎呀，真刺激。", 77, 0)
		say("~，真是充满活力和干劲啊。", 1130, 1, "林玉龙")
		say("多谢两位相助，我要送龙哥去治伤，咱们有缘再见。", 1242, 0, "任飞燕")
		null(-2, 27)
		null(-2, 28)
		say("哎，不要我们帮忙吗？", 77, 1)
		say("哎，走得好快，" .. JY.Person[0].称呼 .. "，咱们也走吧，找宝贝去也。", 77, 1)
		null(-2, 26)
		instruct_39(125)
	end
end
OEVENTLUA[1605] = function ()
	Cls()
	dark()
	light()
	say("先别出去，老瞎子带人正在四处搜索咱们呢，咱们到寺院里面去！", 0, 1)
	My_Enter_SubScene(63, 20, 35, 0)
end
OEVENTLUA[1680] = function ()
	say("茅兄弟，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(588)
	instruct_3(70, 88, 1, 0, 1681, 0, 0, 7022, 7022, 7022, -2, -2, -2)
end
OEVENTLUA[1681] = function ()
	say("有需要我帮忙的地方吗？", 269, 0, "茅十八")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(588)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 269, 0, "茅十八")
		Cls()

		return
	end
end
OEVENTLUA[1682] = function ()
	say("小宝，你先忙你的事情，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(600)
	instruct_3(108, 16, 1, 0, 1683, 0, 0, 8668, 8668, 8668, -2, -2, -2)
end
OEVENTLUA[1683] = function ()
	say("有需要我帮忙的地方吗？", 225, 0, "韦小宝")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(600)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 225, 0, "韦小宝")
		Cls()

		return
	end
end
OEVENTLUA[1684] = function ()
	say("妹子，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(77)
	instruct_3(70, 50, 1, 0, 1685, 0, 0, 7248, 7248, 7248, -2, -2, -2)
end
OEVENTLUA[1685] = function ()
	say2("有需要我帮忙的地方吗？", 77, 0, "萧中慧")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(77)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 77, 0, "萧中慧")
		Cls()

		return
	end
end
OEVENTLUA[1686] = function ()
	say("妹子，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(86)
	instruct_3(70, 107, 1, 0, 1687, 0, 0, 9300, 9300, 9300, -2, -2, -2)
end
OEVENTLUA[1687] = function ()
	if inteam(91) then
		say("青青姐姐好。", 86, 0, "阿珂")
		say("啊，好，这么美丽的小姑娘，难怪" .. JY.Person[0].称呼 .. "那么喜欢你。", 91, 1)
		addevent(70, 108, 0, 1720, 3, -2)
		instruct_21(91)
	else
		say("有需要我帮忙的地方吗？", 86, 0, "阿珂")
		Cls()

		if instruct_9() then
			if instruct_20() == false then
				instruct_10(86)
				instruct_14()
				instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
				Cls()
				instruct_13()

				return
			end

			say("你的队伍已满，我无法加入。", 86, 0, "阿珂")
			Cls()

			return
		end

		return
	end
end
OEVENTLUA[1688] = function ()
	say("总舵主，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(587)
	instruct_3(70, 26, 1, 0, 1689, 0, 0, 8888, 8888, 8888, -2, -2, -2)
end
OEVENTLUA[1689] = function ()
	say("有需要我帮忙的地方吗？", 268, 0, "陈近南")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(587)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say2("你的队伍已满，我无法加入。", 268, 0, "陈近南")
		Cls()

		return
	end
end
