OEVENTLUA[1701] = function ()
	Cls()
	null(-2, 29)
	say("姓温的，你讲不讲江湖义气？", 1012, 0, "帮众")
	say("讲又怎样，不讲又怎样？", 91, 1)
	say("我们辛辛苦苦的从九江一路跟踪下来，你倒好，半路里杀出来吃横梁子！", 1024, 0, "沙老大")
	say("天下的财天下人发得，难道这金子是你的？", 91, 1)
	say("快把两千两金子拿出来，大家平分了。咱们双方各得一千两，就算便宜你。", 1024, 0, "沙老大")
	say("沙大哥，何必跟这横蛮的东西多费口舌！他不要一千两金子，那么一个子儿也不给他。", 1019, 1, "帮众")
	say("当我怕你吗？救命啊，救命啊，强盗抢劫了！", 91, 0)
	say("只见一个面貌俊秀的美貌少年被几个汉子围在当中。", 0, 1)
	meet_self(91)

	if yesno("要上去帮忙吗？") then
		instruct_37(1)
		say("青天白日，你们这是要当众抢劫吗？", 0, 1)
		say("臭小子，原来还有帮手！", 1024, 0, "沙老大")

		if WarMain(296, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(-2, 13)
		null(-2, 14)
		addevent(123, 12, 1, -2, 1, 8420)
		light()
		say("小兄弟，你没事吧？", 0, 1)
		say("我没事，你也是为这金子来的？", 91, 0)
		say("什么金子？我就是帮你忙的。", 0, 1)
		addevent(-2, 15, 1, -2, -2, 9154)
		addevent(-2, 16, 1, -2, -2, 5404)
		say("怪不得你这娃儿越来越大胆啦，原来有了这么硬的一个帮手。他是你的相好么？", 1031, 0, "荣彩")
		say("哼！" .. JY.Person[0].称呼 .. "，又有人要欺负我了，你还愿意帮我吗？", 91, 1)
		say("那当然，这帮恶人，总得有人教训教训他们。", 0, 1)
		say("那就谢谢你啦，有时间到扬州去找我玩，我姓温。", 91, 1)
		dark()
		null(-2, 12)
		light()
		say("哪里走？", 1031, 0, "荣彩")
		say("有我在你们哪也别去了。", 0, 1)
		say("哼，懒得跟你费工夫，我们走。", 1031, 0, "荣彩")
		null(-2, 15)
		null(-2, 16)
		addevent(69, 34, 1, 1702, 1, 7032)
		addevent(118, 7, 0, 1703, 3, -2)
		addevent(118, 8, 0, 1703, 3, -2)
		addevent(118, 4, 1, -2, 1, 6818)
		addevent(118, 5, 1, -2, 1, 8708)
		addevent(118, 6, 1, -2, 1, 6784)
	else
		addevent(-2, 16, 1, -2, -2, 6818)
		say("青天白日，你们这是要当众抢劫吗？", 54, 0)
		say("臭小子，原来还有帮手！", 1024, 1, "沙老大")
		dark()
		null(-2, 13)
		null(-2, 14)
		light()
		say("多谢你啦，有时间到扬州去找我玩，我姓温，叫温青，记住啦。", 91, 0)
		say("小兄弟相约，改日定当造访。", 54, 1)
		dark()
		null(-2, 12)
		light()
		say("兄弟好俊的功夫，不知兄弟尊姓大名。", 0, 1)
		say("不敢，小弟袁承志。", 54, 0)
		say("我与兄弟一见投缘，不如同饮一杯如何？", 0, 1)
		say("如此甚好。", 54, 0)
		dark()
		light()
		say("半日之后", 0, 2)
		say("小弟还有事要办，" .. JY.Person[0].称呼 .. "，咱们有缘江湖再会。", 54, 0)
		say("有缘再会。", 0, 1)
		null(-2, 16)
		say("江湖果然是多奇人异士啊。", 0, 1)
		addevent(118, 7, 0, 1703, 3, -2)
		addevent(118, 8, 0, 1703, 3, -2)
		addevent(118, 4, 1, -2, 1, 6818)
		addevent(118, 5, 1, -2, 1, 8708)
		addevent(118, 6, 1, -2, 1, 6746)
	end

	addevent(69, 39, 1, 1718, 1, 9356)
end
OEVENTLUA[1702] = function ()
	Cls()
	say("你来了。", 91, 0)
	say("姑娘是？", 0, 1)
	say("" .. JY.Person[0].称呼 .. "，又有人要欺负我了，你还愿意帮我吗？", 91, 0)
	say("啊？是你！原来小兄弟你是女儿身。", 0, 1)
	say("只见她改穿女装，秀眉凤目，玉颊樱唇，竟是一个绝色的美貌佳人", 0, 2)
	say("是我啊，" .. JY.Person[0].称呼 .. "，上次我抢到2000两银子，分你一半。", 91, 0)

	if yesno("要银子吗？") then
		say("姑娘，恭敬不如从命。", 0, 1)
		addevent(69, 37, 1, 0, 1, 6050)
		addevent(69, 36, 1, 0, 1, 5970)
		say("要从我温家堡取走银子，那怎么可能，青青，你让开，我们考较考较这位朋友。", 1035, 0, "温老大")
		say("大爷爷，你可别杀了他，他毕竟上次帮了我。", 91, 1)
		say("看着办吧。", 1034, 0, "温老二")

		if WarMain(298, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("朋友好俊的身手，所谓见面一半，我们给你这个面子，青青，给他1000两吧。", 1035, 0, "温老大")
		addthing(174, 1000)
		say("银子也拿到了，朋友请吧。", 1034, 0, "温老二")
		say("姑娘，我", 0, 1)
		say("请。", 1034, 0, "温老二")
		My_Enter_SubScene(69, 25, 46, 3)
		dark()
		null(-2, 34)
		null(-2, 36)
		null(-2, 37)
		My_Enter_SubScene(69, 25, 46, 3)
		light()
	else
		say("姑娘，我救你可不是为了金子。", 0, 1)
		say("那是为了什么？", 91, 0)
		say("自然是我愿意帮助姑娘。", 0, 1)
		say("你对我真好，我叫温青青，你叫我青青吧。咱们出去走走，我带你转转扬州城。", 91, 0)
		say("恭敬不如从命。", 0, 1)
		dark()
		null(-2, 34)
		addevent(-2, 22, 1, -2, 1, 7032)
		addevent(-2, 36, 1, -2, 1, 8952)
		My_Enter_SubScene(69, 17, 37, 2)
		light()
		say("这是我最喜欢来的地方，安静，没有人来打扰。", 91, 0)
		say("很漂亮。", 0, 1)
		say("只见一池清水，安静荡漾，微微雾气升起，缥缈有若仙境", 0, 2)
		say("是啊，很漂亮，可是我看了16年了，还想看看其他的地方。", 91, 0)
		say("" .. JY.Person[0].称呼 .. "，我想跟着你一起闯荡江湖，可以吗？", 91, 0)
		say("那是我的荣幸。", 0, 1)
		say("太好了，走之前，陪我去看看我娘，我走了，她在家里就没有亲人了。", 91, 0)
		dark()
		null(-2, 22)
		addevent(-2, 34, 1, -2, 1, 7032)
		My_Enter_SubScene(69, 9, 49, 3)
		light()
		say("娘，我想跟着这位" .. JY.Person[0].称呼 .. "去江湖闯荡了。", 91, 0)
		say("哎，女儿长大了。你就跟你爹当年一样的性子，在一个地方待不住。", 521, 1, "温仪")
		say("娘。", 91, 0)
		say("我女儿从来没有这么相信过一个人，这位少侠，你能答应我照顾好我女儿吗？", 521, 1, "温仪")
		say("放心吧，我一定照顾好青青。", 0, 0)
		say("好，那我就放心了。", 521, 1, "温仪")
		say("娘，这次我出去一定会把爹爹找回来，你就不要伤心了。", 91, 0)
		say("哎，你不用担心我，去吧。", 521, 1, "温仪")
		say("" .. JY.Person[0].称呼 .. "，我们走吧。娘，我过段时间就回来看你。", 91, 0)

		if instruct_20() then
			Cls()
			say("你的队伍已满，我就直接去小村吧。", 91, 0)
			null(-2, 34)
			say("哎，女儿长大了。", 521, 1, "温仪")
			null(-2, 36)
			instruct_3(70, 109, 1, 0, 1785, 0, 0, 8420, 8420, 8420, -2, -2, -2)

			return
		end

		instruct_10(91)
		say("温青青加入队伍", 0, 2)
		null(-2, 34)
		say("哎，女儿长大了。", 521, 1, "温仪")
		null(-2, 36)
	end
end
OEVENTLUA[1703] = function ()
	Cls()
	dark()
	null(-2, 7)
	null(-2, 8)
	light()
	say("这们这些卖国求荣的家伙，难道还不知道悔改，想杀人灭口吗？", 54, 0)
	say("你看见了我们的秘密，如何能够留你。", 1053, 1, "江湖帮众")
	say("哼，串通外国，出卖朋友，今日我就为民除害。", 54, 0)
	say("真是正义啊，可惜，可惜，今日就要死在这儿了，以后还有谁来除害呢，真是可惜。", 1053, 1, "江湖帮众")
	say("你！", 54, 0)
	meet_self(54)
	say("哦，这么多人？你们，将身上的东西都交出来，跪地不杀！", 0, 1)
	say("疯子汉人，居然到这儿抢劫。", 1150, 0, "一品堂武士")
	say("少侠！", 54, 1)
	say("袁兄，我们又见面了。", 0, 0)
	say("原来是一伙的，都杀了。", 1150, 1, "一品堂武士")

	if WarMain(299, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	null(-2, 5)
	null(-2, 6)
	addthing(232, 1)
	addthing(164, 1)
	say("好厉害，这个西夏武士是什么人？。", 0, 1)
	say("这是西夏一品堂的高手，这次多谢" .. JY.Person[0].称呼 .. "相助了。", 54, 0)
	say("袁兄，你我一见如故，遇见这等卖国贼，正当手刃方才痛快。", 0, 1)
	say("" .. JY.Person[0].称呼 .. "正是我辈众人，今日见到这等卖国贼，不将他们挖出来日后必将酿成大祸。", 54, 0)
	say("不错，刚才搜到一封太白三英的通敌书信，不知袁兄可知这太白三英是什么人？", 0, 1)
	say("这个太白三英我听说过，似乎是在扬州左近极为有名，咱们都调查一下，扬州汇合如何？", 54, 0)
	say("好。", 0, 1)
	instruct_37(1)
	null(-2, 4)
	addevent(95, 6, 1, 1704, 1, -2)
end
OEVENTLUA[1704] = function ()
	Cls()

	if JY.Person[0].性别 == 0 then
		say("少侠好。", 127, 0, "帮众")
	else
		say("女侠好。", 127, 0, "帮众")
	end

	Cls()
	say("大功坊的人怎么都没了，近日是有什么事情发生吗？", 0, 1)
	Cls()
	say("是的，听说金龙帮的帮主焦公礼几年前杀害了仙都派闵子华的哥哥，所以闵子华邀请武林好手，去找焦公礼报仇。", 127, 0, "帮众")
	Cls()
	say("几年前杀的？闵子华怎么知道是焦公礼下的手？", 0, 1)
	Cls()
	say("据说是太白三英告诉他的。", 127, 0, "帮众")
	Cls()
	say("太白三英？那几个卖国贼？我们正要找他们呢。", 0, 1)
	Cls()
	addevent(59, 29, 0, 1705, 3, -2)
	null(59, 0)
	instruct_3(59, 15, 1, 0, 1707, 0, 0, 8214, 8214, 8214, -2, -2, -2)
	instruct_3(59, 14, 1, 0, 1706, 0, 0, 8304, 8304, 8304, -2, -2, -2)
	instruct_3(59, 18, 0, 0, 0, 0, 0, 6106, 6106, 6106, -2, -2, -2)
	instruct_3(59, 17, 0, 0, 0, 0, 0, 5388, 5388, 5388, -2, -2, -2)
	instruct_3(59, 16, 0, 0, 0, 0, 0, 5420, 5420, 5420, -2, -2, -2)
	instruct_3(59, 21, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(59, 22, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(59, 19, 0, 0, 0, 0, 0, 5404, 5404, 5404, -2, -2, -2)
	instruct_3(59, 20, 0, 0, 0, 0, 0, 5412, 5412, 5412, -2, -2, -2)
	instruct_3(59, 24, 0, 0, 0, 0, 0, 6092, 6092, 6092, -2, -2, -2)
	instruct_3(59, 23, 0, 0, 0, 0, 0, 6366, 6366, 6366, -2, -2, -2)
	instruct_3(59, 25, 0, 0, 0, 0, 0, 6366, 6366, 6366, -2, -2, -2)
	instruct_3(59, 26, 0, 0, 0, 0, 0, 5186, 5186, 5186, -2, -2, -2)
	instruct_3(59, 27, 0, 0, 0, 0, 0, 7060, 7060, 7060, -2, -2, -2)
	instruct_3(59, 29, 0, 0, 0, 0, 1705, -2, -2, -2, -2, -2, -2)
end
OEVENTLUA[1705] = function ()
	Cls()
	instruct_14()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_13()
	instruct_25(25, 43, 25, 36)
	say("焦公礼，你杀了我大哥，今日还相抵赖么？", 181, 0)
	Cls()
	say("闵二爷怎么这么大的火气，有话慢慢说。", 1052, 1, "焦公礼")
	Cls()
	say("谁跟你慢慢说，今日我定要为兄报仇！", 181, 0)
	Cls()
	meet_self(177)
	meet_self(178)
	meet_self(179)
	meet_self(180)
	meet_self(181)
	meet_self(182)
	meet_self(183)
	say("且慢！", 0, 1)
	Cls()
	instruct_25(31, 36, 25, 43)
	instruct_30(25, 43, 25, 42)
	instruct_30(25, 42, 32, 42)
	instruct_30(32, 42, 32, 36)
	instruct_40(2)
	Cls()
	say("请各位看一看这是什么？", 0, 1)
	Cls()
	instruct_14()
	addthing(232, -1)
	instruct_13()
	say("这……这……我大哥他……", 181, 0)
	Cls()
	say("闵二爷，我看今日之事就此作罢吧，你们化干戈为玉帛……", 0, 1)
	Cls()
	say("哼，谁知道你这些东西是不是自己伪造的！", 183, 0)
	Cls()
	instruct_14()
	instruct_13()
	say("你，你，居然把证据撕毁，姓梅的，你还要不要脸！", 0, 1)
	Cls()
	say("也不知是谁不要脸了？害死了人家兄长，还造几封狗屁不通的书信来冤枉死人。反正人已经死了，任你撒个弥天大谎！", 183, 0)
	Cls()
	say("不错，杀兄大仇不可不报！洞玄师弟，我们拿下这个小子，问问是谁在背后诬陷闽大哥！", 181, 1)
	Cls()

	if inteam(91) then
		say("两个打一个，好没羞！", 91, 0)
		Cls()
		say("臭丫头，没见过世面，仙都派两仪剑法，向来是两人同使！", 181, 1)
		Cls()
		say("你——！好，我们就来赌一把，二位一起上，如果能赢得了这位" .. JY.Person[0].称呼 .. "，我们马上离开此地。如果你们输了，大功坊的房子就归我！怎么样，敢赌么？", 91, 0)
		Cls()
		say("哼，赌就赌，看我在这小子身上戳两个透明窟窿！洞玄师弟，我们上！", 181, 1)
		Cls()
	end

	if WarMain(158, 0) == false then
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_13()
	say("你……你……", 181, 0)

	if inteam(91) then
		say("哈哈，大功坊的房子归我喽！", 91, 1)
	end

	say("阁下武功了得，梅某来领教一二。", 183, 0)
	Cls()

	if WarMain(159, 0) == false then
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_13()
	say("技不如人，梅某告辞！", 183, 0)
	Cls()
	say("别想跑～", 0, 1)
	Cls()
	say("怎么？阁下还想赶尽杀绝么？", 183, 0)
	Cls()
	say("梅大哥，不是说你，我是说太白三英！", 0, 1)
	Cls()
	say("哼！你有点欺人太甚了吧，大伙一起上！", 183, 0)
	Cls()

	if WarMain(160, 0) == false then
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_13()
	say("太白三英，你们里通外国，今日受死吧！", 0, 1)
	say("你...", 183, 0)
	say("这太白三英，里通外国，挑拨离间，今日之事全是他们挑起的。梅大哥、闵二爷，我看此事就此罢手吧。", 0, 1)
	Cls()
	say("……告辞！", 183, 0)
	Cls()
	say("闵二爷，咱们打的赌呢？", 91, 1)
	Cls()
	say("哼，闵某说话算话，大功坊归你了。告辞！", 181, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_37(3)
	Cls()
	instruct_13()

	if inteam(91) then
		say("哈哈，我赢了他的房子，哈哈哈，" .. JY.Person[0].称呼 .. "，咱们这就去大功坊好好玩玩。", 91, 0)
		say("你……唉，真拿你没办法……", 0, 1)

		JY.Person[91].好感度 = 51
	end

	dark()
	addevent(59, 20, 1, -2, 1, 6818)
	light()
	say("" .. JY.Person[0].称呼 .. "，多谢你了。", 54, 0)
	say("袁兄是早到了吧？怎么不出来主持大局？", 0, 1)
	say("哎。", 54, 0)
	Cls()

	if JY.Person[0].性别 == 0 then
		say("这梅剑和、刘培生都是华山拳派的，算起来还是我的晚辈，我今日实在不便出手干预。幸亏兄台你在。", 54, 0)
	else
		say("这梅剑和、刘培生都是华山拳派的，算起来还是我的晚辈，我今日实在不便出手干预。幸亏女侠你在。", 54, 0)
	end

	say("原来如此，袁兄客气了。", 0, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 12, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 11, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 10, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 9, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 8, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 7, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 6, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 5, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 4, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 3, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 2, 1, 0, 330, 0, 0, -2, -2, -2, -2, -2, -2)
	Cls()
	instruct_13()
	say("金龙帮上下全体帮众感谢" .. JY.Person[0].称呼 .. "大恩大德。", 1052, 0, "焦公礼")
	Cls()
	say("焦帮主太客气了。", 0, 1)
	dark()
	addevent(59, 25, 1, -2, 1, 5178)
	light()
	Cls()
	say("敢问袁小师叔可在？", 190, 0)
	say("我就是。", 54, 1)
	say("师父知道袁小师叔帮助外人对付同门，很是失望，师父约你月中到华山相会。", 190, 0)
	say("大师兄？ 请转告大师兄，小弟必然赴约。", 54, 1)
	dark()
	null(-2, 25)
	light()
	say("袁兄？", 0, 1)
	say("哎，江湖传闻大师兄极为护短，今日看来果然不假。", 54, 0)
	say("袁兄，此事我是清楚的，到时我和你同去，给你做个见证，想必令师必不会见怪。", 0, 1)
	dark()
	addevent(-2, 29, 1, -2, 1, 8960)
	light()
	say("哈哈哈，袁师侄，你不用担心，到时老道也给你作证，你师父不会怪你的。", 1023, 0, "木桑")
	say("木桑道长，你怎么也来了。", 54, 1)
	say("不来就看不到你们做的事了，你们做的很好，我在河洛客栈休息，师侄，去赔老头儿下盘棋去。", 1023, 0, "木桑")
	say("是，道长。", 54, 1)
	dark()
	null(-2, 20)
	null(-2, 30)
	null(-2, 29)
	light()
	addevent(1, 34, 1, 1708, 1, 8964)
	addevent(1, 19, 1, 1708, 1, 6818)
	addevent(-2, 23, 1, 1706, 1, -2)
	addevent(-2, 24, 1, 1707, 1, -2)
	addevent(95, 6, 1, 9952, 1, 5204)
end
OEVENTLUA[1706] = function ()
	Cls()

	if has_thing(51) == false then
		say("多谢" .. JY.Person[0].称呼 .. "救了家父一命。", 1085, 0, "焦宛儿")
		Cls()
		say("宛儿姑娘，太客气了。", 0, 1)
		Cls()
		say("这根金龙鞭，请" .. JY.Person[0].称呼 .. "收下，*且莫推辞。", 1085, 0, "焦宛儿")
		Cls()
		say("嗯，好吧，多谢宛儿姑娘。", 0, 1)
		Cls()
		addthing(51, 1)
		Cls()

		return
	else
		say("多谢" .. JY.Person[0].称呼 .. "救了家父一命。", 1085, 0, "焦宛儿")
		Cls()
		say("宛儿姑娘，太客气了。", 0, 1)
	end
end
OEVENTLUA[1707] = function ()
	Cls()
	say("金龙帮上下全体帮众感谢" .. JY.Person[0].称呼 .. "大恩大德。", 1052, 0, "焦公礼")
	Cls()
	say("焦帮主太客气了。", 0, 1)
end
OEVENTLUA[1708] = function ()
	Cls()
	say("袁兄，道长，你们还在下棋啊。", 0, 1)
	say("" .. JY.Person[0].称呼 .. "，你来了。", 54, 0)
	say("别说话，观棋不语。", 1023, 1, "木桑")
	say("~", 0, 1)

	if instruct_16(91) then
		say("小姑娘，给我们倒杯茶。", 1023, 0, "木桑")
		addevent(1, 33, 1, -2, 1, 8424)
		say("好啊，我看看你们下棋。", 91, 1)
		dark()
		light()
		say("一夜无话", 0, 2)
		say("师侄，你又输了。", 1023, 0, "木桑")
		say("是，道长棋艺高超，不愧是江湖号称千变万劫，果是变化无穷。", 54, 1)
		say("你就不用拍我马屁了，走了，走了，咱们一块去华山吧。", 1023, 0, "木桑")
		say("" .. JY.Person[0].称呼 .. "，我和道长先走一步，咱们有缘再见。", 54, 1)
		dark()
		null(-2, 19)
		null(-2, 34)
		addevent(1, 33, 1, -2, 1, 8426)
		light()
		say("" .. JY.Person[0].称呼 .. "，昨天道长教了我一门轻功，你要不要学？", 91, 0)
		say("有厉害的武功？自然要学的。", 0, 1)
		say("给，这是昨晚我抄写的秘笈。", 91, 0)
		addthing(246, 1)
		say("好高妙的轻功。", 0, 1)
		say("这下知道我的好了吧，以后要一心一意的对我好，知道不？", 91, 0)
		say("好好，我不对青青好谁对青青好。", 0, 1)
		say("我跟你说，这门轻功叫神行百变，可厉害了。", 91, 0)
		stop_ng(91)
		instruct_35(54, 2, 131, 100)
		instruct_35(91, 1, 131, 50)
		instruct_45(91, 20)
		say("所以说，你跟着我是有福气的。", 91, 0)
		say("是啊是啊，咱们青青真厉害。", 0, 1)
		say("走，咱两闯荡江湖去也。", 91, 0)
		say("你陪我先去华山的后山看看我爹爹。", 91, 0)
		say("华山后山？", 0, 1)
		say("是啊，袁公子说我爹爹葬在那儿，我要去看看，看他是不是真的死在那儿了。", 91, 0)
		say("青青。", 0, 1)
		say("别担心，从小我爹就抛下了我娘，留下她一个人孤苦伶仃的一个人，听说他死了我也没有什么伤心的。", 91, 0)
		say("<哎！青青虽然这么说，只怕心里还是很难过的。>", 0, 1)
		instruct_17(80, 1, 31, 15, 0)
		null(-2, 33)
	else
		dark()
		light()
		say("一夜无话", 0, 2)
		say("师侄，你又输了。", 1023, 0, "木桑")
		say("是，道长棋艺高超，不愧是江湖号称千变万劫，果是变化无穷。", 54, 1)
		say("你就不用拍我马屁了，走了，走了，咱们一块去华山吧。", 1023, 0, "木桑")
		say("" .. JY.Person[0].称呼 .. "，我和道长先走一步，咱们有缘再见。", 54, 1)
		dark()
		null(-2, 19)
		null(-2, 34)
		light()
		say("这道长真是风风火火的啊。", 0, 0)
		instruct_35(54, 2, 131, 100)
	end

	addevent(59, 29, 0, 1709, 3, -2)
	addevent(59, 14, 1, -2, 1, 7144)
	addevent(59, 15, 1, -2, 1, 8314)
end
OEVENTLUA[1709] = function ()
	Cls()
	instruct_30(25, 43, 25, 42)
	instruct_30(25, 42, 32, 42)
	instruct_30(32, 42, 32, 36)
	instruct_40(1)
	Cls()
	say("发生了什么事，怎么金龙帮的人都死了？", 0, 1)
	say("......", 1085, 0, "焦宛儿")
	say("焦姑娘，你怎么样了？", 0, 1)
	say("我，我不行了......", 1085, 0, "焦宛儿")
	say("呜呜呜，爹，师兄，你们死得好惨......", 1085, 0, "焦宛儿")
	say("这是怎么回事？", 0, 1)
	say("华山拳派的飞天魔女孙仲君带人来突袭我们，他们都死了，都死了，华山拳派，孙仲君。", 1085, 0, "焦宛儿")
	say("......", 0, 1)
	say("焦姑娘？", 0, 1)
	say("焦姑娘？", 0, 1)
	say("此人已死", 0, 2)
	addthing(185, 1)
	say("哎，可怜，入土为安，一路走好。", 0, 1)
	dark()
	null(-2, 29)
	null(-2, 14)
	null(-2, 15)
	light()
	say("华山拳派，孙仲君，好狠。", 0, 1)
	addevent(61, 40, 0, 1710, 3, -2)
	addevent(61, 41, 1, -2, 1, 7216)
	addevent(61, 42, 1, -2, 1, 10106)
	addevent(61, 43, 1, -2, 1, 8784)
end
OEVENTLUA[1710] = function ()
	Cls()
	dark()
	null(-2, 40)
	light()
	say("师父，这袁小子一定是假冒的，如果真是师叔，怎么可能那么年轻。", 1219, 0, "孙仲君")
	say("这倒是不一定，我听师傅说过他收了个徒弟，算起来年纪应该也不会太大。", 1006, 1, "归辛树")
	say("如果真是师叔，怎么还能帮着外人打你徒弟，这又如何给了师父面子？", 1219, 0, "孙仲君")
	say("不错，做这样的事，是让外人看咱们华山拳派的笑话，这让华山拳派颜面何存？", 1119, 1, "归二娘")
	meet_self(186)
	say("什么人？", 1006, 1, "归辛树")
	dark()
	addevent(61, 13, 1, -2, 1, 6818)
	light()
	say("小弟袁承志，拜见二师兄，拜见二师嫂。", 54, 0)
	say("不敢，还不知道你这个小师弟是真是假，归二爷，你看呢？", 1119, 1, "归二娘")
	say("小师弟，不如让我看看你的功夫。", 1006, 0, "归辛树")
	say("小弟如何敢跟师兄动手。", 54, 1)
	say("怎么，假冒的就是假冒的，总会漏出尾巴。", 1119, 0, "归二娘")
	say("既然如此，还请师兄指教。", 54, 1)
	WarMain(294)
	say("果然是假冒的，归二爷，把他招子废了，让他不长眼睛。", 1119, 0, "归二娘")
	say("他确是师父新收的小师弟。", 1006, 1, "归辛树")
	say("是小师弟就能打自己人了？这孩子是不是长劈了。", 1119, 0, "归二娘")
	say("师兄，我这次来是因为丁师侄犯了门规，她带人灭了金龙帮满门。", 54, 1)
	say("金龙帮敢和我华山拳派作对，那是死有余辜。", 1119, 0, "归二娘")
	say("敏君，是你干的吗？", 1006, 1, "归辛树")
	say("师父，我没有。", 1219, 0, "孙仲君")
	say("小小年纪，还学会栽赃嫁祸了，真是落了咱们的脸。", 1119, 1, "归二娘")
	say("师兄，你怎么说？", 54, 0)
	say("敏君从小就听话懂事，她是不会骗我的。师弟，江湖险恶，你可不要上了别人的当。", 1006, 1, "归辛树")
	say("~", 54, 0)
	say("既如此，我也无话可说，只能请师父做主了。", 54, 0)
	say("~", 1006, 1, "归辛树")
	say("既然如此，师弟，那咱们华山见吧。", 1006, 1, "归辛树")
	say("哼，刚学了点本事，心就往外拐了。", 1119, 0, "归二娘")
	say("走吧，也好久没见到师父了。", 1006, 1, "归辛树")
	say("等等，你们将金龙帮上下百余人杀了一个干干净净，如此恶毒之人，还在背后说人闲话，如何有脸活在世上？", 0, 0)
	say("这是要寻死吗？在我们夫妻面前敢说华山拳派的不是。", 1119, 1, "归二娘")
	say("你是什么人？", 1006, 0, "归辛树")
	say("师父，定是袁小子找来的帮手，要找我们的岔，灭我们的脸面。", 1219, 1, "孙仲君")
	say("废话少说，把孙仲君和一干恶徒都交出来让我杀了，不然你们都难逃一死，至于华山拳派，我也要找穆人清要个说法。", 0, 0)
	say("归二爷，人家都要杀上华山拳派了？亏你还忍得住气，还不上去把这小子抓了。", 1119, 1, "归二娘")

	if WarMain(320, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say(JY.Person[0].称呼 .. "，等等，还请手下留情，这事我相信师父会公正处理的。", 54, 0)
	say("哼。", 1006, 1, "归辛树")
	say("伙同外人，就会对自己人下手，你还算不算华山拳派的？", 1119, 0, "归二娘")
	say("别说了，咱们走。", 1006, 1, "归辛树")
	dark()
	null(-2, 41)
	null(-2, 42)
	null(-2, 43)
	light()
	say("多谢" .. JY.Person[0].称呼 .. "，等我处理完这事，再专程向你致谢。", 54, 0)
	dark()
	null(-2, 13)
	light()
	addevent(80, 2, 0, 1711, 3, -2)
	addevent(80, 1, 1, -2, 1, 9352)
	addevent(80, 0, 1, -2, 1, 6818)
end
OEVENTLUA[1711] = function ()
	Cls()
	dark()
	null(-2, 2)
	light()
	say("" .. JY.Person[0].称呼 .. "，你来了。", 54, 0)
	say("袁兄，这位是？", 0, 1)
	say("哦，这是阿九姑娘，是青竹帮帮主程青竹的徒弟。", 54, 0)
	say("这位" .. JY.Person[0].称呼 .. "，你好。", 356, 0, "阿九")
	say("啊，好，你也好。（袁兄这是从哪骗了一个如此美丽的美女来？）", 0, 1)

	if instruct_16(600) then
		say("美女姐姐，我们又见面了。", 225, 0, "韦小宝")
		say("呵呵，小家伙，还是这么机灵的样子。", 356, 0, "阿九")
	end

	if instruct_16(86) then
		say("师父。", 86, 0, "阿珂")
		say("阿珂，你跑到哪儿去了？", 356, 0, "阿九")
		say("我~", 86, 0, "阿珂")
		say("就知道贪玩，回去好好练功知道吗？", 356, 0, "阿九")
		say("是，师父。", 86, 0, "阿珂")
		instruct_21(86)
		null(70, 107)
	end

	say("袁兄，你和你师父解释过了吗？", 0, 1)
	say("嗯，师父说我门中人，当以侠义为先，何况国家危难，自当仗义锄奸。", 54, 0)
	say("你师父倒是个义士，我说能教出袁兄这样的英雄，也不应当差了。", 0, 1)
	say(JY.Person[0].称呼 .. "，你过奖了。只是一直没有等到二师兄，也不知道他们是不是路上耽误了。", 54, 0)
	dark()
	addevent(80, 3, 1, -2, 1, 9110)
	light()
	say("师兄，你在吗？师弟来见你来了！", 184, 0)
	meet_self(184)
	say("袁兄，这位是你华山拳派的师伯？", 0, 1)
	say("不是。", 54, 0)
	say("在下华山拳派袁承志，敢问道长是？", 54, 0)
	say("华山拳派的？穆人清那个老猿在不在，叫他出来见我。", 184, 1)
	say("阁下来到我华山拳派，居然敢对我华山掌门无礼，少不得要吃点教训。", 54, 0)
	say("后生好生无礼！", 184, 1)
	say("袁兄，让我来先试试他的身手。", 0, 0)

	if WarMain(161, 0) == false then
		instruct_15()
		Cls()

		return
	end

	instruct_2(156, 1)
	dark()
	null(-2, 3)
	light()
	say("（怎么会？这个道士身上居然有本天书，真是误打误着啊。）", 0, 1)
	say("这道士不知道是什么人？", 54, 0)
	say("无论是什么人，骂你师父，总是你华山拳派的对头，回头问问你师父就知道了。", 0, 1)
	say("二师兄怎么还不来？", 54, 0)
	say("不知袁兄下来有何打算？", 0, 1)
	say("不敢相瞒" .. JY.Person[0].称呼 .. "，家父袁崇焕。", 54, 0)
	say("原来是袁督师之子，难怪如此少年英雄。", 0, 1)
	say(JY.Person[0].称呼 .. "过奖了，我在中原已经组织了父亲旧部，誓要驱除鞑虏，复我中华！", 54, 0)
	say("袁兄果是人杰。", 0, 1)

	if JY.Person[0].实战 >= 300 then
		say("（袁兄弟武功高强，乃是一个好帮手，好臂助，我且试试）", 0, 1)
		say("袁兄如是一心要驱除鞑虏的话，我们倒是可以合作。", 0, 1)
		say("此话怎说？", 54, 0)
		say("我早有心驱除鞑虏，恢复汉室江山，如今我游历江湖，袁兄若是信得过在下，不妨咱们同行，正要广交江湖豪杰，重振华夏威风。", 0, 1)
		say("咳咳，不瞒" .. JY.Person[0].称呼 .. "，我如今召集父亲旧部，组建了金蛇营，实在是不能随你行走江湖，还请见谅。", 54, 0)
		say("袁兄果是性情中人，如此也好，相信我们还会再见的。", 0, 1)
		addevent(116, 8, 0, 1717, 3, -2, -2, -2)
		say("承志哥哥，我很快要和师父回昆仑了，你一定要来看我。", 356, 1, "阿九")
		say("阿九，我一定会去看你。", 54, 0)
		say("那我找我师父去了。承志哥哥，我会一直等着你的。", 356, 1, "阿九")
		say(JY.Person[0].称呼 .. "，你数次相助，袁某无以为报，这本秘籍想必对你还有些用处，还请收下。", 54, 0)
		say("袁兄客气了。", 0, 1)
		addthing(68)
		dark()
		null(-2, 0)
		null(-2, 1)
		light()
	else
		say(JY.Person[0].称呼 .. "，你数次相助，袁某无以为报，这是我无意中得到的宝物，还请收下。", 54, 0)
		say("袁兄客气了。", 0, 1)
		addthing(14)
		say("" .. JY.Person[0].称呼 .. "，我还有要事，咱们就此别过。", 54, 0)
		say("唔，袁兄慢走。", 0, 1)
		dark()
		null(-2, 0)
		null(-2, 1)
		light()
	end

	null(69, 39)
	null(135, 4)
	null(135, 7)
	null(135, 8)
	null(135, 9)
	null(135, 10)
	null(135, 11)
	null(135, 12)
	instruct_17(-2, 1, 48, 23, 0)
	addevent(135, 20, 0, 13513, 3, -2, -2, -2)
	addevent(135, 14, 1, 13515, 1, 7150, -2, -2)
	addevent(135, 15, 1, 13516, 1, 10462, -2, -2)
	addevent(135, 5, 1, 13517, 1, 10384, -2, -2)
	addevent(135, 6, 1, 13518, 1, 10316, -2, -2)
	addevent(135, 16, 1, -2, 1, 10426, -2, -2)
	addevent(135, 17, 1, -2, 1, 10386, -2, -2)
	addevent(135, 18, 1, -2, 1, 8878, -2, -2)
	addevent(135, 19, 1, 13514, 1, 9254, -2, -2)
end
OEVENTLUA[1712] = function ()
	Cls()

	if instruct_16(91) then
		say("咦，这儿好像有个地窖。", 91, 0)
		say("" .. JY.Person[0].称呼 .. "，咱们下去看看。", 91, 0)
		say("地窖有什么好看的。", 0, 1)
		say("一个地窖口还这么秘密，那就一定有秘密。", 91, 0)
		dark()
		My_Enter_SubScene(83, 46, 44, 0)
		light()
	end
end
OEVENTLUA[1713] = function ()
	Cls()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	instruct_2(174, 2000)
end
OEVENTLUA[1714] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	instruct_2(174, 3000)
	say("发了发了。", 0, 1)
	Cls()
end
OEVENTLUA[1715] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	instruct_2(174, 2000)
	Cls()
end
OEVENTLUA[1716] = function ()
	instruct_3(-2, -2, -2, 0, 0, 0, 0, 3500, 3500, 3500, -2, -2, -2)
	Cls()
	instruct_2(174, 3000)
	say("哎呀，发了发了。", 0, 1)
	Cls()
end
OEVENTLUA[1717] = function ()
	Cls()

	if has_thing(320) or has_thing(321) then
		say("嗯？什么人？给我出来！", 0, 1)
		dark()
		addevent(116, 10, 1, -2, 1, 6818)
		light()
		say("咳咳，" .. JY.Person[0].称呼 .. "，我们又见面了。", 54, 0)
		say("袁兄？你怎么在这儿？", 0, 1)
		instruct_30(40, 39, 40, 43)
		instruct_40(2)
		say("哎，说来惭愧，我和兄弟们遇到官兵围剿，大伙儿都被打散了，我逃到此处疗伤，也不知道他们如何了？", 54, 0)
		say("这帮可恶的官兵，对付外敌就没见他们有多厉害，对付自己人都跟打了鸡血似的，袁兄，不知下来你有何打算？", 0, 1)
		say("我？不知" .. JY.Person[0].称呼 .. "有何教我？", 54, 0)
		say("袁兄，即是如此，不如你与我同行吧，不瞒袁兄，我是从小村出来的。", 0, 1)
		say("小村？难道...", 54, 0)
		say("江湖传说的那个小村？", 54, 0)
		say("正是，南贤、北丑乃是我的管家。", 0, 1)
		say("好，若你真是小村的，我相信你，想不到，想不到，小村又有人入世了，我汉族大兴有望了。", 54, 0)
		say("袁兄这是相信我了。", 0, 1)
		say("正是，我这就和" .. JY.Person[0].称呼 .. "走，等我再着人通知父亲的旧部，让他们到小村与我汇合。", 54, 0)
		say("如此甚好。", 0, 1)
		addthing(14)
		addthing(344, 5)
		addthing(346, 5)

		if instruct_20() == false then
			instruct_10(54)
			instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 54, 0)
		Cls()
		instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 51, 1, 0, 1781, 0, 0, 6818, 6818, 6818, -2, -2, -2)
	end
end
OEVENTLUA[1718] = function ()
	Cls()
	say("掌柜的，不是我不给你，实在是我的盘缠昨晚丢失了，我下次过来时给你可好。", 356, 0, "阿九")
	say("客人，这住一宿就得交一晚的银子，从来没有拖欠的道理。", 1040, 1, "掌柜")
	say("这个，掌柜的，我下次来给你双倍可好，放心，我一定会过来的。", 356, 0, "阿九")
	say("这个，客人，不是老朽不愿意帮你，实在是不行的。", 1040, 1, "掌柜")

	if instruct_16(600) then
		say("美女，我来帮你。", 225, 0, "韦小宝")
		say("掌柜的，这是10两银子，可是够啊？", 225, 0, "韦小宝")
		say("啊，够了，够了。", 1040, 1, "掌柜")

		if instruct_16(86) then
			say("师父。", 86, 0, "阿珂")
			say("阿珂，你跑到哪儿去了？", 356, 1, "阿九")
			say("我~", 86, 0, "阿珂")
			say("就知道贪玩，回去好好练功知道吗？", 356, 1, "阿九")
			say("是，师父。", 86, 0, "阿珂")
			instruct_21(86)
		end

		if instruct_16(86) then
			say("袁公子，你来了？", 356, 0, "阿九")
			say("阿九。", 54, 1)
			say("袁公子，我想回北京看看，你能...", 356, 0, "阿九")
			say("阿九，我赔你一起去。", 54, 1)
			say("好。", 356, 0, "阿九")
			say("" .. JY.Person[0].称呼 .. "。", 54, 1)
			say("那我就祝愿公子与这位阿九姑娘一路顺风了。", 0, 0)
			say("" .. JY.Person[0].称呼 .. "，我晚些回小村寻你。", 54, 1)
			say("好。", 0, 0)
			dark()
			null(-2, 39)
			light()

			return
		end

		say("你这个孩子倒是善良，为什么要帮我啊？", 356, 0, "阿九")
		say("我也不知道为什么，一看你就觉得亲切。别说10两银子，就是1000两银子也不算什么。", 225, 1, "韦小宝")
		say("你倒是会说话，不过我现在可是没有什么可以给你的。", 356, 0, "阿九")
		say("你我也是有缘，我就教你一门轻身的功夫，可好？。", 356, 0, "阿九")
		say("好啊，好啊，我不喜欢和人打架，打不过就跑，那是最妥当了。", 225, 1, "韦小宝")
		say("你这个小家伙，那就教你一门逃跑的轻功，你记好了。", 356, 0, "阿九")
		dark()
		light()
		stop_ng(600)
		instruct_35(600, 1, 131, 50)
		say("好了，小家伙，我走了。", 356, 0, "阿九")
		dark()
		null(-2, 39)
		light()
		say("美女姐姐，什么时候能再见到你啊。", 225, 1, "韦小宝")
	else
		say("掌柜的，这位姑娘的房钱我给了。这是10两银子，可是够啊？", 0, 0)
		say("啊，够了，够了。", 1040, 1, "掌柜")
		say("多谢这位" .. JY.Person[0].称呼 .. "。", 356, 0, "阿九")
		say("这个给你。", 356, 0, "阿九")
		dark()
		null(-2, 39)
		addthing(30, 1)
		light()
		say("咦，金子做的暗器，这位姑娘好大方。", 0, 1)
	end
end
OEVENTLUA[1719] = function ()
	Cls()

	if instruct_16(91) then
		dark()
		null(-2, 12)
		light()
		say("你们是什么人，到五毒教来干什么？", 451, 0)
		say("我叫温青青，我听说云南有个五毒教，还有个白草门，人人都是使毒的高手，也不知道是不是真的？", 91, 1)
		say("温青青？你妈是不是叫温仪？", 451, 0)
		say("你怎么知道？你认识我妈妈？", 91, 1)
		say("你爹是不是金蛇郎君夏雪宜？", 451, 0)
		say("老婆婆，你认识我爹爹？", 91, 1)
		say("认识，何止认识，我和你爹爹是好朋友。小姑娘，来，咱们屋里谈。", 451, 0)
		dark()
		null(-2, 0)
		null(-2, 19)
		null(-2, 18)
		addevent(-2, 13, 1, -2, 1, 8426)
		addevent(-2, 14, 1, -2, 1, 5290)
		My_Enter_SubScene(96, 23, 6, 2)
		light()
		say("来，这是我五毒教的五仙花蜜酿，喝了对身体很有好处。", 451, 0)
		say("很香啊，老婆婆，你怎么认识爹爹的？", 91, 1)
		say("哼，老婆婆，想当年我认识你爹爹的时候才16岁，转眼就成老婆婆了。", 451, 0)
		say("啊？", 91, 1)
		say("来，都喝点，我五毒教的五仙花蜜酿，平常人就是想喝也是喝不到的。", 451, 0)
		say("哎，当年啊。", 451, 0)
		say("当年你爹爹骗我进五毒窟盗取教内秘宝，可怜我当年以为他是个武艺高强的英俊侠士，死心塌地的爱上了他。", 451, 0)
		say("我偷来了秘宝给他，不想他得到秘宝就抛下我独自离去了。", 451, 0)
		say("10年来，留下我独自在洞内承受万蛇蚀身的惩罚。", 451, 0)
		say("啊？不会的，不会的，我爹不会做这样事的。", 91, 1)
		say("哼，你以为你爹爹的金蛇剑又是从哪来的？又怎么叫金蛇郎君？", 451, 0)
		say("不会的，不会的，哎呦，我肚子疼，老婆婆，你干什么了？", 91, 1)
		say("你自己进门也说，五毒教，人人都是使毒的高手，你说我干什么了？", 451, 0)
		say("你？卑鄙。" .. JY.Person[0].称呼 .. "，你还能动吗？", 91, 1)
		say("这点毒药还毒不死我。", 0, 1)
		say("唔，还有个高手啊。", 451, 0)

		for iter_19_0 = 0, CC.HeadNum do
			if inteam(iter_19_0) then
				JY.Person[iter_19_0].内力 = JY.Person[iter_19_0].内力 - 1500
				JY.Person[iter_19_0].中毒程度 = 60
				JY.Person[iter_19_0].体力 = 12
			end
		end

		if WarMain(163, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		dark()
		addevent(-2, 15, 1, -2, 1, 7042)
		light()
		say("教主到！", 201, 1, "五毒弟子")

		if JY.Person[0].性别 == 0 then
			say("咦，小帅哥功夫不错啊，我们来单挑怎么样？", 83, 0)
		else
			say("咦，小美女功夫不错啊，我们来单挑怎么样？", 83, 0)
		end

		say("只见这女子长得千娇百媚，艳若桃李，居然就是五毒教的教主", 0, 2)
		say("单挑就单挑，还怕你不成！", 0, 1)
		Cls()

		if WarMain(164, 0, 1, 1) == false then
			instruct_15()
			Cls()

			return
		end

		say("你，你，竟然功夫这么好！", 83, 0)
		say("师父！", 83, 0)
		say("＜这一声叫的又柔又媚，只一下，你觉得浑身汗毛都立了起来＞什么师父？", 0, 1)
		say("师父，你收下我吧，我做你的乖徒儿！", 83, 0)
		say("刚才你这儿的老婆子还下毒要害我。", 0, 1)
		say("唔，你是说何长老啊，来人！将何长老带下去，关到五毒窟思过，什么时候反省了什么时候出来。", 83, 0)
		say("是！", 201, 1, "五毒弟子")
		addevent(-2, 14, 1, -2, 1, 5288)
		say("什么？何铁手你这个杀千刀的，我可是教中长老，我是你姑姑。", 451, 0)
		say("长老，请了！", 201, 1, "五毒弟子")
		dark()
		null(-2, 14)
		light()
		say("刚才她说什么五毒窟，那是什么？", 91, 0)
		say("唔，五毒窟乃是我教中密地，其中饲养了各种奇异毒物，十分凶险！", 83, 1)
		say("那就算了，咱们不去了。", 91, 0)
		say("师父在上，受徒儿一拜。", 83, 1)
		say("哼，收一个这么漂亮的徒弟，你可不能师生恋啊，记住了没有。", 91, 0)
		say("青青，你又在胡说，咱们走吧。", 0, 1)
		say("师父，我和你一块儿走。", 83, 0)
		dark()
		null(-2, 13)
		light()

		if instruct_20() == false then
			instruct_10(83)
			instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 83, 1)
		Cls()
		instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 103, 1, 0, 181, 0, 0, 7042, 7042, 7042, -2, -2, -2)
		Cls()
	else
		dark()
		light()
		say("你们是什么人，到五毒教来干什么？", 451, 0)
		say("啊，我们随便转转。", 0, 1)
		say("五毒教不欢迎外人，尤其是汉人，赶快离开！", 451, 0)
		say("哼，走就走，真不礼貌。", 0, 1)
		My_Enter_SubScene(96, 40, 14, 1)
	end
end
OEVENTLUA[1720] = function ()
	Cls()

	if instruct_60(70, 107, 9300) then
		dark()
		null(-2, 108)
		light()
		say("不好了，不好了。", 514, 0, "护卫")
		say("不好了，家里出事了，阿财你快回去看看。", 514, 0, "护卫")
		say("嗯？出什么事了？", 0, 1)
		say("~，你赶快回去看看吧。", 514, 0, "护卫")
		dark()
		null(-2, 107)
		null(-2, 64)
		addevent(-2, 107, 1, -2, 1, 8314)
		addevent(-2, 110, 1, -2, 1, 5270)
		instruct_3(70, 109, 1, 0, 1785, 0, 0, 8420, 8420, 8420, -2, -2, -2)
		My_Enter_SubScene(70, 8, 33, 2)
		light()
		say("啊？阿珂，你怎么了？", 0, 1)
		say("这是怎么回事？", 0, 1)
		say("她是中毒了，刚才护卫经过这里，发现她倒在地上，发现时已经晚了。", 514, 0, "护卫")
		say("怎么会这样？怎么会这样？", 0, 1)
		say("我已经下令清查最近小村出入人口，看看有什么可疑人物。可怜的阿珂，还这么年轻就。", 514, 0, "护卫")
		say("啊啊啊！阿珂，无论是谁，我都会查到，给你报仇。", 0, 1)
		say("哎，你带回小村的人良莠不齐，心狠手辣之人也不在少数，如果是这里面有人下毒，只怕很难查出来了。", 514, 0, "护卫")
		say("可是为什么？我不明白。", 0, 1)
		say("我也不明白，不过人心就是这样，可能是看见阿珂年轻漂亮就下手也是有的。总之我可以给你清查外来人口，至于你带回来的人你需要自己提高警惕。", 514, 0, "护卫")
		say("~，我知道了。阿珂，是我害了你。", 0, 1)
		say("哎，美丽是一种毒，连自己不注意也会被害死。从今天开始，我们加强警戒，每天的吃食也要用银针检查。", 514, 0, "护卫")
		dark()
		null(-2, 107)
		null(-2, 110)
		My_Enter_SubScene(70, 8, 28, 1)
		light()
		addtime(10)
		say("你突然感受到了人生的无常，什么武功无敌也不管用...", 0, 2)
		say("不过幸好还有青青一直陪着你...", 0, 2)
	end
end
OEVENTLUA[1723] = function ()
	Cls()

	if inteam(91) and has_thing(156) then
		dark()
		null(-2, 108)
		light()
		say("我想我妈妈了，咱们去看看她好不好？", 91, 0)
		say("好啊，扬州离咱们又不远，咱们去转转也好。", 0, 1)
		say("不是在扬州了，你忘了，我赢了一座大房子的？", 91, 0)
		say("妈妈在家里老受欺负，我劝妈妈搬到那里去了。", 91, 0)
		say("唔，好。", 0, 1)
		addevent(95, 12, 1, 1724, 1, 8948, -2)
		addevent(95, 13, 1, 1725, 1, 8738, -2, -2)
	end
end
OEVENTLUA[1724] = function ()
	Cls()

	if inteam(91) then
		say("青青，你来了？", 521, 0, "温仪")
		say("娘，我来看你了。", 91, 1)
		say("还是我家青青懂事，在外面没有吃苦吧。", 521, 0, "温仪")
		say("没有，娘，我挺好的。", 91, 1)
		say("那就好，那就好。", 521, 0, "温仪")
		addtime(2)
	else
		say("青青怎么样了？", 521, 0, "温仪")
		say("青青从小就孤苦伶仃的，好不容易遇到了你。你要对她好一点啊", 521, 0, "温仪")
	end
end
OEVENTLUA[1725] = function ()
	Cls()

	if inteam(91) then
		say("青青小姐好。", 261, 0, "丫鬟")
		addtime(2)
	else
		say("青青小姐怎么没和你在一起啊？", 261, 0, "丫鬟")
	end
end
OEVENTLUA[1750] = function ()
	Cls()
	dark()
	null(-2, 16)
	light()
	say("早说了你们跑不掉的。", 1273, 0, "匪徒")
	say("你们行行好，放过我们一家人吧。", 2362, 1, "老人")
	say("七少要的人，还没有放过的道理。", 1271, 0, "匪徒")
	say("爹爹，不要求他们，了不得一死。", 1242, 1, "苏虹儿")
	say("死？哪有那么容易？给我上！", 1273, 0, "匪徒")
	say("慢！荒郊野外，居然敢行凶？", 0, 1)
	instruct_30(36, 23, 36, 20)

	if WarMain(542, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	dark()
	null(-2, 19)
	light()
	say("你敢管七少的事，你死定了。", 1271, 0, "匪徒")
	say("去死~", 1242, 1, "苏虹儿")
	say("只见少女突然向前，一剑刺在歹徒后心，身法居然和你刚才的动作有些相像", 0, 2)
	say("你...", 1271, 0, "匪徒")
	dark()
	null(-2, 20)
	light()
	say("你这是，练过武功？", 0, 1)
	say("没有啊，我看你刚才的招式很厉害，刚才就学着你做的。", 1242, 0, "苏虹儿")
	say("唔，悟性不错的小姑娘。", 0, 1)
	say("多谢少侠相救。", 2362, 0, "老人")
	say("多谢少侠，还好这次又躲过去了。", 1237, 0, "老妇")
	say("爹，娘，你们就是太软弱，咱们才会走到这一步。", 1242, 0, "苏虹儿")
	say("虹儿，这", 2362, 0, "老人")
	say("虹儿，别怪你爹，这些人咱们惹不起的。", 1237, 0, "老妇")
	say("少侠，我看你武功不错，不如我拜你为师，跟你学习武艺如何？", 1242, 0, "苏虹儿")
	say("啊？", 0, 1)
	say("师父在上，请受虹儿一拜。", 1242, 0, "苏虹儿")
	say("哎，等等，我还没有考虑过这种事情的。", 0, 1)
	say("师父，我们一家人已经无处可去，无路可走了，还请师父收留。", 1242, 0, "苏虹儿")
	say("我", 0, 1)
	say("师父在上，请受虹儿一拜。", 1242, 0, "苏虹儿")
	say("......（这小姑娘悟性十分之高，收为徒弟倒也是不错）", 0, 1)
	say("罢了，我就收你为徒，你们都随我回小村去吧。", 0, 1)
	say("耶，好耶，就知道师父你最好了。", 1242, 0, "苏虹儿")
	say("有劳少侠了，小女十分调皮，以后还请你多多管教。", 2362, 0, "老人")
	say("伯父不用客气，我们走吧。", 0, 1)
	dark()
	null(-2, 17)
	null(-2, 18)
	null(-2, 21)
	addevent(70, 65, 1, 1751, 1, 9188, -2, -2)
	light()
end
OEVENTLUA[1751] = function ()
	Cls()
	say("师父，你赶快教我武功呗。", 1242, 0, "苏虹儿")
	say("好好好，我看你身形灵活，就教你剑法吧。", 0, 1)
	say("好耶。", 1242, 0, "苏虹儿")
	dark()
	light()
	say("不错，你好好练习。", 0, 1)
	say("是，师父。", 1242, 0, "苏虹儿")
	addevent(70, 65, 1, 1752, 1, 9188, -2, -2)
end
OEVENTLUA[1752] = function ()
	Cls()
	say("师父，我要练多久才能和你一样厉害？", 1242, 0, "苏虹儿")
	say("快了，快了，好好练吧。", 0, 1)
end
OEVENTLUA[1801] = function ()
	Cls()
	dark()
	null(-2, 3)
	light()
	say("空心菜，你这招剑法使得却是不对。", 1070, 0, "戚芳")
	say("师父说这招躺尸剑法，要沉腰缩肩，自右下刺向敌人右胸，哪里不对了？", 37, 1, "狄云")
	say("你这样使法好生难看，像只大马猴在使剑，又哪里对了？", 1070, 0, "戚芳")
	meet_self(37)
	dark()
	addevent(119, 6, 1, -2, 1, 7152, -2, -2)
	addevent(119, 7, 1, -2, 1, 8708, -2, -2)
	light()
	say("戚芳妹子，又在这里陪你师兄练剑呢？", 1086, 0, "万圭")
	say("哼，要你管？我就愿意陪师兄，你管的着吗？", 1070, 1, "戚芳")
	say("是，是，我是管不着，妹子你别生气。", 1086, 0, "万圭")
	say("父亲交代我要招待好你们，这不，今日就有个诗会，不知你们可愿意一块去瞧瞧？", 1086, 0, "万圭")
	say("什么诗会？那有什么意思？不如在家练武为好。", 37, 1, "狄云")
	say("诶诶，老在家待着如何能行，狄云兄弟你莫不是不会诗词？", 1086, 0, "万圭")
	say("谁说我师兄不会的？不就是个诗会吗？", 1070, 1, "戚芳")
	say("好，妹子，既如此，那咱们同去吧？", 1086, 0, "万圭")
	say("我不去，我也不会什么诗词。", 37, 1, "狄云")
	say("真是个乡下土包子。", 1086, 0, "万圭")
	say("你说什么？", 1070, 1, "戚芳")
	say("哦，没什么。戚芳妹子，既然狄兄弟不去，那咱们去吧。", 1086, 0, "万圭")
	say("师兄不去我也不去，你自己去就好。", 1070, 1, "戚芳")
	say("哎，妹子，你陪着狄兄弟有什么好玩的，又无趣又沉闷，不如......", 1086, 0, "万圭")
	say("说了我不去了。师兄，咱们再练一遍剑法。", 1070, 1, "戚芳")
	say("好。", 37, 4, "狄云")
	say("哎，卿本佳人，奈何......", 1086, 0, "万圭")
	dark()
	null(-2, 6)
	null(-2, 7)
	light()

	JY.Person[37].好感度 = 51

	addevent(119, 4, 1, 1802, 1, 8548, -2, -2)
	addevent(119, 5, 1, 1802, 1, 8950, -2, -2)
	addevent(119, 11, 0, 1803, 3, -2, -2, -2)
	addevent(119, 8, 1, -2, 1, 5752, -2, -2)
	addevent(119, 9, 1, -2, 1, 9408, -2, -2)
	addevent(119, 10, 1, -2, 1, 7154, -2, -2)

	JY.Person[52].佛学修为 = 1
	JY.Person[97].佛学修为 = 1
	JY.Person[602].佛学修为 = 1
end
OEVENTLUA[1802] = function ()
	Cls()
	say("空心菜，你说爹爹跑哪去了？怎么这么些日子还不回来？", 1070, 0, "戚芳")
	say("是啊，师父怎么还不回来，咱们老住在万伯父家总是不妥。", 37, 1, "狄云")
	say("我问万伯父，他总说爹爹会回来的，让咱们安心待着，不要着急。", 1070, 0, "戚芳")
	say("明天我再去问问，总不能师父扔下咱们自个走了。", 37, 1, "狄云")
end
OEVENTLUA[1803] = function ()
	Cls()
	dark()
	null(-2, 11)
	light()
	say("鲁坤，你说他们如今到了什么地界了？", 1052, 0, "万震山")
	say("师父，这些江湖豪客都追着咱们留的线索往荆州北部的山林追去了。", 1079, 1, "鲁坤")
	say("你去联系枭道人，齐帮主，咱们这次一定要将老戚的秘密逼出来。", 1052, 0, "万震山")
	say("是，师父。", 1079, 1, "鲁坤")
	say("圭儿，你在家要好好监视着老三的两个徒弟，为父要出去几日。", 1052, 0, "万震山")
	say("是，父亲。", 1086, 1, "万圭")
	say("嗯？什么人？", 1052, 0, "万震山")
	say("不好，被发现了。", 0, 1)
	dark()
	My_Enter_SubScene(119, 40, 20, 2)
	light()
	say("还好我闪得快。", 0, 1)
	say("这帮人到底在搞什么？荆州北部的山林？我要不要去看看？", 0, 1)
	null(-2, 8)
	null(-2, 9)
	null(-2, 10)
	addevent(41, 34, 0, 1804, 3, -2, -2, -2)
	addevent(41, 6, 1, 1804, 1, 5752, -2, -2)
	addevent(41, 2, 1, 1804, 1, 8490, -2, -2)
	addevent(41, 5, 1, 1804, 1, 9000, -2, -2)
	addevent(41, 4, 1, 1804, 1, 6270, -2, -2)
end
OEVENTLUA[1804] = function ()
	Cls()
	dark()
	null(-2, 34)
	light()
	say("二师弟，你到了荆州怎么也不和哥哥说一声？这么偷偷摸摸的多不合适啊。", 1052, 0, "万震山")
	say("大师兄，小弟正是要来荆州投奔大师兄啊，如今小弟我混的那个艰难啊。", 1025, 1, "言达平")
	say("二师弟，我的府邸很好找的，怎么你找我找到了这深山密林来的啊？", 1052, 0, "万震山")
	say("呵呵呵，啊~，大师兄小心~", 1025, 1, "言达平")
	say("哼！早知道你会声东击西。", 1052, 0, "万震山")
	dark()
	null(-2, 4)
	addevent(41, 7, 1, -2, 1, 6270, -2, -2)
	addevent(41, 6, 1, -2, 1, 6052, -2, -2)
	light()
	say("你怎么来了，我挡着他们，你快走！", 1025, 0, "言达平")
	say("啊？什么情况？", 0, 1)
	say("是你？上次就是你偷听我们谈话的。抓住他！", 1052, 0, "万震山")

	if WarMain(327, 0, 1, 1) == false then
		instruct_15()
		Cls()

		return
	end

	say("还是个高手，大家都上！先拿下此人！", 1052, 0, "万震山")

	if WarMain(332, 0) == false then
		instruct_15()
		Cls()

		return
	end

	dark()
	null(-2, 2)
	null(-2, 5)
	My_Enter_SubScene(41, 33, 19, 1)
	light()
	say("大侠饶命，大侠，我错了！", 1052, 0, "万震山")
	say("哦？现在不想杀我了？", 0, 1)
	say("不想了，不想了。", 1052, 0, "万震山")
	say("说说吧，你们到底在搞什么鬼？", 0, 1)
	say("大侠，我说，我这是设了个局，要引我三师弟来的。", 1052, 0, "万震山")
	say("哦？", 0, 1)
	say("我三师弟有唐诗宝藏的大秘密。", 1052, 0, "万震山")
	say("哦，所以你设个套引你师弟来，要得到这个宝藏的大秘密？", 0, 1)
	say("正是。", 1052, 0, "万震山")
	say("那你们刚才是？", 0, 1)
	say("我们本来是准备埋伏三师弟的，不想我这二师弟却跑了进来，不过也难说他们是不是一伙的，或者是他先来打探情况也不一定。", 1052, 0, "万震山")
	say("胡说八道~，你这个小人。", 1025, 1, "言达平")
	say("大侠，你先放了我，我必有厚报。", 1052, 0, "万震山")
	say("不要相信他~，他就是个小人，而且与官府甚有交情，你今日若放了他，只怕永无宁日。", 1025, 1, "言达平")
	say("师弟，你怎可如此说话，我毕竟是你大师兄。", 1052, 0, "万震山")
	say("哼~，大师兄？当年若不是你，师父如何能死。", 1025, 1, "言达平")
	say("师弟，当年难道你就没有背后捅师父一刀？若不是你那一刀，依师父的武功，又怎么可能被三师弟趁隙刺了一剑？", 1052, 0, "万震山")
	say("都是麻烦，一刀解决干净！", 0, 1)
	say("啊~", 1052, 0, "万震山")
	null(-2, 6)
	say("别~，别杀我，我也是上当的~", 1025, 0, "言达平")
	say("你有宝藏的线索吗？", 0, 1)
	say("我没有，不过只要找到我师弟......", 1025, 0, "言达平")
	say("......", 0, 1)
	say("我最恨别人利用我，你说你刚才是不是在利用我？", 0, 1)
	say("我~", 1025, 0, "言达平")
	say("啊~", 1025, 0, "言达平")
	null(-2, 7)
	null(119, 4)
	null(119, 5)
	addevent(119, 11, 0, 1805, 3, -2, -2, -2)
	addevent(119, 28, 1, -2, 1, 8950, -2, -2)
	addevent(119, 10, 1, -2, 1, 7154, -2, -2)
end
OEVENTLUA[1805] = function ()
	Cls()
	dark()
	light()
	say("娘子，府里事你不要太操劳了，看你现在瘦的。", 1086, 0, "万圭")
	say("瘦点有什么不好？你非要白白胖胖的，又不是养猪。", 1070, 1, "戚芳")
	say("都好，都好，府里事多安排婢女做，你对她们太宽厚了。", 1086, 0, "万圭")
	say("......", 0, 1)
	say("什么情况？是这个世界变化快还是我落后了，那个傻小子呢？", 0, 1)
	say("什么人？", 1086, 0, "万圭")
	dark()
	My_Enter_SubScene(119, 40, 20, 1)
	light()
	say("哎哎，不小心又偷听别人谈话了。", 0, 1)
	addevent(119, 27, 1, 1806, 1, 9394, -2, -2)
end
OEVENTLUA[1806] = function ()
	Cls()
	null(-2, 11)
	null(-2, 10)
	null(-2, 28)
	say("少侠，能帮我一个忙吗？", 1114, 0, "凌霜华")
	say("姑娘这是？", 0, 1)
	say("我看少侠气质不凡，武功高强，想请少侠救一个人。", 1114, 0, "凌霜华")
	say("谁？", 0, 1)
	say("中州剑客丁典丁大侠。", 1114, 0, "凌霜华")
	say("......", 0, 1)

	if yesno("要帮忙吗？") then
		say("多谢少侠，丁大侠被关在荆州官府地牢内。", 1114, 0, "凌霜华")
		say("在官府监牢？你你不会要我去劫狱吧？", 0, 1)
		say("只要少侠你去探望进去即可，这是牢房钥匙。", 1114, 0, "凌霜华")
		addthing(208, 1)
		say("......", 0, 1)
		say("少侠千万小心，还有荆州知州凌退思与我有些关系，还望少侠不要伤害此人，只要救出人即可。", 1114, 0, "凌霜华")
		say("还没问姑娘怎么称呼？", 0, 1)
		say("我姓凌。", 1114, 0, "凌霜华")
		dark()
		null(-2, 27)
		light()
		addevent(119, 31, 1, 1808, 1, -2, -2, -2)
		addevent(119, 32, 1, 1808, 1, -2, -2, -2)
		addevent(119, 29, 1, 1809, 1, 6764, -2, -2)
		addevent(119, 30, 1, 1809, 1, -2, -2, -2)
	else
		say("抱歉，我很忙，没空做这些事。", 0, 1)
		say("......", 1114, 0, "凌霜华")
		say("哎，丁大哥，丁大哥，我该怎么办？", 1114, 0, "凌霜华")
		dark()
		null(-2, 27)
		light()
		addevent(119, 90, 0, 1810, 3, -2, -2, -2)
	end
end
OEVENTLUA[1807] = function ()
	Cls()

	if has_thing(208) then
		say("官府重地，赶快离开。", 1255, 0, "官军")
		say("这位大哥，我要探望一下狱中的兄弟，这是给大哥的一点酒钱。", 0, 1)
		instruct_2(174, -10)
		say("你是探望狄云那小子来了？", 1255, 0, "官兵")
		say("（狄云，那傻小子怎么被关进来了）", 0, 1)
		say("大哥，我是来探望丁典的。", 0, 1)
		say("丁典？怎么可能？10年来你是唯一来探望他的人。嗯，大小姐除外。", 1255, 0, "官兵")
		say("这钱你拿回去吧，你要探望丁典我可不敢让你进去。", 1255, 0, "官兵")
		say("大哥，帮帮忙，我很远的地方赶来的。", 0, 1)
		say("丁典啊，这出了差池可是要掉脑袋的，赶快离开。", 1255, 0, "官兵")

		if instruct_31(1000) == false then
			say("大哥，这是我所有的财产了，你看可够让我看他一眼。", 0, 1)

			JY.GOLD = 0

			say("你想害我送命吗？赶快离开。", 1255, 0, "官兵")
		else
			say("大哥，你看，不让你为难，就进去看看他如今怎样就可以了。", 0, 1)
			instruct_2(174, -1000)
			say("行了，赶快进去，看完了就赶快离开。", 1255, 0, "官兵")
			null(-2, 21)
			addevent(119, 33, 1, 1807, 1, 10596, -2, -2)
		end
	else
		say("官府重地，办完事还不赶快离开。", 1255, 0, "官兵")
	end
end
OEVENTLUA[1808] = function ()
	Cls()

	if has_thing(208) then
		say("是丁典丁大哥吗？", 0, 1)
		say("你是谁？", 1102, 0, "丁典")
		say("有一位凌姑娘托我来救你出去。", 0, 1)
		say("霜华？", 1102, 0, "丁典")
		say("她怎么突然要救我出去？你究竟是什么人？", 1102, 0, "丁典")
		dark()
		instruct_3(-2, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		light()
		addthing(208, -1)
		say("行了，别婆婆妈妈的，赶快走。", 0, 1)
		say("你们又要玩什么骗局？死心吧，放弃吧。", 1102, 0, "丁典")
		say("我......你有啥子毛病？门打开了，爱走不走。", 0, 1)
		addevent(119, 90, 0, 1810, 3, -2, -2, -2)
	else
		say("你们又要玩什么骗局？死心吧，放弃吧。", 1102, 0, "丁典")
		say("我......你有啥子毛病？门打开了，爱走不走。", 0, 1)
	end
end
OEVENTLUA[1809] = function ()
	Cls()

	if has_thing(208) then
		say("傻小子，你怎么被关进来了。", 0, 1)
		say("我...", 37, 0, "狄云")
		say("说说吧，你不像坏人啊。", 0, 1)
		say("说来话长。", 37, 0, "狄云")
		say("说说吧。", 0, 1)
		say("几年前，我随师父和师妹到荆州去为我万震山万师叔祝寿，但后来却被师叔他们诬赖我勾结盗匪，偷了他万家的金银珠宝，并意图非礼小师娘。而县府大人也没明察秋毫，就把我关了起来。", 37, 0, "狄云")
		say("哦，那你师姐呢，她不相信你？", 0, 1)
		say("师姐...师姐她...", 37, 0, "狄云")
		say("哦，了解了。", 0, 1)
	else
		say("丁大哥不走我也不走。", 37, 0, "狄云")
	end
end
OEVENTLUA[1810] = function ()
	Cls()
	null(-2, 80)
	null(-2, 29)
	null(-2, 30)
	null(-2, 31)
	null(-2, 32)
	null(-2, 33)
	addevent(119, 21, 1, 1807, 1, 10596, -2, -2)
	addevent(119, 35, 1, -2, 1, 4654, -2, -2)
	addevent(119, 36, 1, -2, 1, 4656, -2, -2)
	addevent(119, 39, 1, 1811, 1, 8848, -2, -2)
	addevent(119, 40, 1, 1811, 1, 8536, -2, -2)
end
OEVENTLUA[1811] = function ()
	Cls()
	null(119, 90)
	say("霜华？你醒醒，你醒醒，怎么会这样？怎么会这样？", 1102, 0, "丁典")
	say("丁大哥，你节哀。", 37, 1, "狄云")
	say("不~我不相信。老天，为什么？为什么？", 1102, 0, "丁典")
	say("啊~", 1102, 0, "丁典")
	null(-2, 39)
	addevent(119, 37, 1, -2, 1, 5432, -2, -2)
	say("丁大哥？", 37, 3, "狄云")
	say("这又是发生什么事了？", 0, 1)
	say("是你？快帮我救救丁大哥。", 37, 0, "狄云")
	say("我看看（难道是悲伤过度？）", 0, 1)
	say("不对，脸部发黑，靠近有股腥气，这？这是中了剧毒。", 0, 1)
	say("中毒？怎么会这样，丁大哥？", 37, 0, "狄云")
	say("这棺材上刷有剧毒。", 0, 1)
	say("等等，别靠近，这毒异常厉害，只怕碰到后你也不得幸免。", 0, 1)
	addevent(119, 37, 1, -2, 1, 8848, -2, -2)
	say("霜华，是我害了你，是我害了你。", 1102, 0, "丁典")
	say("哎呀~", 0, 1)
	say("别，别碰棺材~", 0, 1)
	addevent(119, 37, 1, -2, 1, 5432, -2, -2)
	say("......", 0, 1)
	say("又死了？吓我一跳......（这世界上难道真有诈尸这种事？）", 0, 1)
	say("丁大哥。", 37, 0, "狄云")
	say("这，刚才这是怎么回事？", 0, 1)
	say("丁大哥练有一门神功，可以死而复生。", 37, 0, "狄云")
	say("什么？那他还能活吗？", 0, 1)
	say("不能了，丁大哥这次真的去了。", 37, 0, "狄云")
	say("为什么？为什么老有人要害丁大哥？为什么他们老要来害别人？", 37, 0, "狄云")
	say("狄兄弟？", 0, 1)
	say("为什么？为什么他们老要来害别人？", 37, 0, "狄云")
	say("狄兄弟？", 0, 1)
	say("啊？什么？", 37, 0, "狄云")
	say("这门神功你会吗？", 0, 1)
	say("丁大哥不让我教别人的。", 37, 0, "狄云")
	say("......", 0, 1)
	say("狄兄弟，人已经去了，不要太伤心了，咱们把他们埋了吧。", 0, 1)
	say("不，丁大哥和霜华大姐好可怜，我要多陪陪他们，以后我就再也不能陪他们了。", 37, 0, "狄云")
	say("哎。", 0, 1)
	say(JY.Person[0].称呼 .. "，我想单独陪他们一会儿。", 37, 0, "狄云")
	say("好，我回头再来看你。", 0, 1)
	addevent(119, 40, 1, 1812, 1, 8536, -2, -2)
	addevent(119, 24, 1, 1821, 1, -2, -2, -2)
	addevent(119, 25, 1, 1821, 1, -2, -2, -2)
	addevent(119, 45, 1, 1821, 1, -2, -2, -2)
	addevent(119, 46, 1, 1821, 1, -2, -2, -2)
	addevent(119, 49, 1, 1821, 1, -2, -2, -2)
end
OEVENTLUA[1812] = function ()
	Cls()
	say("丁大哥和霜华大姐好可怜，我要多陪陪他们，以后我就再也不能陪他们了。", 37, 0, "狄云")
end
OEVENTLUA[1821] = function ()
	Cls()
	say("听说了吗？青海黑教「血刀门」大举进入中原了。", 338, 0, "酒客1")
	say("哦？他们有这么大的胆子？咱们中原武林高手如云，只怕他们要爬着出去。", 1137, 0, "酒客2")
	say("只怕未必，前几日江南江大侠败在了血刀门的胜谛手下，再前几日仙鹤门的掌门人葛大侠败在了血刀门的宝象手下。", 338, 0, "酒客1")
	say("哦？血刀门竟然有如此多的高手。", 1137, 0, "酒客2")
	say("可不是，落花流水四位大侠已经发了武林召集令，号召大伙儿四处驱逐血刀僧，要将他们赶出中原。", 338, 0, "酒客1")
	say("有落花流水四位大侠一起出手，区区血刀门算得什么？咱们也瞧瞧去？", 1137, 0, "酒客2")
	say("说的是，兄弟，干了此杯，咱们就出发。", 338, 0, "酒客1")
	say("干。", 1137, 0, "酒客2")
	null(119, 35)
	null(119, 36)
	null(119, 37)
	null(119, 40)
	addevent(119, 44, 1, 1824, 1, 7176, -2, -2)
	addevent(119, 38, 1, 1822, 1, 6696, -2, -2)
	addevent(119, 42, 1, 1822, 1, 2770, -2, -2)
	addevent(119, 41, 1, 1823, 1, 6696, -2, -2)
	addevent(119, 43, 1, 1823, 1, 2770, -2, -2)
end
OEVENTLUA[1822] = function ()
	Cls()
	DrawStrBoxWaitKey("丁典丁大哥之墓", C_ORANGE, CC.DefaultFont, 2)
end
OEVENTLUA[1823] = function ()
	Cls()
	DrawStrBoxWaitKey("丁大嫂霜华之墓", C_ORANGE, CC.DefaultFont, 2)
end
OEVENTLUA[1824] = function ()
	Cls()
	null(-2, 24)
	null(-2, 25)
	null(-2, 26)
	null(-2, 45)
	null(-2, 46)
	null(-2, 49)
	null(119, 90)
	say("小孩，你有看见这儿有个绿衣服的大哥哥吗？", 0, 1)
	say("看到了呀。", 369, 0, "小孩")
	say("那他去哪儿了？", 0, 1)
	say("不告诉你。", 369, 0, "小孩")
	say("......", 0, 1)
	say("小弟弟，你要怎样才告诉大哥哥呀？", 0, 1)
	say("你身上又是刀又是剑的？你是不是大侠啊？", 369, 0, "小孩")
	say("当然是啊。", 0, 1)
	say("那好，你教我武功，我就告诉你。", 369, 0, "小孩")
	say("你也要当大侠？", 0, 1)
	say("是啊。", 369, 0, "小孩")
	say("好吧，我教你一些基础武功，记得好生练习，不要偷懒。", 0, 1)
	say("唔，那好吧。", 369, 0, "小孩")
	say("半日之后", 0, 2)
	dark()
	light()
	say("这儿本来有个绿衣服的大哥哥，后来他要造坟，没有钱，后来出来个大和尚，借了他钱造坟，他还不起大和尚的钱，就跟着大和尚走了。", 369, 0, "小孩")
	say("和尚？什么样的和尚？", 0, 1)
	say("穿红衣服的和尚，很红的衣服。", 369, 0, "小孩")
	say("红衣服？", 0, 1)
	say("是啊，和其他和尚不太一样，不过他们说那也是和尚。", 369, 0, "小孩")
	say("红衣服？血刀僧？", 0, 1)
	say("......", 0, 1)
	say("大哥哥，我要走了，要是中午吃饭时间我还没有回家的话，我娘该着急了。", 369, 0, "小孩")
	say("唔，对了，小弟弟，你叫什么名字啊？", 0, 1)
	say("我叫戚继光。", 369, 0, "小孩")
	dark()
	null(-2, 44)
	light()
	addevent(60, 8, 1, 1825, 1, -2, -2, -2)
	addevent(60, 9, 1, 1825, 1, -2, -2, -2)
	addevent(60, 29, 1, 1825, 1, -2, -2, -2)
	addevent(3, 2, 1, 1825, 1, -2, -2, -2)
	addevent(3, 3, 1, 1825, 1, -2, -2, -2)
end
OEVENTLUA[1825] = function ()
	Cls()
	say("好大事件，这次血刀门真是大失脸面了，被中原豪杰追得四处奔逃。", 1079, 0, "酒客1")
	say("区区血刀门？敢大举进入中原，可不就是个笑话吗。", 1081, 1, "酒客2")
	say("也不知道落花流水几位大侠是何等模样？真是一等一的豪杰啊。", 1079, 0, "酒客1")
	say("知道他们追杀血刀门的人到什么地界了吗？", 1081, 1, "酒客2")
	say("据说往东北方向去了，这些血刀门的人，这不是越跑离他们大本营越远了么？", 1079, 0, "酒客1")
	say("正是。", 1081, 1, "酒客2")
	say("来，兄弟，为落花流水几位大侠干一杯。", 1079, 0, "酒客1")
	say("干。", 1081, 1, "酒客2")
	instruct_39(2)
	addevent(2, 16, 1, 1826, 1, -2, -2, -2)
	addevent(2, 2, 1, 1826, 1, -2, -2, -2)
	addevent(2, 3, 1, 1826, 1, -2, -2, -2)
	addevent(2, 4, 0, 1827, 3, -2, -2, -2)
	addevent(2, 5, 0, 1828, 3, -2, -2, -2)
end
OEVENTLUA[1826] = function ()
	Cls()
	say("咱们追到这儿，却被这雪崩堵在这儿，也不知道上面如何了？", 1061, 0, "中原豪杰")
	say("无妨，落花流水几位大侠武功高强，他们已经追上山去，想来那血刀恶僧也是无处可逃的。", 1045, 1, "中原豪杰")
	say("只是可惜不能手刃血刀恶僧了。", 1061, 0, "中原豪杰")
	say("正是正是。", 1045, 1, "中原豪杰")
	say("几位兄弟，不知可看见我水笙妹子？", 1067, 0, "汪啸风")
	say("哦，是汪大哥，水女侠早前和血刀僧进入雪山了。", 1045, 1, "中原豪杰")
	say("哎，可恨，来晚了一步，水笙妹子，你可千万不要有事啊。", 1067, 0, "汪啸风")
end
OEVENTLUA[1827] = function ()
	Cls()

	if JY.Person[0].轻功 >= 100 then
		DrawStrBoxWaitKey("你施展轻功，往雪山上纵掠而去，下面传来众人一片惊呼", C_ORANGE, CC.DefaultFont, 2)
		My_Enter_SubScene(2, 16, 29, 0)
		null(-2, 4)
	else
		dark()
		light()
		DrawStrBoxWaitKey("这儿刚刚发生了雪崩，你看着陡峭的巍峨雪谷，不由望而生畏", C_ORANGE, CC.DefaultFont, 2)
		My_Enter_SubScene(2, 25, 40, 3)
	end
end
OEVENTLUA[1828] = function ()
	Cls()
	dark()
	null(-2, 5)
	light()
	say("乖徒儿，快把刀放下，这刀锋利的很，一不小心把美人儿划伤了可就不好了。", 97, 0, "血刀老祖")
	say("老祖，这天寒地冻的，咱们先考虑怎么逃出雪谷吧。", 37, 1, "狄云")
	say("乖徒儿倒是心好，你忘了刚才这女娃子，还有那个姓花的都想杀你了？", 97, 0, "血刀老祖")
	say("哦？居然还有人能上来？", 97, 0, "血刀老祖")
	say(JY.Person[0].称呼 .. "，是你，快来帮忙，水笙妹子受伤了。", 37, 1, "狄云")
	meet_self(52)
	instruct_30(16, 29, 16, 23)
	say("帮你忙有什么用？你帮我拿下这小子，我告诉你连城宝藏的大秘密。", 97, 0, "血刀老祖")
	AddPersonAttrib(37, "攻击力", 30)
	AddPersonAttrib(37, "防御力", 30)
	AddPersonAttrib(37, "轻功", 30)
	AddPersonAttrib(37, "拳掌功夫", 10)
	AddPersonAttrib(37, "御剑能力", 10)
	AddPersonAttrib(37, "耍刀技巧", 10)
	AddPersonAttrib(37, "特殊兵器", 10)
	instruct_35(37, 1, 63, 100)

	if yesno("要帮血刀老祖吗？") then
		instruct_37(-1)
		say(JY.Person[0].称呼 .. "，你不要相信他，那个和尚是个恶人。", 37, 0, "狄云")

		if WarMain(16, 0) == false then
			instruct_15()
			Cls()

			return
		end

		dark()
		addevent(2, 6, 1, 6533, 1, 10230, -2, -2)
		addevent(2, 7, 1, 6533, 1, 10228, -2, -2)
		light()
		addthing(59, 1)
		say("好了，大和尚，说吧，宝藏在什么地方？", 0, 1)
		say("好说，附耳过来。", 97, 0, "血刀老祖")
		say("附什么耳，直接说。", 0, 1)
		say("哦，（看看花铁干），你到是大方。", 97, 0, "血刀老祖")
		say("连城宝藏在天宁寺。", 97, 0, "血刀老祖")
		instruct_3(63, 18, 1, 0, 1837, 0, 0, 0, 0, 0, -2, -2, -2)
		addevent(63, 0, 0, 1836, 3, -2, -2, -2)
		say("告辞。", 97, 0, "血刀老祖")
		say("等等。", 0, 1)
		say("怎么？", 97, 0, "血刀老祖")
		say("等等，你这把刀不错，留下吧。", 0, 1)
		say("嘿嘿，就知道中原的人都奸猾，想留下老衲就直说，说什么刀？", 97, 0, "血刀老祖")

		if WarMain(7, 0) == false then
			instruct_15()
			Cls()

			return
		end

		dark()
		addevent(2, 8, 1, 6533, 1, 7966, -2, -2)
		light()
		addthing(139, 1)
		addthing(44, 1)
		say("你是什么人？", 0, 1)
		say("少侠，我姓花，花铁干。", 52, 0, "花铁干")
		say("花铁干？落花流水里面的花大侠？你的兄弟们都死了，你居然还能活着。", 0, 1)
		say("侥幸，侥幸。", 52, 0, "花铁干")
		say("刚才我们说的话你都听见了？", 0, 1)
		say("没，啊，听见了，小人愿意投效少侠，从此为少侠鞍前马后。", 52, 0, "花铁干")
		say("这是我修炼的武功秘笈，今日献给少侠。", 52, 0, "花铁干")

		JY.Person[52].好感度 = 60

		addthing(184, 1)
		addthing(174, 2000)
		say("你到是知机。", 0, 1)

		if instruct_20() == false then
			instruct_10(52)
			instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()
			addevent(2, 16, 1, 1829, 1, -2, -2, -2)
			addevent(2, 2, 1, 1829, 1, -2, -2, -2)
			addevent(2, 3, 1, 1829, 1, -2, -2, -2)
			null(119, 24)
			null(119, 25)
			null(3, 2)
			null(3, 3)
			null(60, 8)
			null(60, 9)
			null(60, 29)

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 83, 0)
		Cls()
		instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 45, 1, 0, 1891, 0, 0, 7014, 7014, 7014, -2, -2, -2)
		Cls()
		null(-2, 2)
		null(-2, 3)
		null(-2, 16)
	else
		say("你就是青海血刀门的恶僧？", 0, 1)
		say("中原人就是虚伪，你们都是干的刀口舔血的勾当，难道就没做过恶事？", 97, 0, "血刀老祖")
		say("废话真多，今日就超度了你。", 0, 1)
		say("等等，花大侠？", 97, 0, "血刀老祖")
		say("啊？我？", 52, 1, "花铁干")
		say("你不会以为他们要逃出去，不会出去宣扬你今日做的事吧？你今日可是亲手杀了结义兄弟。", 97, 0, "血刀老祖")
		say("我......", 52, 1, "花铁干")
		say("哦，居然有这样的事？", 0, 0)
		say("花大侠？咱们一起上，我帮你来个死无对证，这个妞儿也给你。", 97, 1, "血刀老祖")

		if WarMain(329, 0) == false then
			instruct_15()
			Cls()

			return
		end

		JY.Person[52].好感度 = 50

		say("想杀我？我和你们拼了！", 97, 0, "血刀老祖")
		say("啰嗦。", 0, 1)
		dark()
		addevent(2, 8, 1, 6533, 1, 7966, -2, -2)
		null(-2, 10)
		light()
		addthing(139, 1)
		addthing(44, 1)
		say("好一把宝刀。", 0, 1)
		say(JY.Person[0].称呼 .. "，谢谢你救了我们。", 37, 0, "狄云")
		say("多谢少侠。", 305, 1, "水笙")
		say("你们没有大碍吧？这位是？", 0, 0)
		say("这是水笙水女侠，他爹爹是水岱水大侠，可惜被血刀老祖给杀了。", 37, 1, "狄云")
		say("哎，女侠节哀。", 0, 0)
		say("这荒山野谷的，咱们请他们入土为安吧。", 0, 0)
		say("我要将我爹爹和伯父的骨灰带回老家去。", 305, 1, "水笙")
		say("也好。", 0, 0)
		say("狄云、水笙随队行动", 0, 2)
		null(-2, 6)
		null(-2, 7)
		dark()
		null(-2, 9)
		null(-2, 11)
		null(-2, 12)
		light()
		say("刚才那位拿枪的跑哪去了？", 0, 1)
	end

	addevent(2, 16, 1, 1829, 1, -2, -2, -2)
	addevent(2, 2, 1, 1829, 1, -2, -2, -2)
	addevent(2, 3, 1, 1829, 1, -2, -2, -2)
	null(119, 24)
	null(119, 25)
	null(3, 2)
	null(3, 3)
	null(60, 8)
	null(60, 9)
	null(60, 29)
end
OEVENTLUA[1829] = function ()
	Cls()

	if JY.Person[52].好感度 == 60 then
		if inteam(52) then
			say("花大侠，我师妹在里面吗？", 1067, 0, "汪啸风")
			say("这个？", 52, 1, "花铁干")
			say("还请大侠救一下我师妹，必有厚报。", 1067, 0, "汪啸风")
			say("这个，你师妹已经遭了血刀僧毒手。", 52, 1, "花铁干")
			say("还有我的几位兄弟，我的几位兄弟，和血刀老祖拼了一个同归于尽，只有我侥幸活了下来。", 52, 1, "花铁干")
			say("不，不会的，师妹，你不会有事的。", 1067, 0, "汪啸风")
		else
			say("少侠，看见我师妹了吗？", 1067, 0, "汪啸风")
			say("这个？", 0, 1)
			say("还请少侠救一下我师妹，必有厚报。", 1067, 0, "汪啸风")
			say("这个，我去得晚了，里面的几位英雄已经和血刀老祖拼了一个同归于尽了。", 0, 1)
			say("不，不会的，师妹，你不会有事的。", 1067, 0, "汪啸风")
		end
	else
		addevent(2, 1, 1, -2, 1, 9220, -2, -2)
		addevent(2, 15, 1, -2, 1, 8534, -2, -2)
		say("师妹，你出来了。你，你没事吧。", 1067, 0, "汪啸风")
		say("我没事，我爹爹，我爹爹他......", 305, 1, "水笙")
		say("怎么了？", 1067, 0, "汪啸风")
		say("我没事，我爹爹他们都死了。呜呜呜...", 305, 1, "水笙")
		say("这怎么可能？", 1061, 0, "中原豪杰")
		say("你是那个血刀小恶僧？你们怎么在一起？", 1045, 4, "中原豪杰")
		say("我...", 37, 1, "狄云")
		say("水姑娘，他没有对你怎么样吧？", 1061, 0, "中原豪杰")
		say("师妹，这些恶贼，是胁迫了你吗？", 1067, 1, "汪啸风")
		say("他不是小恶僧，他是一位正人君子！", 305, 0, "水笙")
		DrawStrBoxWaitKey("诸人你瞧瞧我，我瞧瞧你，谁也不作声", C_ORANGE, CC.DefaultFont, 2)
		DrawStrBoxWaitKey("火把照耀之下，远远望去，却也看得出这些人的脸上都有鄙夷之色", C_ORANGE, CC.DefaultFont, 2)
		DrawStrBoxWaitKey("有的含着讥笑，有的却显是颇有幸灾乐祸之意", C_ORANGE, CC.DefaultFont, 2)
		say("水侄女，我跟你爹爹认识多年，不得不说你几句。这些恶僧害死了你爹爹和几位大侠...", 1045, 0, "中原豪杰")
		say("不，不...", 305, 1, "水笙")
		say("你爹爹不是那些恶和尚杀的？那么令尊是死于何人之手？", 1045, 0, "中原豪杰")
		say("他...他...", 305, 1, "水笙")
		say("花大侠说，那日谷中激斗，令尊力竭被制，是那小和尚用树枝打破了他天灵盖而死，是也不是？", 1061, 0, "中原豪杰")
		say("不是，是我爹爹自己...自己求他打死的！", 305, 1, "水笙")
		say("原来水大侠活得不耐烦了，伸了头出来，请他的未来贤婿打个开花！", 1045, 0, "中原豪杰")
		say("世间竟有这般无耻的女子，为了个野男人，连亲生父亲也不要了！", 1061, 4, "中原豪杰")
		say("汪少侠，你怎么说。", 1061, 0, "中原豪杰")
		say("这些恶僧入我中原，又杀我师父师伯，今日我们便除奸卫道，为他们报仇。", 1067, 1, "汪啸风")
		say("不，不...，师兄。", 305, 0, "水笙")
		say("师妹，大义不可违，你不要糊涂。", 1067, 1, "汪啸风")
		say("喂喂，各位说得好热闹，莫不是把我当了木头人？", 0, 0)
		say("你和这恶僧明显是一伙的，那还有什么说的？", 1045, 1, "中原豪杰")
		addevent(2, 17, 1, -2, 1, 7014, -2, -2)
		say("各位豪侠，还请助我为弟兄们报仇。", 52, 0, "花铁干")

		if WarMain(330, 0) == false then
			instruct_15()
			Cls()

			return
		end

		say("等等，你不要杀他们。", 305, 0, "水笙")
		say("你可想好了，你今日饶了他们，只怕日后他们不会饶过你。", 0, 1)
		say("他们不是坏人，除了，除了花伯父。", 305, 0, "水笙")
		say("唔，也好。花铁干，你去陪你兄弟们吧。", 0, 1)
		say("等等，我", 52, 0, "花铁干")
		say("啊~", 52, 0, "花铁干")
		addevent(2, 17, 1, 6533, 1, 10214, -2, -2)
		addthing(184, 1)
		say("还不走，难道想留在这儿。", 0, 1)
		say("哼！", 1061, 0, "中原豪杰")
		null(-2, 2)
		null(-2, 3)
		null(-2, 16)
		say("狄兄弟，水姑娘，你们下来有什么安排？", 0, 1)
		say("我想回荆州看看。", 37, 0, "狄云")
		say("我，我要送我爹爹回家。", 305, 0, "水笙")
		DrawStrBoxWaitKey("两人不由对视了一眼", C_ORANGE, CC.DefaultFont, 2)
		say("狄兄弟，我现下也没有什么事，不如咱们一块去荆州吧。", 0, 1)
		say("多谢少侠此次相助，只是我去荆州想办一些私事，还请见谅，我先告辞了。", 37, 0, "狄云")
		say("等等我，我也走了，少侠再见。", 305, 0, "水笙")
		say("好吧，两位再见。", 0, 1)
		null(-2, 1)
		null(-2, 15)
		null(-2, 8)
		null(-2, 17)
		addevent(119, 48, 1, 1831, 1, 8538, -2, -2)
	end

	addevent(119, 3, 0, 1830, 3, -2, -2, -2)
	addevent(119, 5, 1, -2, 1, 8950, -2, -2)
	addevent(119, 47, 1, -2, 1, 7154, -2, -2)
	addevent(119, 4, 1, -2, 1, 9252, -2, -2)
end
OEVENTLUA[1830] = function ()
	Cls()
	dark()
	null(-2, 3)
	light()
	say("空心菜，你今天又和哪家孩子打架了？", 1070, 0, "戚芳")
	say("我今天和隔壁的小妞妞在玩，没有打架，我很乖的，我还帮她种地呢。", 370, 1, "空心菜")
	say("你这孩子，种什么地啊，弄得衣服上都是土。", 1070, 0, "戚芳")
	say("空心菜，听话，以后不要找妞妞玩了，去找林员外家的小琳琳玩，这才能配上你的家世知道吗？", 1086, 1, "万圭")
	say("不嘛，小琳琳不好玩，她就知道欺负人。", 370, 0, "空心菜")
	say("好了好了，孩子还小，不要给她太大压力，她爱找谁玩就找谁玩。", 1070, 1, "戚芳")
	say("我是为他好，等长大才知道这些就晚了，就像你，幸亏遇到了我。", 1086, 0, "万圭")
	say("知道就你本事。对了，我师兄怎么样了？还是不能减轻刑罚吗？要不咱们再多给县丞送些银子过去。", 1070, 1, "戚芳")
	say("都送了好几次了，你别着急，总能救出来的。", 1086, 0, "万圭")
	say("妈妈，我饿了，我要吃午饭了。", 370, 1, "空心菜")
	say("好好好，咱们吃饭去，小桃该把饭做好了吧。", 1070, 0, "戚芳")
	say("吃饭饭了，今天我要吃空心菜炒肉肉。", 370, 1, "空心菜")
	dark()
	null(-2, 4)
	null(-2, 5)
	null(-2, 47)
	addevent(119, 9, 1, 1843, 1, 8950, -2, -2)
	addevent(119, 8, 1, 1843, 1, 7156, -2, -2)
	addevent(119, 28, 1, 1843, 1, 9254, -2, -2)
	light()
end
OEVENTLUA[1831] = function ()
	dark()
	null(-2, 3)
	null(-2, 4)
	null(-2, 5)
	null(-2, 47)
	light()
	Cls()
	say("狄兄弟，你在这儿做什么？", 0, 1)
	say("我来看看师姐，看起来她过的很好，我本来是有些怨恨她的，如今也没有了。", 37, 0, "狄云")
	say("你都知道是怎么回事了？", 0, 1)
	say("知道，丁大哥帮我分析过，这个万圭不是个好人，这都是他为了得到师姐设的局。", 37, 0, "狄云")
	say("那你？", 0, 1)
	say("呵呵，杀了他吗？那师姐该怎么办？还有他们的孩子。", 37, 0, "狄云")
	say("这样？狄兄弟，你的事你做主，接下来你准备做什么去？", 0, 1)
	say("我不知道，我只想找个安静的地方一个人呆着，外面的人都很有心计，我应付不来。", 37, 0, "狄云")
	say("安静的地方？你不如和我去小村？那里很安静，人也都很好的。", 0, 1)
	say("我想回中州老家看看，我只熟悉这块地方。还有师父，我要等他回来。", 37, 0, "狄云")
	say("......，也好也好，狄兄弟，希望我们还能再见面。", 0, 1)
	say("好，少侠，告辞了。", 37, 0, "狄云")
	null(-2, 48)
	addevent(41, 0, 1, 1832, 1, 6764, -2, -2)
end
OEVENTLUA[1832] = function ()
	Cls()

	if JY.Scene[125].进入条件 == 0 then
		say("狄兄弟，我们又见面了。", 0, 1)
		say("少侠，你来了。", 37, 0, "狄云")
		say("咦？狄兄弟，你手里拿的什么书？", 0, 1)
		say("这个啊，有一次师姐想做教书先生，找了本《唐诗选集》来，我当学生，然后她教我背诵唐诗。", 37, 0, "狄云")
		addevent(41, 8, 1, -2, 1, 7150, -2, -2)
		addevent(41, 9, 1, -2, 1, 8706, -2, -2)
		addevent(41, 10, 1, -2, 1, 8706, -2, -2)
		say("哈哈哈哈，唐诗选集，果然在你手里，爹爹他们费尽心机都没有找到，却被我找到了，哈哈哈。", 1086, 0, "万圭")
		say("少主果然是神机妙算。", 1079, 1, "帮众")
		say("赶快把书交出来，少主看在夫人的面子上，饶你不死。", 1081, 1, "帮众")
		say("为什么你们还是不肯放过我，你还要怎么样？", 37, 0, "狄云")
		say("狄兄弟，无妨，这些都是些小跳蚤而已。", 0, 1)

		if WarMain(331, 0) == false then
			instruct_15()
			Cls()

			return
		end

		null(-2, 9)
		null(-2, 10)
		addevent(41, 8, 1, -2, 1, 7144, -2, -2)
		addevent(41, 11, 1, -2, 1, 8950, -2, -2)
		My_Enter_SubScene(41, 38, 30, 3)
		Cls()
		say("住手，不要杀他。", 1070, 0, "戚芳")
		say("却是戚芳突然闪了出来，替万圭挡了一剑", 0, 2)
		null(-2, 0)
		addevent(41, 12, 1, -2, 1, 8534, -2, -2)
		My_Enter_SubScene(41, 40, 32, 2)
		say("师姐，你怎么样了？", 37, 0, "狄云")
		say("狄师弟，师姐对不起你。", 1070, 1, "戚芳")
		say("师姐。", 37, 0, "狄云")
		say("师姐求你们了，不要杀他，他虽然做了很多错事，可他现在是我的丈夫。", 1070, 1, "戚芳")
		say("你放心，我不杀他，少侠？", 37, 0, "狄云")
		say("狄兄弟，这都随你。", 0, 1)
		say("呵呵，芳妹，你扶我起来。", 1086, 0, "万圭")
		say("好，你慢点，我看看你伤在什么地方了？", 1070, 1, "戚芳")
		say("啊~", 1070, 1, "戚芳")
		addevent(41, 11, 1, -2, 1, 8314, -2, -2)
		Cls()
		say("却是万圭趁戚芳扶他的时候，突然调转剑尖，一剑刺入了她的胸口", 0, 2)
		say("你，你...", 1070, 0, "戚芳")
		say("芳妹，我丹田中了一剑，已经活不了了啦。", 1086, 1, "万圭")
		say("你，你...", 1070, 0, "戚芳")
		say("芳妹，我不想一个人走，不想走得这么孤单，你陪着我可好。", 1086, 1, "万圭")
		say("我...", 1070, 0, "戚芳")
		say("芳妹，我对不起你，对不起...", 1086, 1, "万圭")
		say("师姐。（事发突然，众人一时都没反应过来）", 37, 0, "狄云")
		say("师姐~，你不要死~", 37, 0, "狄云")
		say("狄师弟，师姐对...对不起你，师姐是不是...是不是很没用？", 1070, 1, "戚芳")
		say("不是的，师姐，不是的......", 37, 0, "狄云")
		dark()
		light()
		say("狄兄弟，他们都已经去了。", 0, 1)
		say("师姐~", 37, 0, "狄云")
		say("哎，宝藏动人心，狄师弟，节哀。", 0, 1)
		say("师姐~", 37, 0, "狄云")
		dark()
		say("半日之后", 0, 2)
		null(-2, 8)
		null(-2, 11)
		addevent(41, 13, 1, -2, 1, 6696, -2, -2)
		addevent(41, 14, 1, -2, 1, 2770, -2, -2)
		addevent(41, 15, 1, -2, 1, 6696, -2, -2)
		addevent(41, 16, 1, -2, 1, 2770, -2, -2)
		null(119, 9)
		null(119, 8)
		null(119, 28)
		light()
		addevent(41, 12, 1, 1833, 1, 8534, -2, -2)
	else
		say("狄兄弟，我们又见面了，你在这儿做什么？", 0, 1)
		say("少侠，你来了。", 37, 0, "狄云")
		say("这个山洞以前没什么人来，那时候我和师姐老来这儿玩。", 37, 0, "狄云")
		say("狄兄弟.....", 0, 1)
		say("那时候我们还很小，师姐喜欢当新娘子，我来给她当新郎，然后一块儿假装种地啊做饭啊。", 37, 0, "狄云")
		say("......", 0, 1)
		say("哎，没了，都没有了，连丁大哥都不在了，只剩下我一个人还活着。", 37, 0, "狄云")
		say("狄兄弟，你这样不行啊，不如随我去江湖闯荡吧，也许能淡忘一些。", 0, 1)
		say("我不想出去，想在这里呆着。", 37, 0, "狄云")
		say("...，哎，狄兄弟真是命运多舛啊。", 0, 1)
	end
end
OEVENTLUA[1833] = function ()
	Cls()
	say("狄兄弟，随我去小村吧。", 0, 1)
	say("哎，也好，我已经无处可去了。", 37, 0, "狄云")
	say("等等，我要把这本书带上。", 37, 0, "狄云")
	say("咦？", 37, 0, "狄云")
	DrawStrBoxWaitKey("却是刚才狄云扶戚芳时，唐诗选集掉在地上", C_ORANGE, CC.DefaultFont, 2)
	DrawStrBoxWaitKey("染上了鲜血，如今上面却显出一副地图来，上面写着天宁寺几个字", C_ORANGE, CC.DefaultFont, 2)
	say("原来在这里，师父他们费尽心机，却不想宝藏就在这本《唐诗选辑》里。", 37, 0, "狄云")
	say("狄兄弟，我们走吧。", 0, 1)
	instruct_3(63, 18, 1, 0, 1837, 0, 0, 0, 0, 0, -2, -2, -2)
	addevent(63, 0, 0, 1836, 3, -2, -2, -2)

	if instruct_20() == false then
		instruct_10(37)
		instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		Cls()

		return
	end

	say("你的队伍已满，我就直接去小村吧。", 37, 0)
	Cls()
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(70, 20, 1, 0, 1893, 0, 0, 4267, 8534, 8534, -2, -2, -2)
end
OEVENTLUA[1835] = function ()
	Cls()
	null(-2, 34)
	instruct_3(63, 1, 0, 0, 0, 0, 0, 6768, 6768, 6768, -2, -2, -2)
	instruct_3(63, 2, 0, 0, 0, 0, 0, 6768, 6768, 6768, -2, -2, -2)
	instruct_3(63, 3, 0, 0, 0, 0, 0, 6766, 6766, 6766, -2, -2, -2)
	instruct_3(63, 4, 0, 0, 0, 0, 0, 6766, 6766, 6766, -2, -2, -2)
	instruct_3(63, 5, 0, 0, 0, 0, 0, 6770, 6770, 6770, -2, -2, -2)
	instruct_3(63, 6, 0, 0, 0, 0, 0, 6770, 6770, 6770, -2, -2, -2)
	instruct_3(63, 7, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(63, 8, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(63, 9, 0, 0, 0, 0, 0, 6780, 6780, 6780, -2, -2, -2)
	instruct_3(63, 10, 0, 0, 0, 0, 0, 6780, 6780, 6780, -2, -2, -2)
	instruct_3(63, 11, 0, 0, 0, 0, 0, 6780, 6780, 6780, -2, -2, -2)
	instruct_3(63, 12, 0, 0, 0, 0, 0, 5222, 5222, 5222, -2, -2, -2)
	instruct_3(63, 13, 0, 0, 0, 0, 0, 5222, 5222, 5222, -2, -2, -2)
	instruct_3(63, 14, 0, 0, 0, 0, 0, 5222, 5222, 5222, -2, -2, -2)
	instruct_3(63, 15, 0, 0, 0, 0, 0, 5222, 5222, 5222, -2, -2, -2)
	instruct_3(63, 16, 0, 0, 0, 0, 0, 6768, 6768, 6768, -2, -2, -2)
	say("好多的人，为了宝藏，只好一路杀进去了。", 0, 1)

	if WarMain(93, 0) == false then
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
end
OEVENTLUA[1836] = function ()
	Cls()
	dark()
	null(2, 2)
	null(2, 3)
	null(2, 16)
	null(-2, 0)
	instruct_3(63, 30, 0, 0, 0, 0, 0, 8982, 8982, 8982, -2, -2, -2)
	instruct_3(63, 31, 0, 0, 0, 0, 0, 8982, 8982, 8982, -2, -2, -2)
	light()
	say("可恶，被这些汉人堵在这儿了，咱们和他们拼了。", 205, 1, "善勇")
	say("拼了，这帮可恶的汉人，一路追杀咱们，今日也叫他们知道厉害。", 254, 0, "胜谛")
	say("咦？血刀僧？你们居然找到这儿来了，宝藏在哪儿？交出来。", 0, 1)
	say("什么宝藏？", 205, 0, "善勇")
	say("装什么装？当然是连城宝藏。", 0, 1)
	say("这汉人疯了，到这儿找什么宝藏？师父叫我们往南方走，结果一路遇到很多汉人追杀，一路到了这儿。", 254, 0, "胜谛")
	say("啊？这么说你们不是来找宝藏的？", 0, 1)
	say("那就好！", 0, 1)
	say("不过看见你们还是觉得不爽。", 0, 1)
	say("小心！", 205, 0, "善勇")

	if WarMain(246, 0) == false then
		instruct_15()
		Cls()

		return
	end

	null(-2, 30)
	null(-2, 31)
end
OEVENTLUA[1837] = function ()
	Cls()

	if JY.Person[0].盗贼技巧 >= 20 then
		say("佛像背后有个暗格，可惜里面什么也没有。", 0, 1)
		say("手伸进去后，你摸到一个隐藏的机关。", 0, 1)
		say("有了。", 0, 1)
		addthing(283, 1)
		addthing(146, 1)

		if inteam(37) then
			say("是连城剑法，原来祖师真的藏了剑法在这儿。", 37, 0, "狄云")
			stop_ng(37)
			instruct_35(37, 2, 168, 0)
			DrawStrBoxWaitKey("狄云学会武功【Ｇ连城剑法Ｏ】", C_ORANGE, CC.DefaultFont, 2)
		end

		addevent(-2, 32, 1, -2, 1, 8874, -2, -2)
		say("不枉我装死，隐姓埋名这么辛苦。连城诀最终还是我的，哈哈哈哈~~~", 253, 0, "戚长发")

		if inteam(37) then
			say("师父，原来你没有死！", 37, 1, "狄云")
			say("云儿，是你。赶紧把连城诀交出来，饶你们不死。", 253, 0, "戚长发")
			say("师父，你怎么……", 37, 1, "狄云")
		end

		say("这连城诀已经有主人了。", 0, 0)
		say("找死！", 253, 1, "戚长发")

		if WarMain(247, 0) == false then
			instruct_15()

			return
		end

		say("不！！！*连城诀是我的，是我的！！*啊~~~~", 253, 0, "戚长发")
		dark()
		null(-2, 32)
		light()

		if inteam(37) then
			say("我的师父果然是这样的人。", 37, 0, "狄云")
			say("狄兄弟，你师父之前一直在演戏。", 0, 1)
			say("他外号叫做‘铁索横江’，那是什么意思？什么事情做不出？", 0, 1)
			say("我真是不能明白：一个人世上什么亲人都不要，不要师父、师兄弟、徒弟、连亲生女儿也不顾，就算拿到了连城诀和价值连城的宝藏，又有什么快活？", 37, 0, "狄云")
			say("狄兄弟，你说的这个问题很深奥，这世上确实是有这种人。", 0, 1)
			say("哎。", 37, 0, "狄云")
		else
			say("哪儿出来的毛贼，不自量力。", 0, 1)
		end

		null(-2, 18)
		addevent(-2, 21, 0, 1838, 3, -2, -2, -2)
		addevent(119, 4, 1, 1841, 1, 9252, -2, -2)
		addevent(119, 27, 1, 1842, 1, 9218, -2, -2)
	else
		say("佛像背后有个暗格，可惜里面什么也没有。", 0, 1)
	end

	null(2, 2)
	null(2, 3)
	null(2, 16)
	null(2, 6)
	null(2, 7)
	null(2, 8)
	null(2, 9)
	null(2, 11)
	null(2, 12)
end
OEVENTLUA[1838] = function ()
	Cls()
	dark()
	null(-2, 21)
	instruct_3(63, 5, 0, 0, 0, 0, 0, 10062, 10062, 10062, -2, -2, -2)
	instruct_3(63, 6, 0, 0, 0, 0, 0, 10062, 10062, 10062, -2, -2, -2)
	instruct_3(63, 7, 0, 0, 0, 0, 0, 10596, 10596, 10596, -2, -2, -2)
	instruct_3(63, 8, 0, 0, 0, 0, 0, 9392, 9392, 9392, -2, -2, -2)
	instruct_3(63, 9, 0, 0, 0, 0, 0, 10062, 10062, 10062, -2, -2, -2)
	instruct_3(63, 10, 0, 0, 0, 0, 0, 10062, 10062, 10062, -2, -2, -2)
	instruct_3(63, 11, 0, 0, 0, 0, 0, 10596, 10596, 10596, -2, -2, -2)
	instruct_3(63, 23, 0, 0, 0, 0, 0, 10062, 10062, 10062, -2, -2, -2)
	instruct_3(63, 24, 0, 0, 0, 0, 0, 10062, 10062, 10062, -2, -2, -2)
	instruct_3(63, 33, 0, 0, 0, 0, 0, 9606, 9606, 9606, -2, -2, -2)
	light()
	say("里面的人听好了，你们已经被包围了，立刻放下刀剑，投降不死。", 1255, 0, "官兵")
	say("放下刀剑，饶你不死。", 0, 2)
	say("不好，怎么来这么多的官兵。", 0, 1)

	if instruct_16(37) then
		say("是荆州知州凌大人，他怎么调了这么多官军到这儿来？", 37, 0, "狄云")
		say("荆州知州凌大人？", 0, 1)
		say("是凌大姐的父亲，就是他将丁大哥关了10来年，一心要得到宝藏的秘密。", 37, 0, "狄云")
		say("原来如此。", 0, 1)
	end

	say("大人~，不要误会，我们不是匪徒。", 0, 1)
	say("这儿死了这么多人，你说和你们毫无关系？费话少说，给我拿下！", 1065, 0, "凌退思")
	say("哎~，不要逼我。", 0, 1)

	if WarMain(333, 0) == false then
		instruct_15()

		return
	end

	dark()
	My_Enter_SubScene(63, 21, 33, 3)
	null(-2, 5)
	null(-2, 6)
	null(-2, 7)
	null(-2, 9)
	null(-2, 23)
	null(-2, 24)
	null(-2, 33)
	light()
	say("你们好大的胆子，居然敢！", 1065, 0, "凌退思")
	say("你就是荆州凌知州？", 0, 1)
	say("你们既然认识我，还不赶快放了我！难道想做朝廷钦犯被四处通缉？", 1065, 0, "凌退思")
	say("凌霜华棺材上的毒药是你涂上去的？", 0, 1)
	say("是又如何，那丁小子不识大体，又勾搭了我女儿，留他何用！", 1065, 0, "凌退思")

	if instruct_16(37) then
		say("果然是你杀了丁大哥。", 37, 1, "狄云")
		say("那，霜华大姐又是怎么死的？", 37, 1, "狄云")
		say("与你何干！我的女儿如何是我的事。", 1065, 0, "凌退思")
		say("我先杀了你替丁大哥报仇。", 37, 1, "狄云")
		say("哼，我可是朝廷命官，你们不想余生在逃亡中度过就快快放了我。", 1065, 0, "凌退思")
		say("不说也想得到，当日凌霜华让我去救丁大哥，你后来知道了，就下了毒手，好引丁大哥上当，可是如此？", 0, 1)
		say("哼。", 1065, 0, "凌退思")
		say("你好恶毒，那可是你女儿，亲生女儿。", 37, 1, "狄云")
		say("哼，那又如何？生个女儿却心向外人，不如没有。", 1065, 0, "凌退思")

		if yesno("要杀凌退思吗？") then
			instruct_37(1)
			say("啊~", 1065, 0, "凌退思")
			say("你~，你竟然敢~。", 1065, 0, "凌退思")
			dark()
			null(-2, 8)
			light()
			DrawStrBoxWaitKey("你击杀了朝廷命官，你被中原官府通缉了", C_ORANGE, CC.DefaultFont, 2)
			AddPersonAttrib(0, "中原罪恶值", 100)
			say("我们给丁大哥报仇了，丁大哥可以安息了。这是丁大哥的遗物，就送给你吧。", 37, 0, "狄云")
			addthing(71, 1)
		else
			say("这可是朝廷命官，杀了他终是不妥，还是放了吧。", 0, 0)
			say("......", 37, 1, "狄云")
			say("还是你明白事理，不过你们杀了这么多人，终是犯下了大罪，依我看，不如你们将功赎罪，将连城诀交出来，我禀告上官，就说你们是助我剿匪的义士，必得朝廷嘉奖。", 1065, 0, "凌退思")
			say("我们是不会将连城诀给你的。", 37, 1, "狄云")
			say("你要知道，今日死了这么多人，事情太大，是遮不住的。", 1065, 0, "凌退思")
			say("真是麻烦。", 0, 1)
			say("啊~", 1065, 0, "凌退思")
			say("你~，你竟然敢~。", 1065, 0, "凌退思")
			say("哎，非要逼我杀你，这下不就没人知道事情谁做的了。", 0, 1)
			say("......", 37, 0, "狄云")
			dark()
			null(-2, 8)
			light()
			DrawStrBoxWaitKey("你击杀了朝廷命官，你被中原官府通缉了", C_ORANGE, CC.DefaultFont, 2)
			AddPersonAttrib(0, "中原罪恶值", 100)
		end
	else
		say("啊~", 1065, 0, "凌退思")
		say("你~，你竟然敢~。", 1065, 0, "凌退思")
		dark()
		null(-2, 8)
		light()
		DrawStrBoxWaitKey("你击杀了朝廷命官，你的罪恶值增加了50", C_ORANGE, CC.DefaultFont, 2)
		AddPersonAttrib(0, "中原罪恶值", 100)
	end

	say("知州大人被杀了，大家快跑啊~", 1255, 0, "众官兵")
	dark()
	null(-2, 10)
	null(-2, 11)
	light()
end
OEVENTLUA[1841] = function ()
	Cls()
	say("妈妈，你在哪儿？空心菜好饿。", 370, 0, "空心菜")

	if inteam(37) then
		addevent(119, 47, 1, -2, 1, 8532, -2, -2)
		say("是小空心菜，我该死，我怎么现在才来。", 37, 1, "狄云")
		say("......", 0, 0)
		say("空心菜，妈妈有事耽误了，要很久才会回来，妈妈要叔叔先来照顾你。", 37, 1, "狄云")
		say("妈妈去哪儿了？", 370, 0, "空心菜")
		say("妈妈去很远的地方了，来，叔叔带你去吃东西，你想吃什么？", 37, 1, "狄云")
		say("我要吃空心菜炒肉肉，还要吃大白米饭。", 370, 0, "空心菜")
		dark()
		null(-2, 4)
		light()
		null(-2, 47)
	end
end
OEVENTLUA[1842] = function ()
	Cls()

	if inteam(37) then
		addevent(119, 50, 1, -2, 1, 8538, -2, -2)
		say("狄大哥，你来了？", 305, 0, "水笙")
		say("我来了。", 37, 1, "狄云")

		if instruct_20() == false then
			instruct_10(589)
			null(-2, 50)
			instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 305, 0)
		Cls()
		instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 19, 1, 0, 1895, 0, 0, 8680, 8680, 8680, -2, -2, -2)
		null(-2, 50)
	else
		say("你看见狄大哥了吗？", 305, 0, "水笙")
	end
end
OEVENTLUA[1843] = function ()
	Cls()
	say("空心菜，今天吃得香吗？", 1070, 0, "戚芳")
	say("香。", 370, 1, "空心菜")
	say("空心菜，明天开始和红姨学着做女红，这么大孩子了，光知道玩可不行。", 1086, 0, "万圭")
	say("不嘛，我要和娘亲学剑法。", 370, 1, "空心菜")
	say("不行，女孩子学了剑法有什么用，以后都嫁不出去。", 1086, 0, "万圭")
	say("娘亲，我要学剑法，好帅的。", 370, 1, "空心菜")
	say("乖，听爹爹的。", 1070, 0, "戚芳")
	say("红姨带的孩子可都是周边大富世家的孩子，你可要和他们做好关系网。", 1086, 1, "万圭")
	say("什么叫关系网？", 370, 0, "空心菜")
	say("你呀，孩子这么小，哪懂这些的？", 1070, 1, "戚芳")
	say("这可要从小开始学，教育要从娃娃抓起。", 1086, 0, "万圭")
	say("你在我们家里做什么，赶快离开。", 1086, 0, "万圭")
	dark()
	addevent(119, 9, 1, 1843, 1, 8950, -2, -2)
	addevent(119, 8, 1, 1843, 1, 7156, -2, -2)
	addevent(119, 28, 1, 1843, 1, 9254, -2, -2)
	light()
end
OEVENTLUA[1780] = function ()
	say("袁兄，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(54)
	instruct_3(70, 51, 1, 0, 1781, 0, 0, 6818, 6818, 6818, -2, -2, -2)
end
OEVENTLUA[1781] = function ()
	Cls()

	if JY.Person[0].御剑能力 == 99 then
		say("你的剑法似乎可以更进一步了，需要我帮忙吗？", 54, 0)
		say("还请袁兄指点。", 0, 1)
		dark()
		light()
		say("原来如此。", 0, 1)
		say("你只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(2, 1)

		JY.Person[0].御剑能力 = 100

		return
	end

	say("有需要我帮忙的地方吗？", 54, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(54)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 54, 0)
		Cls()

		return
	end
end
OEVENTLUA[1782] = function ()
	say("铁手，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(83)
	instruct_3(70, 103, 1, 0, 1783, 0, 0, 7042, 7042, 7042, -2, -2, -2)
end
OEVENTLUA[1783] = function ()
	Cls()

	if has_thing(231) then
		say("你身上这个火蟾给我如何？我可以帮你提高毒性抗力。", 83, 0)

		if yesno("要把火蟾给铁手吗？") then
			say("好。", 0, 1)
			addthing(231, -1)
			say("你等等，我准备一下药材，需要给你药浴的。", 83, 0)
			dark()
			light()
			addtime(3)
			say("好了。", 83, 0)

			JY.Person[83].无用3 = JY.Person[83].无用3 + 10
			JY.Person[0].抗毒能力 = JY.Person[0].抗毒能力 + 10

			DrawStrBoxWaitKey("你的抗毒能力提升了10点", C_ORANGE, CC.DefaultFont)

			return
		else
			say("这个不能给你，我还有用呢。", 0, 1)
			say("哼，小气鬼，不给就算了。", 83, 0)
		end
	elseif has_thing(194) then
		say("你身上这个冰蚕给我如何？我可以帮你提高毒性抗力。", 83, 0)

		if yesno("要把冰蚕给铁手吗？") then
			say("好。", 0, 1)
			addthing(194, -1)
			say("你等等，我准备一下药材，需要给你药浴的。", 83, 0)
			dark()
			light()
			addtime(3)
			say("好了。", 83, 0)

			JY.Person[83].无用2 = JY.Person[83].无用2 + 10
			JY.Person[0].抗毒能力 = JY.Person[0].抗毒能力 + 10

			DrawStrBoxWaitKey("你的抗毒能力提升了10点", C_ORANGE, CC.DefaultFont)

			return
		else
			say("这个不能给你，我还有用呢。", 0, 1)
			say("哼，小气鬼，不给就算了。", 83, 0)
		end
	end

	say("有需要我帮忙的地方吗？", 83, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(83)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 83, 0)
		Cls()

		return
	end
end
OEVENTLUA[1784] = function ()
	say("青青，你先回小村，我晚点再回去找你。", 0, 1)
	Cls()
	instruct_21(91)
	instruct_3(70, 109, 1, 0, 1785, 0, 0, 8420, 8420, 8420, -2, -2, -2)
end
OEVENTLUA[1785] = function ()
	say("有需要我帮忙的时候就想到我了？", 91, 0)
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(91)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 91, 0)
		Cls()

		return
	end
end
OEVENTLUA[1890] = function ()
	say("老铁，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(52)
	instruct_3(70, 45, 1, 0, 1891, 0, 0, 7014, 7014, 7014, -2, -2, -2)
end
OEVENTLUA[1891] = function ()
	Cls()

	if JY.Person[0].特殊兵器 == 99 then
		say("少侠，你武功进步真快，需要我帮忙吗？", 52, 0)
		say("你说。", 0, 1)
		dark()
		light()
		say("原来如此。", 0, 1)
		say("你只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(4, 1)

		JY.Person[0].特殊兵器 = 100

		return
	end

	say("少侠，你有什么吩咐？", 52, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(52)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 52, 0)
		Cls()

		return
	end
end
OEVENTLUA[1892] = function ()
	say("狄兄弟，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(37)
	instruct_3(70, 20, 1, 0, 1893, 0, 0, 4267, 8534, 8534, -2, -2, -2)
end
OEVENTLUA[1893] = function ()
	say("有需要我帮忙的地方吗？", 37, 0)
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(37)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 37, 0)
		Cls()

		return
	end
end
OEVENTLUA[1894] = function ()
	say("水姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(589)
	instruct_3(70, 19, 1, 0, 1895, 0, 0, 8680, 8680, 8680, -2, -2, -2)
end
OEVENTLUA[1895] = function ()
	say("有需要我帮忙的地方吗？", 305, 0, "水笙")
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(589)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 305, 0, "水笙")
		Cls()

		return
	end
end
