OEVENTLUA[1901] = function ()
	Cls()
	say("到这时候还不拿出来？姓吴的，你到底识不识时务？", 1035, 0, "安寨主")
	say("素闻金刀寨安寨主劫富济贫，江湖上提起来，都是翘起大拇指，说一声：‘侠盗！’怎么今日却向卖烧饼的穷老汉打起主意来啦？", 1034, 1)
	say("吴道通，你是决计不交出来的啦？", 1035, 0, "安寨主")

	if yesno("要上去阻止争执吗？") then
		say("喂，你们这是在争抢什么东西？", 0, 1)
		say("臭小子，赶快滚开！", 1035, 0, "安寨主")
		say("小子，赶快滚开，这儿没你的事。", 1034, 1)
		say("大家以和为贵，不要为点小事伤了和气。", 0, 0)
		say("聒噪，既然你不走，那就别走了！", 1035, 1, "安寨主")

		if WarMain(334, 0, 1, 1) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		dark()
		null(-2, 13)
		null(-2, 14)
		null(-2, 15)
		null(-2, 16)
		light()
		instruct_40(1)
		say("东西拿出来，让我看看。", 0, 1)
		say("少侠武功高强，我是佩服的。不过东西不在我身上，无论如何也是拿不出来的。", 1034, 0)
		say("真是，非要我动手么。", 0, 1)
		DrawStrBoxWaitKey("那吴道通见你逼了上来，将满桌的烧饼一股脑向你掷了过来", C_ORANGE, CC.DefaultFont, 2)
		say("哼。", 0, 1)
		say("啊~", 1034, 0)
		dark()
		null(-2, 12)
		light()
		addthing(174, 50)
		say("他们究竟在争抢什么东西？怎么什么也没有找到？", 0, 1)
	else
		say("先看看。", 0, 1)
		dark()
		null(-2, 12)
		light()
		say("吴道通，今日看你能跑到哪里去？小的们，给我追。", 1035, 0, "安寨主")
		dark()
		null(-2, 13)
		null(-2, 14)
		null(-2, 15)
		null(-2, 16)
		light()
		DrawStrBoxWaitKey("只见地上散落了满地的烧饼", C_ORANGE, CC.DefaultFont, 2)
		say("都走了，究竟在争抢什么东西？", 0, 1)
	end

	addevent(40, 17, 0, 1902, 3, -2)

	JY.Person[38].好感度 = 51
	JY.Person[162].佛学修为 = 1
end
OEVENTLUA[1902] = function ()
	Cls()
	addevent(40, 10, 1, 1903, 1, 6272, -2, -2)
	addevent(40, 34, 1, 1903, 1, 5266, -2, -2)
	addevent(40, 35, 1, 1903, 1, 5274, -2, -2)
	addevent(40, 36, 1, 1903, 1, 10416, -2, -2)
	addevent(40, 37, 1, 1903, 1, 8424, -2, -2)
	null(-2, 17)
end
OEVENTLUA[1903] = function ()
	Cls()
	say("石庄主，这却是对不住了，这玄铁令是我们先发现的，却不敢劳石庄主帮着收取。", 43, 0, "白万剑")
	say("白师兄，既是雪山派要这玄铁令，愚夫妇自是不会争抢，白师兄取了便是。", 1125, 1, "石清")
	say("小乞丐，这块玄铁令留在你身上是祸非福，我拿一百两白银和你交换你可愿意？", 43, 0, "白万剑")
	say("我...", 38, 1, "石破天")
	meet_self(43)
	say("等等。", 164, 0, "谢烟客")
	dark()
	addevent(40, 38, 1, -2, 1, 9018, -2, -2)
	light()
	say("小辈，难道我谢烟客的玄铁令只值100两白银么？", 164, 0, "谢烟客")
	say("摩天居士谢烟客？", 43, 1, "白万剑")
	say("小乞丐，既然你拿到了玄铁令，那我就可以满足你一个要求，不过却不能有旁人指手画脚，你先跟我走吧。", 164, 0, "谢烟客")
	say("我...", 38, 1, "石破天")
	dark()
	null(-2, 10)
	null(-2, 38)
	light()
	meet_self(38)
	meet_self(164)
	say("好高妙的轻功。", 1125, 0, "石清")
	say("原来是玄铁令。", 0, 1)
	say("可惜，没想到摩天居士谢烟客居然会亲自出手。", 43, 0, "白万剑")
	say("白师兄，不知我的孩儿在派里过的如何？", 1090, 1, "闵柔")
	say("哼，我师父师娘没给你的小……小……气死，总算福份不小。", 43, 0, "白万剑")
	say("白师兄，我那玉儿确是顽皮得紧，得罪了诸位，我……我……我先给各位赔礼了。", 1090, 1, "闵柔")
	say("哼，我若是寻到这个孽，这个小子，我非一剑砍了他不可。", 43, 0, "白万剑")
	say("白师兄，玉儿这是闯了什么祸事？", 1125, 1, "石清")
	say("哼，石中玉这个小子，胆大妄为，竟将我们师侄女绑住了手足，将她剥得一丝不挂，想要强奸。", 1124, 0, "雪山弟子")
	say("这这，玉儿他还只一十五岁，这？", 1090, 1, "闵柔")
	say("石庄主，石夫人，事情我已经告诉你们了，该当如何你们自该有分寸，告辞。", 43, 0, "白万剑")
	say("啊，白师兄慢走......", 1125, 1, "石清")
	dark()
	null(-2, 34)
	null(-2, 35)
	light()
	say("师兄，刚才这个乞丐，和咱们的孩儿长得好像。", 1090, 0, "闵柔")
	say("是有些像，等咱们去雪山派后，再去找着这孩子看看。", 1125, 1, "石清")
	say("这位少侠，不知你是？", 1125, 0, "石清")
	say("啊，我是路人甲。", 0, 1)
	say("原来是路兄弟，鄙夫妇还有要事，告辞了。", 1125, 0, "石清")
	say("告辞。", 0, 1)
	dark()
	null(-2, 36)
	null(-2, 37)
	light()
	addevent(40, 39, 1, 1904, 1, -2, -2, -2)
	instruct_39(106)
	addevent(106, 0, 1, 1905, 1, -2, -2, -2)
	addevent(106, 1, 1, 1906, 1, 4866, -2, -2)
end
OEVENTLUA[1904] = function ()
	Cls()
	say("那个小乞丐，捡了个烧饼，里面居然藏有个铁片，还能卖100两白银。", 1071, 0, "馒头妞")
	say("100两啊，我得卖三年的馒头才能挣到。", 1071, 0, "馒头妞")
	say("看什么？你买馒头吗？一文钱两个。", 1071, 0, "馒头妞")
end
OEVENTLUA[1905] = function ()
	Cls()
	say("小兄弟，你怎么了？", 0, 1)
	say("我，我不知道，我全身一会发冷一会发热，好难受。", 38, 0, "石破天")
	say("别着急，我给你看看。", 0, 1)
	dark()
	light()
	say("......", 0, 1)
	say("阴阳真气相冲，是走火入魔之兆，很麻烦，很麻烦。", 0, 1)
	dark()
	addevent(106, 2, 1, -2, 1, 8848, -2, -2)
	addevent(106, 3, 1, -2, 1, 8882, -2, -2)
	addevent(106, 4, 1, -2, 1, 8882, -2, -2)
	light()
	say("请问摩天居士在吗？", 85, 0, "貝海石")
	say("摩天居士？", 0, 1)
	meet_self(85)
	say("你不是摩天崖的人？", 85, 0, "貝海石")
	say("这位兄弟怎么了？", 85, 0, "貝海石")
	say("他", 0, 1)
	say("我看看，我是位医生。", 85, 0, "貝海石")
	dark()
	light()
	say("阴阳真气相冲，走火入魔了，很麻烦，不过还是有办法救治的。", 85, 0, "貝海石")
	say("我把他带回去医治，告辞。", 85, 0, "貝海石")
	say("这", 0, 1)
	say("怎么？你能救他？", 85, 0, "貝海石")
	say("不能。", 0, 1)
	say("带这位小兄弟，咱们下山。", 85, 0, "貝海石")
	say("是。", 1101, 1, "长乐帮众")
	dark()
	null(-2, 0)
	null(-2, 1)
	null(-2, 2)
	null(-2, 3)
	null(-2, 4)
	light()
	say("这次碰到个好人了，素不相识，居然能热心出手，还将人带回家救治，不容易啊。", 0, 1)
	dark()
	addevent(106, 4, 1, -2, 1, 9020, -2, -2)
	light()
	say("小辈，那小杂种呢？你将他藏哪去了，快交出来。", 164, 0, "谢烟客")
	say("我没有。", 0, 1)
	say("哼。", 164, 0, "谢烟客")

	if WarMain(342, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	say("好厉害的武功，你究竟是什么人？", 164, 0, "谢烟客")
	say("我是路人甲。", 0, 1)
	say("原来是路少侠，路少侠是长乐帮的人？你们将我阻在后山，这边却将小杂种抢了去，难道是想要以此要挟我？", 164, 0, "谢烟客")
	say("误会误会，我是路过的，刚巧看见那个小，小兄弟运功出了岔子，长乐帮来的人说可以救他，将他带走了。", 0, 1)
	say("少侠武功如此高强，想来也不需要阴谋对付谢某。这长乐帮敢到我摩天崖抢人，少不得我再将他抢回来，少侠，告辞。", 164, 0, "谢烟客")
	dark()
	null(-2, 4)
	light()
	instruct_3(94, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(94, 9, 1, 0, 1919, 1920, 0, 7028, 7028, 7028, -2, -2, -2)
	instruct_17(94, 2, 37, 19, 5156)
	instruct_17(94, 2, 34, 21, 4866)

	if Rnd(2) == 1 then
		addevent(103, 29, 1, 1908, 1, 5140, -2, -2)
		addevent(103, 30, 1, 1908, 1, 9408, -2, -2)
	else
		addevent(127, 0, 1, 1908, 1, 5140, -2, -2)
		addevent(127, 1, 1, 1908, 1, 9408, -2, -2)
	end
end
OEVENTLUA[1906] = function ()
	Cls()
	null(-2, 1)
	addthing(72, 1)
	say("这是什么？似乎是门武功啊。", 0, 1)
end
OEVENTLUA[1907] = function ()
	Cls()
	say("我，我不是乞丐。", 38, 0, "石破天")
	say("......", 0, 1)

	JY.Person[38].好感度 = 51
end
OEVENTLUA[1908] = function ()
	Cls()
	meet_self(42)
	meet_self(41)
	say("今天天气有些冷啊，两位大哥，借你们火烤烤啊！", 0, 1)
	say("......", 41, 0)
	say("两位大哥喝的什么酒啊？", 0, 1)
	say("哦？你敢喝我们这酒？", 42, 0)
	say("酒嘛，有啥不敢喝的？", 0, 1)
	dark()
	light()

	if JY.Person[0].内力最大值 >= 3000 then
		AddPersonAttrib(0, "内力最大值", 100)
		say("好酒，冰火两重天啊！", 0, 1)
		say("......", 41, 0)
		say(JY.Person[0].称呼 .. "内功不错啊，看你举止光明磊落，这壶酒就送你了。", 41, 0)
		say("多谢，多谢！", 0, 1)
		addthing(203)
	else
		say("啊，这是什么酒？你们在酒里下了毒？", 0, 1)
		AddPersonAttrib(0, "内力最大值", -500)
		say("蠢货。", 42, 0)

		JY.Person[0].中毒程度 = 80
	end

	if inteam(38) then
		say("多谢多谢，我这有些烧饼，两位大哥吃一点吧。", 38, 0)
		say("你这小子不错啊，怎么称呼？", 41, 1)
		say("我叫狗杂种。", 38, 0)
		say("......", 41, 1)
		say("你这名字？", 42, 0)
		say("这是我娘给我取的。", 38, 1)
		say("我记得年前的调查说熊耳山有个梅芳姑，偷了个石帮主的孩子就取名叫狗杂种的。", 41, 0)
		say("我就住在熊耳山的。", 38, 1)
		say("......", 41, 0)
		say("小兄弟，你有空去中州密洞看看，或许有所发现。", 42, 1)
		say("发现什么？难道你们说的被偷的孩子就是我？", 38, 0)
		say("我们只是有这消息，事关重大，还是需要你自己查一下的。", 41, 1)
		say("哦。", 38, 0)
		say("你内功还不错，这壶酒就送你了。", 41, 1)
		say("谢谢大哥。", 38, 0)
		AddPersonAttrib(38, "内力最大值", 500)
	end

	say("我们走吧。", 41, 1)
	say("走，十步杀一人，千里不留行，哈哈哈。", 42, 0)
	null(103, 29)
	null(103, 30)
	null(127, 0)
	null(127, 1)
end
OEVENTLUA[1919] = function ()
	say("唉，帮主这病……", 85, 0)
	Cls()
end
OEVENTLUA[1920] = function ()
	if has_thing(203) or PersonKF(0, 85) or PersonKF(0, 64) or PersonKF(0, 65) or PersonKF(0, 66) then
		say("小兄弟还没有好啊！", 0, 1)
		say("这伤那有这么好治的。", 85, 0)
		say("我看看。", 0, 1)
		dark()
		light()
		say("好了。", 0, 1)
		say("有什么难的。", 0, 1)

		if has_thing(203) then
			addthing(203, -1)
		end

		instruct_17(94, 2, 37, 19, 0)
		instruct_3(-2, 3, 1, 0, 0, 0, 0, 5152, 5152, 5152, -2, -2, -2)
		instruct_1(1403, 38, 0)
		instruct_0()
		instruct_1(1404, 85, 0)
		instruct_0()
		instruct_1(1405, 38, 0)
		instruct_0()
		instruct_1(150, 85, 0)
		instruct_0()
		instruct_1(150, 0, 1)
		instruct_0()
		instruct_1(1406, 38, 0)
		instruct_0()
		instruct_1(1407, 0, 1)
		instruct_0()
		instruct_1(1408, 85, 0)
		instruct_0()
		say("贝先生，不好了，关东四大门派前来本帮闹事。", 1133, 0, "长乐帮众")
		instruct_0()
		instruct_1(1410, 85, 0)
		instruct_0()
		instruct_1(1411, 38, 0)
		instruct_0()
		instruct_14()
		null(-2, 9)
		instruct_3(-2, 4, 1, 0, 0, 0, 0, 7070, 7070, 7070, -2, -2, -2)
		instruct_3(-2, 5, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
		instruct_3(-2, 6, 0, 0, 0, 0, 0, 5416, 5416, 5416, -2, -2, -2)
		instruct_3(-2, 7, 0, 0, 0, 0, 0, 5222, 5222, 5222, -2, -2, -2)
		instruct_3(-2, 8, 0, 0, 0, 0, 0, 5402, 5402, 5402, -2, -2, -2)
		instruct_19(24, 29)
		instruct_40(3)
		instruct_25(24, 29, 24, 29)
		instruct_0()
		instruct_13()
		meet_self(594)
		meet_self(595)
		meet_self(596)
		meet_self(597)
		say("贵帮司徒帮主，和我们可说是过命的交情。这颗千年人参，是送给司徒大哥的。", 1131, 0, "范一飞")
		instruct_0()
		say("＜怎么另外还有一位司徒帮主？＞", 0, 1)
		instruct_0()
		instruct_1(1414, 85, 0)
		instruct_0()
		say("我们听一位好朋友说道，司徒大哥是……是……是遭长乐帮奸人所害，死的不明不白。这帮主之位，落到了一个年轻后生身上，我们今日来，就是要为司徒帮主讨个公道！", 1130, 0, "吕正平")
		instruct_0()
		say("＜长乐帮的事，我最好还是不要插手……＞", 0, 1)
		instruct_0()
		say("这位想必就是新任帮主了吧？" .. JY.Person[0].称呼 .. "，说，你们把司徒大哥怎么了？", 1112, 0, "高三娘")
		instruct_0()
		instruct_1(1418, 0, 1)
		instruct_0()
		say("对，你不是长乐帮帮主，真正的帮主是司徒大哥，" .. JY.Person[0].称呼 .. "，我们今日要为司徒大哥讨个公道，拿命来吧！", 1137, 0, "风良")
		instruct_0()
		say("等等，我不是", 0, 1)
		instruct_0()

		if instruct_6(167, 4, 0, 0) == false then
			instruct_15(0)

			do return end

			instruct_0()
		end

		instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_0()
		instruct_13()
		instruct_2(16, 1)
		instruct_0()
		instruct_1(1421, 85, 0)
		instruct_0()
		instruct_1(1422, 0, 1)
		instruct_0()
		instruct_1(1423, 85, 0)
		instruct_0()
		instruct_1(1424, 0, 1)
		instruct_0()
		instruct_1(1425, 85, 0)
		instruct_0()
		instruct_1(1426, 0, 1)
		instruct_0()
		instruct_1(1427, 85, 0)
		instruct_0()
		instruct_1(1428, 0, 1)
		instruct_0()
		instruct_1(1429, 85, 0)
		instruct_0()
		instruct_1(1430, 0, 1)
		instruct_0()
		instruct_1(1431, 85, 0)
		instruct_0()
		instruct_1(1432, 0, 1)
		instruct_0()
		instruct_1(1433, 85, 0)
		instruct_0()
		say("＜哼，说来说去，还不是要这姓石的去送死＞可是，我看石帮主似乎并不知道自己是帮主……", 0, 1)
		instruct_0()
		instruct_1(1435, 85, 0)
		instruct_0()
		say("＜我看这姓贝的心里一定有鬼……＞", 0, 1)
		instruct_0()
		say("啊，不好了——", 261, 0, "丁珰")
		instruct_0()
		instruct_1(1438, 85, 0)
		instruct_0()
		instruct_14()
		instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(-2, 11, 1, 0, 0, 0, 0, 6376, 6376, 6376, -2, -2, -2)
		instruct_3(94, 9, 1, 0, 0, 0, 0, 7070, 7070, 7070, -2, -2, -2)
		instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_19(35, 21)
		instruct_25(35, 21, 35, 21)
		instruct_40(0)
		instruct_0()
		instruct_13()
		instruct_1(1439, 85, 0)
		instruct_0()
		say("你是谁？", 0, 1)
		say("哎呀，都什么时候了，你还管这些。天哥被雪山派的白万剑抓走了，快去救他！", 261, 0, "丁珰")
		instruct_0()
		instruct_1(1442, 85, 0)
		instruct_0()
		say("那还等什么，我们赶紧去踏平雪山派，把天哥救出来！", 261, 0, "丁珰")
		instruct_0()
		instruct_1(1444, 0, 1)
		instruct_0()
		say("要救人，当然要杀人！你怎么这么婆婆妈妈，我们快走吧！", 261, 0, "丁珰")
		instruct_0()

		if JYMsgBox("请选择", "我应该去灭了雪山派么？", {
			"去",
			"不去"
		}, 2, 1115) == 1 then
			say("＜帮人帮到底，先去将人救出来再说。", 0, 1)
			instruct_0()
			say("贝先生、贝先生……", 1133, 0, "长乐帮众")
			instruct_0()
			instruct_1(1449, 85, 0)
			instruct_0()
			say("贝先生，我们找到帮主的下落了。", 1133, 0, "长乐帮众")
			instruct_0()
			instruct_1(1451, 85, 0)
			instruct_0()
			say("我们在丽春院看到了帮主了。", 1133, 0, "长乐帮众")
			instruct_0()
			instruct_1(1453, 0, 1)
			instruct_0()
			instruct_1(1454, 85, 0)
			instruct_0()
			say("看清楚了，千真万确，我们绝不会看错的。", 1133, 0, "长乐帮众")
			instruct_0()
			instruct_1(1456, 85, 0)
			instruct_0()
			say("刚才明明看见白万剑抓走天哥的。不过，丽春院倒是很像天哥去的地方……", 261, 0, "丁珰")
			instruct_0()
			instruct_1(1458, 0, 1)
			instruct_0()
			say("如此最好，那就拜托" .. JY.Person[0].称呼 .. "了。", 85, 0)
			instruct_0()
			say("丽春院……我还是在暗处跟着好了……", 261, 0, "丁珰")
			instruct_0()
			instruct_14()
			null(-2, 11)
			instruct_3(69, 9, 1, 0, 1921, 0, 0, -2, -2, -2, -2, -2, -2)
			instruct_3(69, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(69, 48, 0, 0, 0, 0, 0, 9232, 9232, 9232, -2, -2, -2)
			instruct_3(69, 49, 0, 0, 0, 0, 0, 5150, 5150, 5150, -2, -2, -2)
			instruct_3(69, 50, 0, 0, 0, 0, 0, 5144, 5144, 5144, -2, -2, -2)
			instruct_3(69, 47, 0, 0, 0, 0, 1961, 0, 0, 0, -2, -2, -2)
			instruct_0()
			instruct_13()

			return
		else
			instruct_37(1)
			instruct_1(1461, 0, 1)
			instruct_0()
			say("贝先生、贝先生……", 1133, 0, "长乐帮众")
			instruct_0()
			instruct_1(1463, 85, 0)
			instruct_0()
			say("我们刚才一直跟踪雪山派的白万剑，看到他遇到了摩天居士，打起来了。", 1133, 0, "长乐帮众")
			say("后来怎么样了？", 85, 1)
			say("雪山派的边打边逃，我看他们往荆州北部密林方向去了。", 1133, 0, "长乐帮众")
			say("哎呀，这怎么办？我去找我三爷爷四爷爷帮忙。", 261, 1, "丁珰")
			instruct_0()
			instruct_14()
			instruct_3(-2, 11, 1, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			instruct_3(-2, 9, 1, 0, 1921, 0, 0, -2, -2, -2, -2, -2, -2)
			addevent(41, 33, 0, 1922, 3, -2)
			addevent(41, 31, 1, 1922, 1, 10104)
			addevent(41, 32, 1, 1922, 1, 10370)
			instruct_0()
			instruct_13()
			say("我这里暂时走不开，还要麻烦" .. JY.Person[0].称呼 .. "帮我们寻找帮主。我们长乐帮会加强人手，搜寻帮主下落。", 85, 0)
			instruct_0()
			instruct_1(1468, 0, 1)
			instruct_0()
			say("如此最好，那就拜托" .. JY.Person[0].称呼 .. "了。", 85, 0)
			instruct_0()

			return
		end

		return
	else
		say("唉，帮主这病……", 85, 0)
	end
end
OEVENTLUA[1921] = function ()
	say("那就拜托" .. JY.Person[0].称呼 .. "了*。", 85, 0)
	Cls()
end
OEVENTLUA[1922] = function ()
	Cls()
	dark()
	null(-2, 33)
	light()
	say("铁老大，我知道你消息灵通，你帮我查一下狗杂种的去处，我可以让出琼州边海的海运贸易。", 520, 0, "梅芳姑")
	say("狗杂种？就是你从石清夫妇那儿偷回来的那个孩子？你不会吧，真上感情了，还去找他？", 1274, 1, "铁老大")
	say("这你管不着，你帮我找到人就行。", 520, 0, "梅芳姑")
	say("好说好说，嗯？什么人？", 1274, 1, "铁老大")
	say("我？我是路过的。", 0, 0)
	say("找到人立刻将消息送到熊耳山来，这个人你处理了吧。", 520, 1, "梅芳姑")
	null(-2, 31)
	say("来人啊。", 1274, 1, "铁老大")
	say("你要处理我？", 0, 1)
	instruct_30(27, 61, 22, 61)

	if WarMain(340, 0, 1, 1) == false then
		instruct_15()
		Cls()

		return
	end

	null(-2, 32)
	say("来惹我？我不惹你就算好了。", 0, 1)

	if inteam(38) then
		say("刚才那是我娘。", 38, 0)
		say("那你怎么还躲着不出去？", 0, 1)
		say("刚才他们说的，我是石帮主的孩子，我是她偷来的。", 38, 0)
		say("......", 0, 1)
		say("那咱们去找石帮主吗？", 0, 1)
		say("我不知道，......，他们会不会不认我？", 38, 0)
	end

	instruct_3(94, 9, 1, 0, 1923, 0, 0, -2, -2, -2, -2, -2, -2)
end
OEVENTLUA[1923] = function ()
	Cls()
	say("我们得到消息，雪山派的史婆婆和白万剑带着我们帮主出海了，还请少侠相助。", 85, 0)
	instruct_3(97, 8, 0, 0, 0, 0, 0, 7072, 7072, 7072, -2, -2, -2)
	instruct_3(97, 7, 0, 0, 0, 0, 0, 7072, 7072, 7072, -2, -2, -2)
	instruct_3(97, 9, 0, 0, 0, 0, 0, 6376, 6376, 6376, -2, -2, -2)
	instruct_3(97, 2, 0, 0, 0, 0, 0, 5272, 5272, 5272, -2, -2, -2)
	instruct_3(97, 3, 0, 0, 0, 0, 0, 5264, 5264, 5264, -2, -2, -2)
	instruct_3(97, 4, 0, 0, 0, 0, 0, 5264, 5264, 5264, -2, -2, -2)
	instruct_3(97, 5, 0, 0, 0, 0, 0, 5264, 5264, 5264, -2, -2, -2)
	instruct_3(97, 6, 0, 0, 0, 0, 0, 5152, 5152, 5152, -2, -2, -2)
	instruct_3(97, 0, 0, 0, 0, 0, 1926, 0, 0, 0, -2, -2, -2)
end
OEVENTLUA[1926] = function ()
	instruct_14()
	instruct_26(61, 19, 1, 0, 0)
	instruct_26(61, 18, 1, 0, 0)
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_13()
	instruct_25(47, 36, 25, 31)
	say("爷爷，四爷爷，你们快宰了这姓白的。", 261, 0, "丁珰")
	say("哼，你们以二敌一，算什么好汉。", 43, 1)
	Cls()
	say("嘿嘿，我丁不三本来就不是什么好汉。你听好了，我是和你单打独斗，老四也是和你单打独斗，我们可不是以二敌一。", 162, 0)
	Cls()
	say("我叫他下去，他不肯。他叫我停手，我也不听他的。我们俩同时和你单打独斗！", 163, 1)
	Cls()
	say("岂有此理！", 43, 0)
	Cls()
	say("你们别打了，白师父是好人。", 38, 1)
	Cls()
	say("住手！", 0, 0)
	Cls()
	instruct_25(25, 31, 47, 36)
	instruct_30(47, 36, 26, 36)
	instruct_40(0)
	Cls()
	say("你们两个真是为老不尊，明明两人欺负一个，还恬不知耻！", 0, 0)
	Cls()
	say("老四，我耳朵没毛病吧。", 162, 1)
	Cls()
	say("气死我了！气死我了！", 163, 3)
	Cls()
	say("不就是二打一么，冲着我来吧。", 0, 0)
	Cls()
	say("嘿嘿，老四，这" .. JY.Person[0].称呼 .. "吹牛的本事比你还强。", 162, 1)
	Cls()
	say("气死我了！气死我了！拿命来！", 163, 3)
	Cls()

	if WarMain(168, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	Cls()
	instruct_13()
	say("……你……我今天没吃饱，你等着……", 163, 0)
	Cls()
	say("丁珰，我们走。", 162, 1)
	Cls()
	say("你——哼！天哥……", 261, 0, "丁珰")
	instruct_37(2)
	Cls()
	instruct_14()
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_19(25, 31)
	instruct_40(2)
	Cls()
	instruct_13()
	say("多谢" .. JY.Person[0].称呼 .. "救命之恩。", 43, 0)
	Cls()
	say("白大侠不必这么客气。在下还有一事相求。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "请讲。", 43, 0)
	Cls()
	say("这个石……石帮主是我朋友……", 0, 1)
	Cls()
	say("既是" .. JY.Person[0].称呼 .. "开口，今日暂且放过这小贼，改日再落到我手里，哼！告辞！", 43, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_19(25, 28)
	instruct_40(0)
	Cls()
	instruct_13()

	if JY.Person[0].性别 == 0 then
		say("大哥哥，谢谢你了。", 38, 0)
	else
		say("大姐姐，谢谢你了。", 38, 0)
	end

	Cls()
	say("你和雪山派到底有什么仇啊？", 0, 1)
	Cls()
	say("我也不知道，他们说我是雪山派的叛徒，可是我自己也不知道是怎么回事。", 38, 0)
	Cls()
	say("…………", 0, 1)
	Cls()
	say("那个白师父是好人，他可能是认错人了。我要回长乐帮了。", 38, 0)
	Cls()
	say("你知道自己是长乐帮帮主？", 0, 1)
	Cls()
	say("我也不知道，好多事情我都不知道，是他们告诉我的。贝先生是好人，他还给我治病呢。他说让我去帮他们接个什么铜牌子，不然他们都会死的。所以我必须要回去了。", 38, 0)
	Cls()
	say("唉，你还真是好人啊。", 0, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(94, 15, 0, 0, 0, 0, 1927, 0, 0, 0, -2, -2, -2)
	instruct_3(94, 16, 1, 0, 1928, 0, 0, 5152, 5152, 5152, -2, -2, -2)
	instruct_3(94, 17, 0, 0, 0, 0, 0, 5144, 5144, 5144, -2, -2, -2)
	instruct_3(94, 18, 0, 0, 0, 0, 0, 5150, 5150, 5150, -2, -2, -2)
	instruct_3(94, 2, 1, 0, 1929, 0, 0, 7070, 7070, 7070, -2, -2, -2)
	instruct_3(94, 9, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(39, 9, 1, 0, 1931, 0, 0, 5274, 5274, 5274, -2, -2, -2)
	Cls()
	instruct_13()
	AddPersonAttrib(0, "声望", 1)
end
OEVENTLUA[1927] = function ()
	Cls()
	instruct_25(23, 27, 24, 19)
	say("既然如此，我们在侠客岛恭候石帮主大驾。", 41, 0)
	Cls()
	say("我们告辞了。", 42, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_19(23, 27)
	Cls()
	instruct_13()
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
end
OEVENTLUA[1928] = function ()
	say("石兄弟，你终于接了这赏善*罚恶令啦。", 0, 1)
	Cls()
	say("是啊。那两个使者不是坏人*，他们还请我喝酒呢，还说*让我去侠客岛喝什么粥。", 38, 0)
	Cls()
	say("那你现在有什么打算？", 0, 1)
	Cls()
	say("我会按照张三和李四两位哥*哥说的，按时去侠客岛喝他*们的粥。不过我现在有些担*心雪山派的白师父，他好像*也在为赏善罚恶令的事情烦*恼呢。", 38, 0)
	Cls()
	say("＜这侠客岛如此神秘，说不*定就有天书的消息，我是不*是也应该想办法去侠客岛呢*？＞", 0, 1)
	Cls()
	instruct_3(-2, -2, 1, 0, 1930, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(39, 10, 0, 0, 0, 0, 0, 5144, 5144, 5144, -2, -2, -2)
	instruct_3(39, 11, 0, 0, 0, 0, 0, 5150, 5150, 5150, -2, -2, -2)
	instruct_3(39, 13, 0, 0, 0, 0, 1931, 0, 0, 0, -2, -2, -2)
	instruct_3(39, 12, 0, 0, 0, 0, 1931, 0, 0, 0, -2, -2, -2)
end
OEVENTLUA[1929] = function ()
	Cls()

	if inteam(38) and has_thing(191) == false and JY.Person[0].医疗能力 >= 40 then
		say("贝大夫，听说你的医术不错，我对医术略有研究，不知可否借阅一下你的医术典籍？", 0, 1)
		say("医书？好说，你拿去吧。", 85, 0)
		addthing(191)

		return
	end

	say("＜这小子接下了赏善罚恶令，哈哈，我终于可以放心啦……＞", 85, 0)
end
OEVENTLUA[1930] = function ()
	say("不知道雪山派的白师父现在*怎么样了……", 38, 0)
	Cls()
end
OEVENTLUA[1931] = function ()
	instruct_26(61, 19, 1, 0, 0)
	instruct_26(61, 18, 1, 0, 0)
	instruct_25(28, 24, 28, 17)
	Cls()
	say("侠客岛赏善罚恶使者，前来拜见雪山派掌门！", 41, 0)
	Cls()
	say("尊驾二位便是侠客岛的赏善罚恶使者吗？", 43, 1)
	Cls()
	say("正是。不知哪位是雪山派掌门人？我们奉侠客岛岛主之命，手持铜牌前来，邀请贵派掌门赴敝岛相叙，喝碗腊八粥。", 42, 0)
	Cls()
	instruct_25(28, 17, 28, 24)
	say("＜凭我过人的直觉，这侠客岛上一定有天书的线索，不是有本书与\"侠\"字有关联吗？＞", 0, 1)
	Cls()
	instruct_30(28, 24, 28, 19)
	say("二位使者，我可以去侠客岛么？", 0, 1)
	Cls()
	say("恐怕不行，侠客岛所邀请的是各门派的掌门及对武学有特殊见解的武林高手。", 42, 0)
	Cls()
	say("白大侠，你的掌门之位可不可以让给我？", 0, 1)
	Cls()
	say("这位" .. JY.Person[0].称呼 .. "，白某再次谢过你的救命之恩。不过白某乃是雪山派掌门，断无让与旁人之理。", 43, 0)
	Cls()
	say("这样吧，咱俩比试一场，看看谁更有资格去。", 0, 1)
	Cls()

	if WarMain(59, 0) == false then
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_13()
	say("前辈 ，承让了！", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "武功高强，白某佩服，看来我是无脸去喝这腊八粥了。", 43, 0)
	Cls()
	say("好！这位" .. JY.Person[0].称呼 .. "，十二月初八，请到侠客岛喝碗腊八粥。", 41, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 1, 0, 1933, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 9, 1, 0, 1932, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 8, 1, 0, 1933, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 7, 1, 0, 1933, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 6, 1, 0, 1933, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(94, 16, 1, 0, 1936, 0, 0, -2, -2, -2, -2, -2, -2)
	Cls()
	instruct_13()
	instruct_2(198, 1)
	instruct_39(74)
	Cls()
	instruct_37(1)
	AddPersonAttrib(0, "声望", 1)
end
OEVENTLUA[1932] = function ()
	say("多谢" .. JY.Person[0].称呼 .. "在紫烟岛上相助之恩，不过，石中玉这小子，我早晚要把他抓回来！！", 43, 0)
	Cls()
end
OEVENTLUA[1933] = function ()
	say("这赏善罚恶令，武林众人唯*恐避之不及，" .. JY.Person[0].称呼 .. "居然抢着*去，佩服佩服。", 204, 0, "雪山弟子")
	Cls()
end
OEVENTLUA[1936] = function ()
	if JY.Person[0].性别 == 0 then
		say("大哥，雪山派的白师父怎么样了？", 38, 0)
	else
		say("女侠，雪山派的白师父怎么样了？", 38, 0)
	end

	Cls()
	say("他很好啊，原本应该发给他的铜牌现在已经发给我了……", 0, 1)
	Cls()
	say("那我们一起去侠客岛吧。", 38, 0)
	Cls()

	if instruct_9() then
		instruct_37(1)
		say("好啊。", 0, 1)
		Cls()

		if instruct_20() == false then
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()
			instruct_13()
			instruct_10(38)

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 38, 0)
		Cls()
		instruct_14()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 16, 1, 0, 2203, 0, 0, 6410, 6410, 6410, -2, -2, -2)
		instruct_3(70, 58, 1, 0, 2203, 0, 0, 6412, 6412, 6412, -2, -2, -2)
		Cls()
		instruct_13()

		return
	end

	say("我还有事，你在这里等我吧。", 0, 1)
	Cls()
	instruct_3(-2, -2, 1, 0, 1937, 0, 0, -2, -2, -2, -2, -2, -2)
end
OEVENTLUA[1937] = function ()
	say("那我们一起去侠客岛吧。", 38, 0)
	Cls()

	if instruct_9() then
		instruct_37(1)
		say("好啊。", 0, 1)
		Cls()

		if instruct_20() == false then
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()
			instruct_13()
			instruct_10(38)

			return
		end

		say("你的队伍已满，我就直接去*小村吧。", 38, 0)
		Cls()
		instruct_14()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 16, 1, 0, 2203, 0, 0, 6410, 6410, 6410, -2, -2, -2)
		instruct_3(70, 58, 1, 0, 2203, 0, 0, 6412, 6412, 6412, -2, -2, -2)
		Cls()
		instruct_13()

		return
	end

	say("我还有事，*你在这里等我吧。", 0, 1)
	Cls()
	Cls()
end
OEVENTLUA[1938] = function ()
	Cls()
	say("侠客岛只招待受邀之人，" .. JY.Person[0].称呼 .. "若无赏善罚恶令，还是请回吧！", 1127, 0)

	if has_thing(198) == true then
		instruct_32(198, -1)
		say(JY.Person[0].称呼 .. "请往里面走，岛主已恭候多时了。", 1127, 0)
		Cls()
		instruct_14()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 21, 1, 0, 1939, 0, 0, 5146, 5146, 5146, -2, 30, 50)
		Cls()
		instruct_13()

		return
	end
end
OEVENTLUA[1939] = function ()
	say(JY.Person[0].称呼 .. "请往里面走，岛主已恭候多时了。", 1127, 0)
	Cls()
end
OEVENTLUA[1940] = function ()
	Cls()
	say("在下和木兄弟僻处荒岛，今日得见高贤，大感荣宠．只是荒岛之上，诸物简陋，款待未周，还请见谅。", 39, 0)
	say(JY.Person[0].称呼 .. "远道而来，请饮一碗腊八粥。", 40, 1)
	dark()
	light()
	AddPersonAttrib(0, "内力最大值", 50)
	meet_self(39)
	meet_self(40)
	Cls()
	say("在下心中有个疑问，想请教前辈？", 0, 1)
	Cls()
	say("但说无妨。", 40, 0)
	Cls()
	say("不知两位岛主为何花下偌大心机，将各大掌门召来，并将之杀害。", 0, 1)
	Cls()

	if JY.Person[0].性别 == 0 then
		say("公子此言差矣！道路传言，焉能尽信。", 39, 0)
	else
		say("女侠此言差矣！道路传言，焉能尽信。", 39, 0)
	end

	Cls()
	say("依岛主之言，这些武林高手，一个都没有死？", 0, 1)
	Cls()
	say("凡人皆有寿数天年，大限既届，若非大罗金仙，焉得不死？侠客岛并无杀害任何一人。", 40, 0)
	Cls()
	say("那这些人为何都消失了？", 0, 1)
	Cls()
	say("此事且听我们慢慢道来。大约三十年前，我和木兄弟订交，意气相投，本想联手江湖，在武林中赏善罚恶，好好做一番事业。不意甫出江湖，便发现了一张地图。从那图旁所注的小字中细加参详，得悉图中所绘的无名荒岛之上，藏有一份惊天动地的武功秘诀。", 39, 0)
	Cls()
	say("那座无名荒岛就是这侠客岛吧。", 0, 1)
	Cls()

	if JY.Person[0].性别 == 0 then
		say("公子说的不错。地图上这座无名荒岛，便是眼前所在之侠客岛了。我们依着图中所示，在岛上寻找了十八天，终于找到了武功秘诀的所在。原来那是一首古诗的图解，含义极是深奥繁复。我二人大喜之下，即按图解修习。但我俩修习数月后，忽然对这图解中所示武功产生了歧见。我说该当如此练，木兄却说我想法错了，须得那样练。也许我二人资质太差，而图解中所示的功夫又太深奥，以至专研了几个月，仍是疑难不解。后来我和木兄弟详行计议，看来若要通解全图，非集思广义不可。常言道的好：三个臭皮匠，抵个诸葛亮。咱们何不广邀天下奇材异能之士同来岛上各竭心思，一齐参研。恰好其时岛上的\"断肠蚀骨腐心草\"开花，此草若再配以其他佐使之药熬成热粥，服后于我辈练武之士大有裨益，于是我二人派出使者，邀请当世名门大派掌门人，各教教主，各帮帮主，来到敝岛喝碗腊八粥。喝过粥后再请他们去参研图解。", 39, 0)
	else
		say("女侠说的不错。地图上这座无名荒岛，便是眼前所在之侠客岛了。我们依着图中所示，在岛上寻找了十八天，终于找到了武功秘诀的所在。原来那是一首古诗的图解，含义极是深奥繁复。我二人大喜之下，即按图解修习。但我俩修习数月后，忽然对这图解中所示武功产生了歧见。我说该当如此练，木兄却说我想法错了，须得那样练。也许我二人资质太差，而图解中所示的功夫又太深奥，以至专研了几个月，仍是疑难不解。后来我和木兄弟详行计议，看来若要通解全图，非集思广义不可。常言道的好：三个臭皮匠，抵个诸葛亮。咱们何不广邀天下奇材异能之士同来岛上各竭心思，一齐参研。恰好其时岛上的\"断肠蚀骨腐心草\"开花，此草若再配以其他佐使之药熬成热粥，服后于我辈练武之士大有裨益，于是我二人派出使者，邀请当世名门大派掌门人，各教教主，各帮帮主，来到敝岛喝碗腊八粥。喝过粥后再请他们去参研图解。", 39, 0)
	end

	Cls()
	say("如此说来，你们邀人来喝腊八粥，纯是一番好意了。", 0, 1)
	Cls()
	say("是的。而且我们并无禁止任何人离去，而是每位武林之士皆沉迷于此图解的专研。但可惜的是，到如今大家还是没有完全领悟出此古诗图解。唉！我们虽找了许多饱读诗书的贤士来此，但也无法解开这古诗之谜。现在就请" .. JY.Person[0].称呼 .. "入洞内参研，或许天从因缘，破解此诗的福份就落在" .. JY.Person[0].称呼 .. "身上。若" .. JY.Person[0].称呼 .. "想离去，也可自行离去。", 40, 0)
	Cls()
	instruct_3(-2, 2, -2, 0, 1941, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 22, -2, 0, 1942, 0, 0, -2, -2, -2, -2, -2, -2)
end
OEVENTLUA[1941] = function ()
	say("请" .. JY.Person[0].称呼 .. "入洞内参研，若" .. JY.Person[0].称呼 .. "*想离去，也可自行离去。", 39, 0)
	Cls()
end
OEVENTLUA[1942] = function ()
	say("可惜神功至今仍无人可解。", 40, 0)
	Cls()
end
OEVENTLUA[1943] = function ()
	return
end
OEVENTLUA[1944] = function ()
	Cls()

	if instruct_60(74, 9, 5354) then
		say("你看看这一条的注解：“吴钩者，吴王阖庐之宝刀也。”为什么……", 366, 0)
	end

	if instruct_16(38) then
		if JY.Person[0].性别 == 0 then
			say("大哥，我的“巨骨穴”好热……", 38, 1)
		else
			say("女侠，我的“巨骨穴”好热……", 38, 1)
		end

		instruct_3(74, 10, 1, 0, 1945, 0, 0, -2, -2, -2, -2, -2, -2)
	elseif JY.Person[0].悟性 <= 30 and JY.Person[0].儒学修为 <= 20 then
		say("墙上这些梵文字我一个也不认识，不过看起来好像一把把刀形成的漩涡转来转去，咿？我的内气？怎么觉得“巨骨穴”好热……", 0, 0)
		instruct_3(-2, -2, 1, 0, 1945, 0, 0, -2, -2, -2, -2, -2, -2)
	end

	if JY.Person[0].耍刀技巧 == 299 then
		say("这字？怎么看像刀法？", 0, 1)
		say("你使劲的看，你只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(3, 3)

		JY.Person[0].耍刀技巧 = 300
	end
end
OEVENTLUA[1945] = function ()
	Cls()

	if instruct_60(74, 10, 5376) then
		say("我觉得这句“银鞍照白马”和“飒沓如流星”连在一起方为正解……", 1143, 0)
	end

	if instruct_16(38) then
		if JY.Person[0].性别 == 0 then
			say("大哥，这马下的云气，好像一团团云雾在不断的向前推涌……", 38, 1)
		else
			say("女侠，这马下的云气，好像一团团云雾在不断的向前推涌……", 38, 1)
		end

		instruct_3(74, 3, 1, 0, 1946, 0, 0, -2, -2, -2, -2, -2, -2)
		instruct_3(74, 4, 1, 0, 1946, 0, 0, -2, -2, -2, -2, -2, -2)
	elseif JY.Person[0].悟性 <= 30 and JY.Person[0].儒学修为 <= 20 then
		say("墙上这些画，好像马下的云气，好像一团团云雾在不断的向前推涌……", 0, 0)
		instruct_3(74, 3, 1, 0, 1946, 0, 0, -2, -2, -2, -2, -2, -2)
		instruct_3(74, 4, 1, 0, 1946, 0, 0, -2, -2, -2, -2, -2, -2)
	end

	if JY.Person[0].拳掌功夫 == 299 then
		say("墙上这些画？好像马下的云气，好像一团团云雾在不断的向前推涌……，你再仔细观瞧，却又分明是一个个大拳头。", 0, 1)
		say("你使劲的看，只感觉以前的关隘豁然开朗。", 0, 2)
		say("你对拳法的理解加深了。", 0, 2)
		write_nump(1, 3)

		JY.Person[0].拳掌功夫 = 300
	end
end
OEVENTLUA[1946] = function ()
	Cls()

	if instruct_60(74, 3, 5368) then
		say("银光灿烂，鞍自平稳。天马行空，瞬息万里……原来天马是手，并非真的是马。", 1029, 0)
		say("这壁上的注解说道：白居易诗云“勿轻直折剑，犹胜曲全勾”。可见我这直折之剑，方合石壁注文原意。", 509, 0)
		say("不对，“吴钩霜雪明”是主，“犹胜曲全钩”是宾。喧宾夺主，必非正道。", 1029, 0)
	end

	if instruct_16(38) then
		say("＜咦！这些字的笔划看起来好像是一把把的长剑，有的剑尖朝上，有的向下，有的斜起欲飞，有的横掠欲堕。“五里穴”好热……现在跑到“曲池穴”了……自从练了木偶身上的经脉图之后，内力大盛，但从没像今日这般劲急……＞", 38, 1)
		instruct_3(74, 7, 1, 0, 1947, 0, 0, -2, -2, -2, -2, -2, -2)
	elseif JY.Person[0].悟性 <= 30 and JY.Person[0].儒学修为 <= 20 then
		say("墙上这些字的笔划看起来好像是一把把的长剑，有的剑尖朝上，有的向下，有的斜起欲飞，有的横掠欲堕。“五里穴”好热……现在跑到“曲池穴”了……", 0, 0)
		instruct_3(74, 7, 1, 0, 1947, 0, 0, -2, -2, -2, -2, -2, -2)
	end

	if JY.Person[0].御剑能力 == 299 then
		say("这字？果然似乎像剑一样。", 0, 1)
		say("你使劲的看，只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(2, 3)

		JY.Person[0].御剑能力 = 300
	end
end
OEVENTLUA[1947] = function ()
	Cls()

	if instruct_60(74, 7, 5972) then
		say("这“侠客行”的古诗图解，包含着古往今来最博大精深的武学秘奥……你瞧，这第一句“赵客缦胡缨”，其中对这个“胡”字的注解……", 1154, 0)
	end

	if instruct_16(38) then
		if JY.Person[0].性别 == 0 then
			say("大哥，这什么赵客的弯头，好像一个个钩镰在割草……", 38, 1)
		else
			say("大哥，这什么赵客的弯头，好像一个个钩镰在割草……", 38, 1)
		end

		instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(-2, 12, 1, 0, 1948, 0, 0, 5134, 5134, 5134, -2, -2, -2)
		instruct_3(-2, 13, 1, 0, 1948, 0, 0, 5138, 5138, 5138, -2, -2, -2)
		null(-2, 19)
		null(-2, 24)
	elseif JY.Person[0].悟性 <= 30 and JY.Person[0].儒学修为 <= 20 then
		say("墙上这些字的笔划看起来好像是一把把的长剑，有的剑尖朝上，有的向下，有的斜起欲飞，有的横掠欲堕。“五里穴”好热……现在跑到“曲池穴”了……", 0, 0)
		say("这些长剑左冲右突，突然往头部齐齐冲上。", 0, 2)
		say("不好~", 0, 0)
		dark()
		light()
		say("我刚才是走火入魔了？这是？", 0, 0)
		say("你回想刚才的武功", 0, 2)

		if has_thing(80) == false and PersonKF(0, 102) == false then
			JY.Person[0].武功3 = 102
			JY.Person[0].武功等级3 = 100

			DrawStrBox(-1, -1, "你领悟了太玄神功", C_ORANGE, CC.DefaultFont)
			addthing(80)
		end

		null(-2, 12)
		null(-2, 13)
		null(-2, 24)
		instruct_3(-2, 2, 1, 0, 1971, 0, 0, 5132, 5132, 5132, -2, -2, -2)
		instruct_3(-2, 19, 1, 0, 1971, 0, 0, 5152, 5152, 5152, -2, -2, -2)
		instruct_3(-2, 22, 1, 0, 1971, 0, 0, 5136, 5136, 5136, -2, -2, -2)
	end

	if JY.Person[0].特殊兵器 == 299 then
		say("这字怎么像钩一样？", 0, 1)
		say("你使劲的看，只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(4, 3)

		JY.Person[0].特殊兵器 = 300
	end
end
OEVENTLUA[1948] = function ()
	if instruct_16(38) == false then
		say("请" .. JY.Person[0].称呼 .. "入洞内参研，若" .. JY.Person[0].称呼 .. "*想离去，也可自行离去。", 39, 0)
		Cls()

		return
	end

	instruct_26(61, 19, 1, 0, 0)
	instruct_26(61, 18, 1, 0, 0)

	if JY.Person[0].性别 == 0 then
		say("大哥，这没有什么好看的，我们走了好不好……", 38, 1)
	else
		say("女侠，这没有什么好看的，我们走了好不好……", 38, 1)
	end

	Cls()
	say("贤弟，小声一点，别吵到两位岛主练功……", 0, 0)
	Cls()
	say("＜这些字怎么如此古怪，看上一眼，便会头晕？至阳穴好热，原来这些蝌蚪看似乱钻乱游，其实还是和内息有关＞", 38, 1)
	Cls()
	say("这位石兄弟双眼注目这“太玄经”，原来是位精通蝌蚪文的大方家。", 39, 0)
	Cls()
	say("小人一个字也不识，只是瞧这些小蝌蚪十分好玩，便多看了一会。", 38, 1)
	Cls()
	say("这就是了，这部“太玄经”以古蝌蚪文写成，我本来正自奇怪，石兄弟年纪轻轻，居然有此奇才，识得这种古奥文字。", 40, 0)
	Cls()
	say("＜我还是别打扰二位岛主好了……可是这蝌蚪还真好玩……咦！这些蝌蚪怎么在我身体各处跑了起来…………怎么这样地舒畅……＞", 38, 1)
	say("咦？啊啊啊~~~", 38, 1)
	Cls()
	say("不好，他走火入魔了。", 40, 0)
	say("住手，你们干什么？", 0, 0)
	Cls()

	local var_34_0 = JY.Person[38].主功体

	stop_ng(38)
	instruct_35(38, 1, 102, 300)
	star_ng(38, var_34_0)
	instruct_48(38, 300)
	instruct_46(38, 3000)
	instruct_45(38, 400)
	instruct_47(38, 400)
	instruct_43(38, 400)

	if WarMain(257, 1) == false then
		instruct_13()
		Cls()
	else
		say("这两位岛主，一个攻击高，一个防御高，好生厉害。", 0, 0)
		say("你感觉自己略有领悟", 0, 2)

		if JY.Person[0].悟性 > 50 then
			instruct_47(0, 20)
			DrawStrBoxWaitKey("你的攻击力提升了", C_ORANGE, CC.DefaultFont)
		else
			instruct_43(0, 20)
			DrawStrBoxWaitKey("你的防御力提升了", C_ORANGE, CC.DefaultFont)
		end

		instruct_13()
	end

	say("啊！好累，我怎么觉得好累。", 38, 0)
	Cls()
	say("贤弟，你总算清醒过来了。", 0, 1)
	Cls()
	say("怎么，难道我昏迷过去了吗？", 38, 0)
	Cls()
	say("是啊！原先我以为你又着魔了，后来龙岛主说你正悟出神功，我才没有去吵你，前后算起来已有三天了。", 0, 1)
	Cls()
	say("是吗？已经三天了，难怪我觉得好饿。", 38, 0)
	Cls()
	say("石兄弟，我兄弟俩闷在心中数十年的大疑团，终于得以解开，真是太感激你了。", 39, 0)
	Cls()
	say("我怎么……怎么解破的?", 38, 1)
	Cls()
	say("石兄弟何必如此谦虚？你参透了这首“侠客行”的石壁图谱，不但是现今武林中的第一人，除了当年在石壁上雕写图谱的那位前辈之外，只怕古往今来，也极少有人及得上你。", 39, 0)
	Cls()
	say("小人不敢，小人不敢。", 38, 1)
	Cls()
	say("这石壁上的蝌蚪古文，在下与木兄弟所识还不到一成，不知石兄弟肯赐予指教么？", 39, 0)
	Cls()
	say("我跟两位说了便是，我看这条蝌蚪，“中注穴”中便有跳动，再看这条蝌蚪，“太赫穴”便大跳一下…………", 38, 1)
	Cls()
	say("原来……原来……石帮主看的是一条条……那个蝌蚪，不是看一个个字……那么石帮主如何能通解全篇“太玄经”？", 40, 0)
	Cls()
	say("小人自幼没读过书，当真一字不识，惭愧的紧。", 38, 1)
	Cls()
	say("你不识字？", 40, 0)
	Cls()
	say("不识字，我……回去之后，定要去学识字，否则人人都识字，我却不识得，给人笑话，多不好意思。", 38, 1)
	Cls()
	say("你既不识字，那么这些壁上许许多多的注释，却是谁解给你听的？", 39, 0)
	Cls()
	say("没人解给我听，我……只是瞧着图形，胡思乱想，忽然之间，图上的云头或小剑什么的，就和身体内的热气连在一起了。", 38, 1)
	Cls()
	say("你不识字，却能解通图谱，这……如何能够？", 40, 0)
	Cls()
	say("难道冥冥之中真有天意？还是这位石兄弟真有天纵英才。", 39, 1)
	Cls()
	say("…………我懂了，我懂了。大哥，原来如此。", 40, 0)
	Cls()
	say("啊！是了，是了，石兄弟，幸亏你不识字，才得解破这个大疑团。唉！原来这许许多多注释文字，每一句都在导人误入歧途。可是参研图谱之人，又有那个肯不去钻研注解。", 39, 0)
	Cls()
	say("原来这篇“太玄经”也不是真的蝌蚪文，只不过……只不过是一些经脉穴道的线路方位而已。唉，三十年的光阴，三十年的光阴！", 39, 0)
	Cls()
	say("白首太玄经！兄弟，你的头发也真是雪白了。", 40, 1)
	Cls()
	say("此岛名为侠客岛，是因为我们兄弟二人在此间还发现了另一部无字奇书。我二人发下誓愿，谁能解得了这壁上图谱，便奖此书曾与谁。如今图谱已解，这本书就赠与石帮主吧。", 39, 0)
	Cls()
	say("我不识字，这本书要来也没有用。那我就把这本书送给大哥好了。", 38, 1)
	Cls()
	say("多谢石兄弟，多谢二位岛主。", 0, 1)
	Cls()
	say("兄弟，你我心愿已了，我们也该歇息了。这腊八粥之约以后也不必了。我们这就去告诉各位掌门不用再钻研此图解了。公子，你们也可赶紧离去。", 39, 0)
	Cls()
	say("前辈，告辞了。", 0, 1)
	Cls()
	instruct_2(154, 1)
	Cls()
	instruct_46(38, -3000)
	instruct_45(38, -400)
	instruct_47(38, -400)
	instruct_43(38, -400)
	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 16, 0, 0, 0, 0, 419, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 17, 0, 0, 0, 0, 419, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 18, 0, 0, 0, 0, 419, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 22, 1, 0, 1950, 0, 0, 5136, 5136, 5136, -2, -2, -2)
	instruct_3(-2, 2, 1, 0, 1949, 0, 0, 5132, 5132, 5132, -2, -2, -2)
	instruct_3(94, 2, 1, 0, 1951, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(39, 9, 1, 0, 1952, 0, 0, -2, -2, -2, -2, -2, -2)
	addevent(-2, 0, 0, 1970, 3, -2, -2, -2)
	addevent(119, 63, 1, 1953, 1, 10412, -2, -2)
	addevent(119, 64, 1, 1953, 1, 8422, -2, -2)
	Cls()
	instruct_13()
end
OEVENTLUA[1949] = function ()
	say(JY.Person[0].称呼 .. "请速速离去。", 39, 0)
	Cls()

	do return end

	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(94, 2, 1, 0, 1949, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(39, 9, 1, 0, 1950, 0, 0, -2, -2, -2, -2, -2, -2)
	addevent(-2, 0, 0, 1970, 3, -2, -2, -2)
	Cls()
end
OEVENTLUA[1950] = function ()
	say("望石兄弟日后以此神功赏善*罚恶。", 40, 0)
	Cls()

	do return end

	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(94, 2, 1, 0, 1949, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(39, 9, 1, 0, 1950, 0, 0, -2, -2, -2, -2, -2, -2)
	addevent(-2, 0, 0, 1970, 3, -2, -2, -2)
	Cls()
end
OEVENTLUA[1951] = function ()
	say("贝大夫，我们从侠客岛回来*了。", 0, 1)
	Cls()
	say("对不起，现在请叫我贝帮主。", 85, 0)
	Cls()
end
OEVENTLUA[1952] = function ()
	say("白师父，我们从侠客岛回来*了，事情是这样的……", 0, 1)
	Cls()
	say("哦，原来如此啊，恭喜" .. JY.Person[0].称呼 .. "*了。", 43, 0)
	Cls()
	Cls()
end
OEVENTLUA[1953] = function ()
	Cls()

	if instruct_16(38) then
		say("娘！爹爹！", 38, 0)
		say("你是坚儿？", 1090, 1, "闵柔")
		say("我是，娘！爹爹！我终于找到你们了。", 38, 0)
		say("坚儿，你这么些年都受苦了，爹娘对不起你。", 1090, 1, "闵柔")
		say("没有，没有，我挺好的。", 38, 0)
		say("好孩子，好孩子。", 1125, 1, "石清")
		say(JY.Person[0].称呼 .. "，我找到我爹娘了，我要和他们走了。", 38, 0)
		say("这本秘籍是我根据侠客岛领悟写出来的，留给你了。", 38, 0)
		addthing(80, 1)
		say("还有这个，是石婆婆教我的刀法。", 38, 0)
		addthing(141)
		say("好兄弟。以后我到什么地方找你？", 0, 1)
		say("我要多陪陪我爹娘，以后多半不会出来了，有缘再见吧。", 38, 0)
		say("坚儿，我们走吧。", 1125, 1, "石清")
		dark()
		instruct_21(38)
		null(70, 16)
		null(70, 58)
		null(-2, 63)
		null(-2, 64)
		light()
	else
		say(JY.Person[0].称呼 .. "，你见过我们孩子吗？", 1090, 0, "闵柔")
		say("......", 0, 1)
		say("闵儿，别担心，我们继续寻找，找个10年，20年，只要他没死，我们一定要能找到他的。", 1125, 1, "石清")
	end
end
OEVENTLUA[1961] = function ()
	Cls()
	dark()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	light()
	instruct_25(13, 7, 8, 5)
	instruct_1(1603, 41, 0)
	instruct_0()
	say("我……我……", 373, 1, "石中玉")
	instruct_0()
	say("果然是天哥，快救人！", 261, 0, "丁珰")
	instruct_0()

	if instruct_6(169, 4, 0, 0) == false then
		instruct_15(0)

		do return end

		instruct_0()
	end

	instruct_3(-2, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 49, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 6374, 6374, 6374, -2, -2, -2)
	instruct_19(8, 5)
	instruct_40(0)
	instruct_0()
	instruct_13()
	say("丁丁当当，你来啦，我想死你了。", 373, 0, "石中玉")
	instruct_0()
	say("呸，还以为你生病之后转了性，原来还是没半句正经。", 261, 1, "丁珰")
	instruct_0()
	say("生病？什么病？……", 373, 0, "石中玉")
	instruct_0()
	instruct_1(1609, 164, 0)
	instruct_0()
	instruct_14()
	instruct_3(-2, 47, 0, 0, 0, 0, 0, 9020, 9020, 9020, -2, -2, -2)
	instruct_0()
	instruct_13()
	instruct_1(1610, 164, 0)
	instruct_0()
	say("你，你，你是什么人？", 373, 1, "石中玉")
	instruct_0()
	instruct_1(1612, 164, 0)
	instruct_0()
	say("＜哇，他的内功好厉害，我还是敷衍一下算了＞", 373, 1, "石中玉")
	instruct_0()
	instruct_1(1614, 164, 0)
	instruct_0()
	say("求你？啊，啊，对，求你去灭了雪山派！", 373, 1, "石中玉")
	instruct_0()
	instruct_1(1616, 164, 0)
	instruct_0()
	say("哎？等等，我说", 0, 1)
	say("啊，怎么还抓着我啊……", 373, 0, "石中玉")
	instruct_0()
	say("天哥——", 261, 0, "丁珰")
	instruct_0()
	instruct_14()
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(39, 10, 0, 0, 0, 0, 0, 9234, 9234, 9234, -2, -2, -2)
	instruct_3(39, 18, 0, 0, 0, 0, 0, 7074, 7074, 7074, -2, -2, -2)
	instruct_3(39, 19, 0, 0, 0, 0, 0, 6374, 6374, 6374, -2, -2, -2)
	instruct_3(39, 9, 1, 0, 1963, 0, 0, 5274, 5274, 5274, -2, -2, -2)
	instruct_3(39, 11, 0, 0, 0, 0, 0, 9020, 9020, 9020, -2, -2, -2)
	instruct_3(39, 12, 0, 0, 0, 0, 1962, 0, 0, 0, -2, -2, -2)
	instruct_3(39, 13, 0, 0, 0, 0, 1962, 0, 0, 0, -2, -2, -2)
	instruct_0()
	instruct_13()
	say("这谢烟客也太雷厉风行了，我一句话还没说完呢。", 0, 1)
	instruct_0()
end
OEVENTLUA[1962] = function ()
	instruct_14()
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_13()
	instruct_25(29, 24, 29, 17)
	instruct_1(1620, 0, 1)
	instruct_0()
	say("老伯伯，你也来啦。", 38, 0)
	instruct_0()
	instruct_1(1622, 164, 0)
	instruct_0()
	instruct_1(1623, 38, 0)
	instruct_0()
	instruct_1(1624, 164, 0)
	instruct_0()
	instruct_1(1625, 38, 0)
	instruct_0()
	instruct_1(1628, 164, 0)
	instruct_0()
	instruct_0()
	instruct_14()
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_0()
	instruct_13()
	instruct_1(1630, 38, 0)
	instruct_0()
	say("＜侠客岛有书？我应该去侠客岛看看，不知道哪里还能弄到赏善罚恶令呢？＞", 0, 1)
	instruct_0()
	instruct_14()
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(94, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(94, 2, 1, 0, 1964, 0, 0, 7070, 7070, 7070, -2, -2, -2)
	instruct_19(JY.Base.人X1, JY.Base.人Y1)
	instruct_0()
	instruct_13()
end
OEVENTLUA[1963] = function ()
	say("长着同样面孔的两个小伙子*，做人的差距怎么这么大呢*？那个被谢烟客带走的，叫*石中玉，曾经是我的徒弟，*他生性顽劣，行事下流，玷*污了我的女儿，然后跑到长*乐帮去避难。他答应帮长乐*帮接赏善罚恶令，于是坐上*了长乐帮帮主的位置，胡作*非为，搅得长乐帮鸡犬不宁*。可是二使快来的时候，他*又遛到丽春院躲了起来。这*个小淫贼，让谢烟客这个大*魔头好好治治他！！", 43, 0)
	Cls()
end
OEVENTLUA[1964] = function ()
	instruct_26(61, 19, 1, 0, 0)
	instruct_26(61, 18, 1, 0, 0)
	say("贝大夫为何愁眉苦脸？", 0, 1)
	Cls()
	say("帮主不见了，二使已经来过了，唉。", 85, 0)
	Cls()
	say("莫非贝大夫接下了赏善罚恶令？", 0, 1)
	Cls()
	say("不接马上就要死，还是接了吧。", 85, 0)
	Cls()
	say("如果我替你去赴这侠客岛之约，你以为如何？", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "若愿意为我挡灾，贝海石愿效犬马之劳，今后愿听" .. JY.Person[0].称呼 .. "差遣。", 85, 0)
	Cls()
	say("哈哈哈，好！", 0, 1)
	Cls()
	instruct_2(198, 1)
	instruct_39(74)
	Cls()
	instruct_3(-2, -2, 1, 0, 1965, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(74, 0, 1, 0, 1966, 0, 0, -2, -2, -2, -2, -2, -2)

	if instruct_9() == false then
		do return end

		Cls()
	end

	say("贝大夫，跟我一起走吧。", 0, 1)
	Cls()

	if instruct_20() == false then
		say("如果你能从侠客岛回来，我就加入，绝不反悔。", 85, 0)

		return
	end
end
OEVENTLUA[1965] = function ()
	if instruct_9() == false then
		do return end

		Cls()
	end

	say("贝大夫，跟我一起走吧。", 0, 1)
	Cls()

	if has_thing(154) then
		if instruct_20() == false then
			say("好吧。", 85, 0)
			Cls()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()
			instruct_10(85)
			Cls()

			return
		end

		say("你的队伍已满，我就直接去*小村吧。", 85, 0)
		Cls()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 49, 1, 0, 2205, 0, 0, 7028, 7028, 7028, -2, -2, -2)
		Cls()
		Cls()
	else
		say("如果你能从侠客岛回来，我就加入，绝不反悔。", 85, 0)
	end
end
OEVENTLUA[1966] = function ()
	Cls()

	if has_thing(198) == true then
		instruct_32(198, -1)
		say(JY.Person[0].称呼 .. "请往里面走，岛主已恭候多时了。", 1127, 0)
		instruct_14()
		instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 2, 1, 0, 1967, 0, 0, 5132, 5132, 5132, -2, -2, -2)
		instruct_3(-2, 19, 1, 0, 1967, 0, 0, 5152, 5152, 5152, -2, -2, -2)
		instruct_3(-2, 22, 1, 0, 1967, 0, 0, 5136, 5136, 5136, -2, -2, -2)
		instruct_0()
		instruct_13()
	else
		say("你没有得到侠客岛邀请，" .. JY.Person[0].称呼 .. "还是赶快离去吧！", 1127, 0)
	end
end
OEVENTLUA[1967] = function ()
	Cls()
	say("太玄神功已被石兄弟破解，*此处没有来的必要了，" .. JY.Person[0].称呼 .. "*请回吧。", 39, 0)
	say("太玄神功？听起来很厉害的样子，能不能让我看看？", 0, 1)
	say("太玄神功乃是绝世神功，怎能随意给人。", 40, 0)
	say("那就是不给了？", 0, 1)

	if WarMain(170, 1) == false then
		instruct_15(0)

		return
	end

	instruct_3(-2, 19, 1, 0, 8303, 0, 0, 5152, 5152, 5152, -2, -2, -2)
	instruct_3(-2, 2, 1, 0, 1968, 0, 0, 5132, 5132, 5132, -2, -2, -2)
	instruct_3(-2, 22, 1, 0, 1969, 0, 0, 5136, 5136, 5136, -2, -2, -2)
	instruct_0()
	instruct_13()
	say("连侠客岛上的武功都不是" .. JY.Person[0].称呼 .. "的对手，看来这本书应该由" .. JY.Person[0].称呼 .. "来保管。", 39, 0)
	say("废话少说，快把书拿来。", 0, 1)
	addthing(154, 1)
	say("《侠客行》？，不是太玄经吗？", 0, 1)
	say("太玄神功都在我脑子里，我是不会给你的。", 38, 0)
	dark()
	instruct_3(-2, 19, 1, 0, 6533, 0, 0, 5154, 5154, 5154, -2, -2, -2)
	light()
	say("石兄弟？", 40, 0)
	say("你，你，你居然逼死了石兄弟。", 39, 0)
	say("不给就不给吧，自杀做什么？我又没说一定要要。", 0, 1)
	say("......", 40, 0)
	say("......", 39, 0)
	addevent(119, 63, 1, 1953, 1, 10412, -2, -2)
	addevent(119, 64, 1, 1953, 1, 8422, -2, -2)
end
OEVENTLUA[1968] = function ()
	Cls()
	say("......", 39, 0)
	addevent(-2, 0, 0, 1970, 3, -2, -2, -2)
end
OEVENTLUA[1969] = function ()
	Cls()
	say("难道这就是天意？太玄神功刚出世，却就此失传了。", 40, 0)
	addevent(-2, 0, 0, 1970, 3, -2, -2, -2)
end
OEVENTLUA[1970] = function ()
	null(-2, 2)
	null(-2, 19)
	null(-2, 22)
end
OEVENTLUA[1971] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，刚才你走火入魔了？", 39, 0)
	say("不错，不过吉人天相，我就此领悟了太玄经，却要谢过两位岛主。", 0, 1)
	say("想不到，想不到，我们数十年解不开的谜团，今日居然有贤才领悟了太玄神功，天意，天意啊。", 40, 0)
	say(JY.Person[0].称呼 .. "，此间事已了，我们也该走了，这本无字天书我们拿着无用，就送给你了。", 39, 0)
	addthing(154)
	say("石兄弟，我们走吧。", 40, 0)
	dark()
	null(-2, 0)
	null(-2, 2)
	null(-2, 22)
	null(-2, 19)
	null(-2, 9)
	null(-2, 10)
	null(-2, 3)
	null(-2, 4)
	null(-2, 7)
	null(-2, 8)
	null(-2, 11)
	null(-2, 28)
	null(-2, 24)
	light()
end
OEVENTLUA[2001] = function ()
	Cls()
	say("大师兄，你少喝一点，别忘了咱们的任务。", 79, 0)
	say("好好好。小师妹，我记着呢，别担心。", 35, 0)

	JY.Person[79].好感度 = 51
	JY.Person[29].佛学修为 = 1
end
OEVENTLUA[2002] = function ()
	Cls()
	instruct_14()
	instruct_13()
	instruct_25(22, 26, 24, 17)
	say("贾老二，你看旁边桌上那妞，身材要得，脸蛋更是要得。", 200, 0, "青城弟子")
	Cls()
	instruct_25(24, 17, 18, 16)
	say("＜这次青城派大举南来，有些古怪，师父叫我们来探探动静。小师妹，要沉住气，假装没听见＞", 35, 0)
	Cls()
	say("＜好，大师哥，我听你的＞", 79, 1)

	if JY.Person[0].门派 ~= 4 then
		meet_self(79)
	end

	instruct_25(18, 16, 24, 17)
	say("余兄弟，你要是喜欢，咱就想想办法，把这妞弄回去，嘿嘿嘿……", 200, 0, "青城弟子")
	Cls()
	instruct_14()
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 5900, 5900, 5900, -2, -2, -2)
	Cls()
	instruct_13()
	say("什么东西，两个不带眼的狗崽子，却到我们福州府来撒野！", 36, 0)
	meet_self(36)
	say("贾老二，你看这个小白脸眉清目秀，要上台去唱花旦，真勾引得人。", 200, 1, "青城弟子")
	Cls()
	say("这位兔儿爷，我越瞧你越不像男人，准是个大姑娘乔装改扮的。你这脸蛋儿又红又白，给我香个面孔好不好？", 200, 1, "青城弟子")
	Cls()
	say("我乃福威镖局的少镖头，你天大胆子，到太岁头上动土？", 36, 0)
	Cls()
	say("福威镖局？从来没听见过！那是干什么的？", 200, 1, "青城弟子")
	Cls()
	say("专打狗崽子的！", 36, 0)
	Cls()
	say("说的好，我来帮你！", 0, 1)
	Cls()
	instruct_25(24, 17, 18, 16)

	if JY.Person[0].门派 == 4 then
		say("小师弟怎么来了。", 35, 0)
	end

	say("小师妹，这事咱们却不能不出手了。", 35, 0)
	say("大师兄，咱们一块上。", 79, 0)

	JY.Person[35].生命最大值 = JY.Person[35].生命最大值 + JY.Base.游戏难度 * 150
	JY.Person[35].生命 = JY.Person[35].生命 + JY.Base.游戏难度 * 150
	JY.Person[35].攻击力 = JY.Person[35].攻击力 + 400

	if WarMain(203, 0) == false then
		instruct_15()
		Cls()

		return
	end

	JY.Person[35].攻击力 = JY.Person[35].攻击力 - 400
	JY.Person[35].生命最大值 = JY.Person[35].生命最大值 - JY.Base.游戏难度 * 150
	JY.Person[35].生命 = JY.Person[35].生命 - JY.Base.游戏难度 * 150

	say("哈哈哈，你这武功好生厉害，是叫做\"屁股向后平沙落雁式\"吗？", 35, 0)
	instruct_19(21, 22)

	if JY.Person[0].门派 == 4 then
		say("令狐兄好，小师姐好。", 0, 1)
		say("小师弟你好。", 35, 0)
	end

	say("你，你这兔儿爷，你竟敢杀了我家少爷，咱们这梁子算结下了，你们等着瞧吧。", 200, 0, "青城弟子")
	Cls()
	instruct_14()
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("看来对方来头不善，林兄弟还是小心为是。", 0, 1)
	Cls()
	say("我想以我家福威镖局名头并无大事。", 36, 0)
	Cls()
	say("这几个人都是四川青城派的，你杀了的似乎是青城派余观主的儿子，恐怕福威镖局会有麻烦啊。", 35, 1)
	Cls()

	if JY.Person[0].门派 == 4 then
		say("小师弟，你怎么来了。", 35, 0)
		say("我是到江湖上历练，却没想到会在这里遇到师兄师姐。", 0, 1)
		say("真是巧遇，此间事了，小师弟，你随我们回华山吗？", 35, 0)
		say("我还想多历练历练。", 0, 1)
		say("也好。", 35, 0)
	else
		say("刚才见二位剑法不凡，不知是那一派门下，怎样称呼？", 0, 1)
		Cls()
		say("在下华山令狐冲。", 35, 0)
		Cls()
		say("在下华山岳灵珊。", 79, 0)
		Cls()
		say("华山派是名门大派，今日一见果然名不虚传。", 0, 1)
	end

	say("林兄弟，我看这青城派绝不会善罢甘休，你还是回福威镖局早做准备吧。我和师妹也要回华山禀明家师。", 35, 0)
	Cls()
	say("也好，那咱们后会有期。", 36, 0)
	Cls()
	say("后会有期。", 79, 0)
	Cls()
	say("后会有期。", 0, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(128, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(128, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	addevent(128, 30, 1, 2004, 1, 5886, -2, -2)
	addevent(128, 31, 1, 6533, 1, 10196, -2, -2)
	addevent(128, 32, 1, 6533, 1, 10216, -2, -2)
	addevent(128, 33, 1, 6533, 1, 10212, -2, -2)
	addevent(128, 34, 1, 6533, 1, 10206, -2, -2)
	addevent(128, 35, 1, 6533, 1, 10204, -2, -2)

	JY.Person[35].好感度 = JY.Person[35].好感度 + 10
	JY.Person[35].佛学修为 = 1
	JY.Person[36].好感度 = JY.Person[36].好感度 + 5
	JY.Person[79].好感度 = JY.Person[79].好感度 + 5

	addevent(27, 53, 1, 2003, 1, 5704, -2, -2)
	addevent(27, 54, 1, 2003, 1, 5706, -2, -2)
	Cls()
	instruct_13()
	instruct_37(1)
end
OEVENTLUA[2003] = function ()
	Cls()

	if JY.Person[22].好感度 >= 55 then
		say("左掌门好。", 0, 1)
		say("有什么事吗？", 22, 0)

		if JY.Person[22].好感度 > 55 then
			say("有个华山派的消息，是这样...", 0, 1)
			dark()
			light()
			say("很好，你继续回去潜伏，我不会亏待你的。", 22, 0)
			addthing(174, 500)

			JY.Person[22].好感度 = JY.Person[22].好感度 - 1
		else
			say("没事没事，我来看看掌门。", 0, 1)
		end
	elseif JY.Person[22].好感度 == 50 then
		say(JY.Person[0].称呼 .. "，年纪轻轻，居然可以打败我嵩山的看门弟子，资质也算不错了。", 22, 0)
		say("没办法，你嵩山弟子实在是太废材了。", 0, 1)
		say(JY.Person[0].称呼 .. "，够狂啊，不过我喜欢，我们做个交易如何？", 22, 0)
		say("哦？什么交易？", 0, 1)
		say("我嵩山派广招外门弟子，你只要加入嵩山派，做些秘密任务，就有大把的银子可拿，大把的秘药可拿。", 22, 0)
		say("秘密任务？", 0, 1)
		say("不错，就是一些明面上我不方便出手的事，你去做，要做的不留痕迹。怎么样？", 22, 0)

		if yesno("要加入嵩山派么？") == true then
			say("很好，你很聪明。", 22, 0)
			say("从现在开始你就是嵩山派外门弟子了。但是对外要先保密，不要对外透露你的身份。", 22, 0)
			say("我要做什么？", 0, 1)
			say("首先，第一个任务，我知道你和华山派大弟子令狐冲关系不错，我要你接近他，打探华山派的消息，时刻报告我。", 22, 0)
			say("如果有机会打击华山派你就去做，我会论功行赏。", 22, 0)
			say("这...", 0, 1)
			say("这是你第一次行动的起始资金，好了，去吧，要小心。", 22, 0)
			addthing(174, 1000)

			JY.Person[22].好感度 = 55
		else
			say("可惜可惜，本是一颗好苗子。", 22, 0)
		end
	end
end
OEVENTLUA[2004] = function ()
	Cls()
	say("你们出来，你们这些杀人犯、胆小鬼，都给我滚出来！", 36, 0)
	say("林兄弟，发生什么事了？", 0, 1)
	say(JY.Person[0].称呼 .. "，我家里的镖师佣人全死了，爹娘也全都不在，不知道发生了生么事。", 36, 0)
	say("你们出来，你们这些杀人犯、胆小鬼，都给我滚出来！", 36, 0)
	say("林兄弟，你别着急，你想想，你们福威镖局可有什么仇人？", 0, 1)
	say("仇人？应该没有的，我爹娘都一心为善，从不招惹他人。", 36, 0)
	say("难道是因为我招惹了青城派的人，他们找上门来了？", 36, 0)
	say("不会不会，没有这般快法，我从客栈一赶回家家里就已经出事了，究竟是什么人要对付我福威镖局？", 36, 0)
	say("林兄弟，我帮你四处找找？", 0, 1)
	say("多谢" .. JY.Person[0].称呼 .. "，爹，妈，你们可千万不要出事啊！", 36, 0)
	say("我还是四处转转吧，也许有人看见了什么能有些线索。", 0, 1)
	instruct_3(128, 5, 1, 0, 2005, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(128, 6, 1, 0, 2005, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(128, 7, 1, 0, 2005, 0, 0, -2, -2, -2, -2, -2, -2)

	JY.Person[36].好感度 = JY.Person[36].好感度 + 5
end
OEVENTLUA[2005] = function ()
	Cls()
	say("哎，知道不？福威镖局出事了，好惨，人全部死光光了。", 1130, 0, "酒客")
	say("听说了，官府的人都被吓着了，说是江湖帮派仇杀，罕见的大案啊。", 1131, 1, "酒客")
	say("也不知道是谁这么狠，连佣人丫鬟都没有放过，据说连家里养的猫狗都死光了。", 1130, 0, "酒客")
	say("好惨啊，要我说这一定是青城派做的，最近福州来了好多青城派的高手，这段时间内只有他们有这么大的能力。", 1131, 1, "酒客")
	say("嘘，小声。", 1130, 0, "酒客")
	say("知道知道，哎，肯定是贪图林家的辟邪剑谱。", 1131, 1, "酒客")
	say("快别说了，来喝酒喝酒。", 1130, 0, "酒客")
	say("喝。", 1131, 1, "酒客")
	addevent(128, 36, 0, 2006, 3, -2, -2, -2)
	null(128, 30)
end
OEVENTLUA[2006] = function ()
	Cls()
	dark()
	null(128, 36)
	light()
	say("林兄弟，林兄弟？咦？人哪儿去了？", 0, 1)
	say("哎，失误了，江湖有言到，宰草要除根，林兄弟势单力薄，不会也出事了吧。", 0, 1)
	addevent(61, 33, 0, 2007, 3, -2, -2, -2)
	instruct_3(61, 20, 0, 0, 0, 0, 0, 5862, 5862, 5862, -2, -2, -2)
	instruct_3(61, 25, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(61, 24, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(61, 23, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(61, 22, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
	instruct_3(61, 21, 0, 0, 0, 0, 0, 6772, 6772, 6772, -2, -2, -2)
end
OEVENTLUA[2007] = function ()
	Cls()
	dark()
	null(-2, 33)
	null(128, 31)
	null(128, 32)
	null(128, 33)
	null(128, 34)
	null(128, 35)
	null(128, 5)
	null(128, 6)
	null(128, 7)
	light()
	say("龟孙子，我看你往哪跑！", 200, 0, "青城弟子")
	instruct_25(23, 49, 21, 39)
	say("你，你们，你们到底要怎么样！我爹爹妈妈在哪里？", 36, 1)
	Cls()
	say("哈哈，龟儿，龟婆，此时已经上阎王那儿报道了吧，哈哈哈，龟孙子，你还是快点把辟邪剑谱交出来吧。", 200, 0, "青城弟子")
	Cls()
	say("＜难道青城派找福威镖局的麻烦，不单是为了报仇，还想抢林家的剑谱？＞你们不要欺人太甚！", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "快来救我。", 36, 0)
	Cls()

	if WarMain(48, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	instruct_19(20, 41)
	instruct_40(1)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 7152, 7152, 7152, -2, -2, -2)
	Cls()
	instruct_13()
	say("林兄弟，你没事吧。", 0, 0)
	Cls()
	say("多谢" .. JY.Person[0].称呼 .. "及时出手相助。这帮青城派的狗贼，是想把我福威镖局赶尽杀绝啊。", 36, 1)
	Cls()
	say("林兄弟，究竟发生了什么事？", 0, 0)
	Cls()
	say("唉，那日我等你不回，就出去打探消息，先是遇到了塞北明驼木高峰，后来又遇到青城派的余沧海，终于知道原来害我们家的就是青城派的人。", 36, 1)
	say("后来我侥幸逃了出来，却受到青城派的人一路追杀，跑到这里终于还是被追上了，幸亏你在。", 36, 1)
	say("爹～，那边那个就是福威镖局的少镖头林平之。", 79, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 5960, 5960, 5960, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 7142, 7142, 7142, -2, -2, -2)
	instruct_3(-2, 29, 0, 0, 0, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 5184, 5184, 5184, -2, -2, -2)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 7150, 7150, 7150, -2, -2, -2)
	instruct_40(0)
	Cls()
	instruct_13()

	if JY.Person[0].门派 == 4 then
		say("爹～，他就是林平之，他就是为了帮我打抱不平才会失手杀了那个姓余的，咦，小师弟也在啊。", 36, 0)
		say("拜见师尊。", 0, 1)
		say("唔，很好。", 19, 0)
		say("岳掌门，岳掌门，你救救我爹爹，救救我妈妈……", 36, 0)
		say("林少镖头，你的父母……，唉，冲儿，你来说吧……", 19, 1)
	else
		say("爹～，他就是林平之，他就是为了帮我打抱不平才会失手杀了那个姓余的，这位" .. JY.Person[0].称呼 .. "当时也在场。", 79, 0)
		say("原来是华山掌门，君子剑岳先生，久仰大名，晚辈有礼了。", 0, 1)
		say("岳掌门，岳掌门，你救救我爹爹，救救我妈妈……", 36, 0)
		say(JY.Person[0].称呼 .. "不必多礼。林少镖头，你的父母……，唉，冲儿，你来说吧……", 19, 1)
	end

	if JY.Person[0].门派 ~= 4 then
		meet_self(19)
	end

	say("林兄弟，上次我们分手以后，我和小师妹马上赶回了华山，将你的事情禀明家师。家师料想到青城派会对你家人下毒手，于是率领我们这些弟子下山营救。没想到还是晚了一步……", 35, 0)
	Cls()
	instruct_14()
	instruct_13()
	say("爹爹……妈妈……你们死的好惨啊……孩儿一定要替你们报仇，杀了这帮青城派的狗贼……", 36, 1)
	Cls()
	say("林兄弟，你不要太难过了，你父母临终时，有遗言留给你，说福州向阳老宅……", 35, 0)
	Cls()
	say("冲儿，林公子令尊的遗言，你单独告诉他便是了，旁人不必知晓。", 19, 1)
	Cls()
	say("是，师父。", 35, 0)
	Cls()
	say("岳掌门，你是好人，人人都称你为君子剑，我一见你，就说不出的钦佩敬慕，求师父收录门墙，弟子谨遵教诲，严守门规，决不敢有丝毫违背师命。", 36, 1)
	Cls()
	say("爹～，你就收下他吧。虽说青城派是为了贪图林家的辟邪剑谱，但这件事毕竟是由于林兄弟为女儿打抱不平引起的。爹，你就收下他吧。", 79, 0)
	Cls()
	say("好吧，既然如此，平之啊，你就跟着我们吧。", 19, 1)
	Cls()
	say("多谢恩师收留。", 36, 0)
	Cls()
	say("恭喜林兄弟。", 0, 1)
	Cls()
	say("好了，此间事情已了，我们回华山吧。", 19, 0)
	Cls()
	say("是，师父。" .. JY.Person[0].称呼 .. "，再会了。", 36, 1)

	if JY.Person[0].门派 == 4 then
		say("师父，我还想在江湖上多历练历练。", 0, 1)
		say("也好。", 19, 0)
	end

	if JY.Person[22].好感度 >= 55 then
		DrawStrBox(-1, -1, "岳不群居然率众下了华山，还收了林平之做弟子，这个消息左冷禅一定想知道，嘿嘿。", M_Blue, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()

		JY.Person[22].好感度 = JY.Person[22].好感度 + 1
	end

	null(57, 3)
	null(57, 4)
	Cls()
	instruct_14()
	instruct_3(-2, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(57, 3, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(57, 4, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	addevent(57, 6, 1, 2008, 1, 5862, -2, -2)
	addevent(57, 5, 1, 2008, 1, 7018, -2, -2)
	addevent(128, 3, 1, 2011, 1, -2, -2, -2)

	JY.Person[35].好感度 = JY.Person[35].好感度 + 5
	JY.Person[36].好感度 = JY.Person[36].好感度 + 10

	Cls()
	instruct_13()
	instruct_37(1)
end
OEVENTLUA[2008] = function ()
	Cls()

	JY.Person[22].好感度 = JY.Person[22].好感度 - 1

	say("小林子，你别练功了，陪我玩玩吧。", 79, 0)
	Cls()
	say("师姐，你看我这一招用的对不对？", 36, 1)
	Cls()
	say("这个小林子，就知道拼命练功，也不陪我玩。", 79, 0)
	Cls()
	say("岳姑娘好。林兄弟他为报家仇，刻苦用功也是情理之中。岳姑娘可以找别的师兄弟玩啊，你大师兄令狐冲呢？", 0, 1)
	Cls()
	say("跟别人玩没意思嘛！大师兄？爹爹说他可以下山走动了，他就下山去了，到现在也不回来，不知道在哪儿玩得高兴呢。", 79, 0)
	Cls()

	if JY.Person[604].好感度 ~= 51 then
		addevent(61, 0, 1, 2010, 1, -2, -2, -2)
		addevent(61, 3, 1, 2010, 1, -2, -2, -2)
		addevent(61, 7, 1, 2010, 1, -2, -2, -2)
		addevent(40, 8, 1, 2010, 1, -2, -2, -2)
		addevent(40, 9, 1, 2010, 1, -2, -2, -2)
	elseif JY.Person[604].好感度 ~= 52 then
		addevent(119, 65, 1, 2009, 1, 5722, -2, -2)
		addevent(119, 66, 1, 2009, 1, 7044, -2, -2)
		addevent(119, 67, 1, 2009, 1, 5198, -2, -2)
	end
end
OEVENTLUA[2009] = function ()
	Cls()
	say("令狐老弟，怎么样？如今还是你输了一招呗？", 29, 0)
	meet_self(603)
	say("田兄，咱们当时打的赌是怎么说的来着？", 35, 1)
	say("说的是谁先离开凳子算谁输,我.....", 29, 0)
	say("田兄武功自然是胜我一筹，佩服佩服，不过打的赌嘛，咱们谁先离开的凳子？却不知道田兄自己说的话算不算数？", 35, 1)
	say("我...", 29, 0)
	say("令狐老弟，你愿意为这小尼姑做到这个地步，佩服佩服，田某交你这个朋友，从此后，这个小尼姑就是我师父。", 29, 0)
	say("小尼姑，你过来，让这位田大侠叫一声师父。", 35, 1)
	say("令狐师兄，这......", 1113, 0, "仪琳")
	say("田某认赌服输，师父，令狐老弟，告辞了，以后我去华山找你玩耍。", 29, 1)
	null(-2, 66)
	say("令狐兄，刚才这是？", 0, 0)
	say(JY.Person[0].称呼 .. "，又见面了，刚才是和田兄打了个赌。给你介绍一下，这位是恒山派的仪琳小师傅。", 35, 1)
	say(JY.Person[0].称呼 .. "，你好！", 1113, 0, "仪琳")
	say("仪琳小师妹你好。", 0, 1)
	say(JY.Person[0].称呼 .. "，你来得正好，来，赔我喝一杯。", 35, 0)
	say("令狐兄，你这伤，要不先去看看医生吧？", 0, 1)
	say("没事没事，我这还有些疗伤药，来，先喝两杯。", 35, 0)
	dark()
	light()
	say("痛快，" .. JY.Person[0].称呼 .. "，我先送仪琳小师傅去参加衡山派刘师伯的金盆洗手大会，咱们有缘再见。", 35, 1)
	say(JY.Person[0].称呼 .. "，再见！", 1113, 0, "仪琳")
	say("哦，有缘再见。", 0, 1)
	dark()
	null(-2, 65)
	null(-2, 67)
	light()
	addevent(61, 5, 1, 2012, 1, 5200, -2, -2)
	addevent(57, 5, 1, 9563, 1, 7018, -2, -2)

	JY.Person[604].好感度 = 52
end
OEVENTLUA[2010] = function ()
	Cls()
	say("衡山派的刘正风长老要退出江湖了！", 1009, 0, "酒客")
	say("哎哎，有什么内幕？", 1019, 1, "酒客")
	say("哪有什么内幕？刘长老掌管衡山派外事，这些年下来威风也有过了，银子也有了，妻妾儿女成群，正是退隐的好时机。", 1009, 0, "酒客")
	say("这么说也是啊，不过要是我就接着干，多威风，多有钱，干啥要退隐？", 1019, 1, "酒客")
	say("大人物这边怎么想咱们怎么猜得到？所以你还在这里混？", 1009, 0, "酒客")
	say("哎哎，怎么说我了？难道你不是？还说我。", 1019, 1, "酒客")
	say("喝酒喝酒，喝完咱们也去看看。", 1009, 0, "酒客")
	say("喝。", 1019, 1, "酒客")
	addevent(57, 5, 1, 9563, 1, 7018, -2, -2)
	null(58, 10)
	null(58, 11)
	addevent(58, 7, 0, 2014, 3, -2, -2, -2)
	addevent(58, 17, 1, -2, 1, 6072, -2, -2)
	addevent(58, 18, 1, -2, 1, 5958, -2, -2)
	addevent(58, 32, 1, -2, 1, 5966, -2, -2)
	addevent(58, 33, 1, -2, 1, 5940, -2, -2)
	addevent(58, 15, 1, -2, 1, 9108, -2, -2)
	addevent(58, 16, 1, -2, 1, 10176, -2, -2)
	addevent(58, 35, 1, -2, 1, 9012, -2, -2)
	addevent(58, 36, 1, -2, 1, 9044, -2, -2)
end
OEVENTLUA[2011] = function ()
	Cls()

	if JY.Base.畅想编号 == 36 then
		say("福州向阳老宅，且看看这里到底藏了什么？", 36, 0)
		say("有了，这是？", 36, 0)
		addthing(78)
		null(-2, 3)
	end
end
OEVENTLUA[2012] = function ()
	Cls()
	say("仪琳小师妹，你怎么在这里？", 0, 1)
	say(JY.Person[0].称呼 .. "你好，师伯带我们去参加衡山刘师伯的金盆洗手大会，结果半路遇到了高手拦截。", 1113, 1, "仪琳")
	say("师父说只怕是魔教要对我们下手，让我在这里通知其他五岳剑派的同道。", 1113, 0, "仪琳")
	say("你师父她们现在在哪里？", 0, 1)
	say("他们抓了好几个师姐往后面跑了，师父她们已经追上去了。", 1113, 0, "仪琳")
	say("你在这儿呆着，我去看看。", 0, 1)
	say("我和你一起去。", 1113, 0, "仪琳")
	null(-2, 5)
	DrawStrBox(-1, -1, "仪琳随队行动", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	addevent(61, 18, 0, 2013, 3, -2, -2, -2)
	addevent(61, 17, 1, -2, 1, 5232, -2, -2)
	addevent(61, 8, 1, -2, 1, 5196, -2, -2)
	addevent(61, 10, 1, -2, 1, 5196, -2, -2)
	addevent(61, 11, 1, -2, 1, 10158, -2, -2)
	addevent(61, 12, 1, -2, 1, 10158, -2, -2)
	addevent(61, 14, 1, -2, 1, 10158, -2, -2)
	addevent(61, 15, 1, -2, 1, 10158, -2, -2)
end
OEVENTLUA[2013] = function ()
	Cls()
	null(-2, 18)
	say("阿弥陀佛，善哉善哉！赵师兄、张师兄、司马师兄，我恒山派和贵派无怨无仇，三位何以如此苦苦相逼，竟要纵火将我烧成焦炭？贫尼不明，倒要请教。", 21, 0, "定闲师太")
	say("你既然认出我们了，我也不隐瞒你，左掌门命我们分兵两路，各赴浙闽干事，我劝你们还是归顺了左掌门为是，免得徒增伤亡。", 1130, 1, "嵩山高手")
	say("贼子休得猖狂。", 0, 0)
	My_Enter_SubScene(61, 14, 3, 0)
	say("师父，我们来帮你。", 1113, 1, "仪琳")
	addevent(61, 19, -2, -2, -2, 5198, -2, -2)

	if WarMain(347, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	dark()
	light()
	say(JY.Person[0].称呼 .. "好高明的武功，赵某今日栽得不冤。", 1130, 0, "嵩山高手")
	say("阿弥陀佛，阿弥陀佛。左掌门已然身为五岳剑派盟主，位望何等尊崇，何必定要归并五派，由一人出任掌门？如此大动干戈，伤残同道，岂不为天下英雄所笑？", 21, 1, "定闲师太")
	say("天网恢恢，疏而不漏。多行不义，必遭恶报。你们去罢！相烦三位奉告左掌门，恒山派从此不再奉左掌门号令。敝派虽然都是孱弱女子，却也决计不屈于强暴。左掌门并派之议，恒山派恕不奉命。", 21, 1, "定闲师太")
	say("师父，这就把他们放了？", 1113, 0, "仪琳")
	say("哼。", 1130, 1, "嵩山高手")
	dark()
	null(-2, 11)
	null(-2, 12)
	null(-2, 14)
	null(-2, 15)
	light()
	addevent(61, 34, 1, -2, 1, 7656, -2, -2)
	say("师伯，仪和她们我已经救出来了，咱们这就去和她们会合吧。" .. JY.Person[0].称呼 .. "，你也在这儿？", 35, 0)
	My_Enter_SubScene(61, 14, 3, 3)
	say("令狐兄你好。", 0, 1)
	say("这次多亏了令狐师侄，还有这位" .. JY.Person[0].称呼 .. "相助，我们恒山弟子才没有伤亡惨重。", 21, 0, "定闲师太")
	say("师伯，不用客气，咱们五岳剑派同气连枝，正该互助对敌。", 35, 1)
	say("令狐师兄，刚才那些恶人就是嵩山派的。", 1113, 0, "仪琳")
	say("啊？", 35, 1)
	say("嵩山派居然如此行事？这我得向师父报告一声。", 35, 1)
	say("只怕其他泰山，衡山的也会被攻击，咱们赶快赶去衡山警告大伙下。", 21, 0, "定闲师太")
	say("正是，咱们赶快去吧，" .. JY.Person[0].称呼 .. "，下次再找你喝酒。", 35, 1)
	say(JY.Person[0].称呼 .. "，再见！", 1113, 0, "仪琳")
	dark()
	null(-2, 8)
	null(-2, 10)
	null(-2, 34)
	null(-2, 17)
	null(-2, 19)
	light()

	JY.Person[35].好感度 = JY.Person[35].好感度 + 5
	JY.Person[603].好感度 = JY.Person[603].好感度 + 10

	instruct_37(1)
	AddPersonAttrib(0, "声望", 2)
end
OEVENTLUA[2014] = function ()
	Cls()
	null(-2, 7)
	null(119, 65)
	null(119, 66)
	null(119, 67)
	null(61, 5)
	null(61, 0)
	null(61, 3)
	null(61, 7)
	null(40, 8)
	null(40, 9)

	JY.Person[604].好感度 = 51

	instruct_25(29, 28, 28, 16)
	say("众位前辈英雄，众位好朋友。各位远道光临，刘正风实是脸上贴金，感激不尽。兄弟今日金盆洗手，从此不过问江湖上的事。", 1026, 0, "刘正风")
	say("以后各位来到衡山城，自然仍是刘某人的好朋友，不过武林中的种种恩怨是非，刘某却恕不过问了。", 1026, 0, "刘正风")
	say("有请张大人。", 1026, 0, "刘正风")
	dark()
	addevent(58, 14, 1, -2, 1, 9386, -2, -2)
	light()
	say("圣旨到，刘止风听旨。", 1140, 1, "张大人")
	say("微臣刘正风听旨，我皇万岁万岁万万岁。", 1026, 0, "刘正风")
	say("奉天承运皇帝诏曰：据湖南省巡抚奏知，衡山县庶民刘正风，急公好义，功在桑梓，弓马娴熟，才堪大用，着实授参将之职，今后报效朝廷，不负朕望，钦此。", 1140, 1, "张大人")
	say("微臣刘正风谢恩，我皇万岁万岁万万岁。些些微礼，不成敬意，张大人哂纳。", 1026, 0, "刘正风")
	say("刘大人客气了，小弟公务在身，不克久留，恭贺刘将军今日封官授职，不久又再升官晋爵，皇上恩泽，绵绵加被。告辞。", 1140, 1, "张大人")
	say("张大人慢走。", 1026, 1, "刘正风")
	dark()
	null(-2, 14)
	light()
	say("刘贤弟，咱们学武之人，侠义为重，在江湖上逍遥自在，你还去做甚么劳什子的官儿？", 23, 0, "天门")
	meet_self(23)
	say("多谢，刘某人今日金盆洗手，江湖上的恩怨是非，门派争执，刘正风决不过问，再不参与。", 1026, 1, "刘正风")
	say("且住。", 1149, 0, "费彬")
	dark()
	addevent(58, 37, 1, -2, 1, 5352, -2, -2)
	addevent(58, 38, 1, -2, 1, 8224, -2, -2)
	addevent(58, 39, 1, -2, 1, 8224, -2, -2)
	light()
	say("奉五岳剑派左盟主旗令：刘师兄不得金盆洗手。刘师兄，得罪了。", 1149, 0, "费彬")
	say("但不知盟主此令，是何用意？", 1026, 1, "刘正风")
	say("喂，你这是干甚么的？我爱跟谁在一起玩儿，你管得着么？", 330, 0, "曲非烟")
	dark()
	addevent(58, 40, 1, -2, 1, 9188, -2, -2)
	addevent(58, 41, 1, -2, 1, 6374, -2, -2)
	addevent(58, 43, 1, -2, 1, 8224, -2, -2)
	addevent(58, 44, 1, -2, 1, 8224, -2, -2)
	light()
	instruct_25(28, 16, 28, 39)
	say("奉盟主号令，要看住刘家的眷属，不许走脱了一人。", 198, 0, "嵩山弟子")
	say("左盟主这是何意？牵连家眷，这有些过分了吧？", 21, 1, "定闲")
	meet_self(21)
	instruct_25(28, 39, 28, 16)
	say("左盟主吩咐，要我们向你查明；刘师兄和魔教教主东方不败暗中有甚么勾结？设下了甚么阴谋，来对付我五岳剑派以及武林中一众正派同道？", 1149, 0, "费彬")
	null(-2, 40)
	say("在下一生之中，从未见过魔教教主东方不败一面，所谓勾结，所谓阴谋，却是从何说起？", 1026, 1, "刘正风")
	say("刘师兄，这话恐怕有些不尽不实了。魔教中有一位护法长老，名字叫作曲洋的，不知刘师兄是否相识？", 1149, 0, "费彬")
	say("......", 1026, 1, "刘正风")
	say("左盟主吩咐兄弟转告刘师兄；限你一个月之内，杀了魔教长老曲洋，提头来见，那么过往一概不究，今后大家仍是好朋友、好兄弟。", 1149, 0, "费彬")
	say("曲洋曲大哥，是我生平唯一知己，最要好的朋友。我和曲大哥相交，只是研讨音律。偶然涉及门户宗派的异见，他总是深自叹息，认为双方如此争斗，殊属无谓。", 1026, 1, "刘正风")
	say("曲大哥虽是魔教中人，但自他琴音之中，我深知他性行高洁，大有光风霁月的襟怀。刘正风不但对他钦佩，抑且仰慕。刘某虽是一介鄙夫，却决计不肯加害这位君子。", 1026, 1, "刘正风")
	say("岳师兄，你是位明辨是非的君子，这里许多位武林高人都逼我出卖朋友，你却怎么说？", 1026, 1, "刘正风")
	say("刘贤弟，倘若真是朋友，我辈武林中人，就为朋友两胁插刀，也不会皱一皱眉头。但魔教中那姓曲的，显然是笑里藏刀，口蜜腹剑，设法来投你所好，那是最最阴毒的敌人。他旨在害得刘贤弟身败名裂，家破人亡，包藏祸心之毒，不可言喻。这种人倘若也算是朋友，岂不是污辱了‘朋友’二字？古人大义灭亲，亲尚可灭，何况这种算不得朋友的大魔头、大奸贼？", 19, 0, "岳不群")
	say("在下与曲大哥结交之初，早就料到有今日之事。最近默察情势，猜想过不多时，我五岳剑派和魔教便有一场大火拚。一边是同盟的师兄弟，一边是知交好友，刘某无法相助那一边，因此才出此下策，今日金盆洗手。", 1026, 1, "刘正风")
	say("刘某从此退出武林，再也不与闻江湖上的恩怨仇杀，只盼置身事外，免受牵连。去捐了这个芝麻绿豆大的武官来做做，原是自污，以求掩人耳目。哪想到左盟主神通广大，刘某这一步棋，毕竟瞒不过他。", 1026, 1, "刘正风")
	say("如此说来，刘师兄第一条路是不肯走的了，决计不愿诛妖灭邪，杀那大魔头曲洋了？", 1149, 0, "费彬")
	say("左盟主若有号令，费师兄不妨就此动手，杀了刘某的全家！", 1026, 1, "刘正风")
	say("刘正风听者：左盟主有令，你若不应允在一个月内杀了曲洋，则五岳剑派只好立时清理门户，以免后患，斩草除根，决不容情。", 1149, 0, "费彬")
	say("你是不肯听令了？", 1149, 0, "费彬")
	say("刘某结交朋友，贵在肝胆相照，岂能杀害朋友，以求自保？", 1026, 1, "刘正风")
	say("你自己找死，须怪不得别人了，众位师兄师弟，动手！", 1149, 0, "费彬")
	dark()
	null(-2, 41)
	null(-2, 15)
	null(-2, 16)
	null(-2, 35)
	null(-2, 36)
	addevent(58, 14, 1, -2, 1, 10406, -2, -2)
	light()
	say("君子报仇，十年未晚，去！", 1125, 0, "曲洋")
	say("什么人？", 198, 1, "嵩山弟子")
	say("小心，是魔教的黑血神针！", 1149, 0, "费彬")
	dark()
	null(-2, 14)
	null(-2, 17)
	light()
	say("我们追！你们几个，左盟主令，刘正风的家眷，鸡犬不留。", 1149, 0, "费彬")
	dark()
	null(-2, 37)
	null(-2, 43)
	null(-2, 44)
	light()
	say("是。", 198, 1, "嵩山弟子")
	say("他们往衡山山林去了，我们快跟上看看？", 21, 0, "定闲")
	say("走。", 19, 1, "岳不群")
	dark()
	addevent(58, 12, 1, 2020, 1, -2, -2, -2)
	addevent(58, 13, 1, 2020, 1, -2, -2, -2)
	null(-2, 18)
	null(-2, 32)
	null(-2, 33)
	null(-2, 38)
	null(-2, 39)
	light()
	say("嵩山派这次出手够狠啊，我也跟上去看看。", 0, 0)
	addevent(58, 45, 0, 2015, 3, -2, -2, -2)
	addevent(58, 48, 1, -2, 1, 9188, -2, -2)
	addevent(58, 46, 1, -2, 1, 5904, -2, -2)
	addevent(58, 47, 1, -2, 1, 5902, -2, -2)
	addevent(58, 52, 1, -2, 1, 7656, -2, -2)
end
OEVENTLUA[2015] = function ()
	Cls()
	dark()
	null(-2, 45)
	light()
	instruct_66(2)
	say("刘贤弟，咱们今日合奏这一曲《笑傲江湖》，今日即使毙命于此，也是无憾了。", 1125, 0, "曲洋")
	say("正是，昔日嵇康临刑，抚琴一曲，叹息《广陵散》从此绝响。嘿嘿，《广陵散》纵情精妙，又怎及得上咱们这一曲《笑傲江湖》？", 1026, 1, "刘正风")
	say("愚兄早已伏在屋顶，本该及早出手，只是料想贤弟不愿为我之故，与五岳剑派的故人伤了和气，又想到愚兄曾为贤弟立下重誓，决不伤害侠义道中人士，是以迟迟不发，又谁知嵩山派为五岳盟主，下手竟如此毒辣。", 1125, 0, "曲洋")
	say("此辈俗人，怎懂得你我以音律相交的高情雅致？他们以常情猜度，自是料定你我结交，将大不利于五岳剑派与侠义道。唉，他们不懂，须也怪他们不得。", 1026, 1, "刘正风")
	say("曲兄，咱们今日已是性命难保，只是可惜这一曲《笑傲江湖》，却是还没有传承下去，可惜可惜。", 1026, 1, "刘正风")
	say("爷爷。", 330, 0, "曲非烟")
	say("好贼子，终于找到你们了。", 1149, 1, "费彬")
	dark()
	addevent(58, 49, 1, -2, 1, 5354, -2, -2)
	addevent(58, 50, 1, -2, 1, 5354, -2, -2)
	addevent(58, 51, 1, -2, 1, 5354, -2, -2)
	light()
	say("嗯？你是华山派的令狐冲？想不到你华山派和魔教也有勾结。", 1149, 0, "费彬")
	say("你不要胡说。", 35, 1)
	say("胡说不胡说先将你拿到岳不群面前再说，我看你怎么分辨。", 1149, 0, "费彬")

	if JY.Person[22].好感度 >= 55 then
		DrawStrBox(-1, -1, "左冷禅，我虽然很想帮你，但是...我看令狐兄很顺眼，还不想他死啊。", M_Blue, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
	end

	say("真是好生热闹。", 0, 1)
	say("令狐兄，我来帮你。", 0, 1)
	My_Enter_SubScene(58, 57, 34, 0)

	if WarMain(348, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	dark()
	null(-2, 49)
	null(-2, 50)
	null(-2, 51)
	light()
	instruct_37(1)
	say(JY.Person[0].称呼 .. "，我们又见面了，幸好你来得及时。", 35, 0)
	say("令狐兄，你我不用客气。", 0, 1)
	say("甚是甚是。", 35, 0)
	say("两位前辈，你们还好吧。", 35, 0)
	say("我们已经不行了。", 1026, 1, "刘正风")
	say("令狐师侄，这是《笑做江湖曲》的琴谱箫谱，请小兄弟念着我二人一番心血，将这琴谱箫谱携至世上，觅得传人。", 1026, 0, "刘正风")
	say("二位放心，晚辈自当尽力。", 35, 1)
	say("既如此，刘贤弟，咱们这就可以去了！", 1125, 0, "曲洋")
	DrawStrBox(-1, -1, "两人双手相握，齐声长笑，内力运处，迸断内息主脉，闭目而逝。", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	dark()
	addevent(58, 46, 1, -2, 1, 5432, -2, -2)
	addevent(58, 47, 1, -2, 1, 10214, -2, -2)
	light()
	say("爷爷，爷爷。", 330, 0, "曲非烟")
	say("哎。", 0, 1)
	say("令狐兄，小妹妹，衡山现在已经成了是非之地，咱们得赶快离开了。", 0, 1)
	say(JY.Person[0].称呼 .. "，究竟是发生了什么事？", 35, 0)
	say("如此如此......（将嵩山派设计刘正风的事详细告知）", 0, 1)
	say("原来如此。好，咱们分头离开，" .. JY.Person[0].称呼 .. "，有空来华山找我啊。", 35, 0)
	say("好", 0, 1)
	say("小妹妹，你还有什么亲人吗？", 0, 1)
	say("没有了。", 330, 0, "曲非烟")
	say("那你跟我走吧，以后我来照顾你。", 0, 1)
	say("现在他们搜查正紧。这样吧，我将他们引到其它方向，你直接到小村去，路上小心点，不要被嵩山派的人发现了。", 0, 1)
	dark()
	null(-2, 46)
	null(-2, 47)
	null(-2, 48)
	null(-2, 52)
	light()

	JY.Person[35].好感度 = JY.Person[35].好感度 + 10
	JY.Person[603].好感度 = JY.Person[603].好感度 + 1

	addevent(57, 5, 1, 2016, 1, -2, -2, -2)
	addevent(57, 6, 1, 2016, 1, -2, -2, -2)
	addevent(58, 38, 1, 2020, 1, 5188, -2, -2)
end
OEVENTLUA[2016] = function ()
	Cls()

	if JY.Person[35].武功2 == 47 then
		say("小林子，你教我唱福建山歌*好不好？", 79, 0)
		Cls()
		say("姊妹，上山采茶去～～", 36, 1)
		Cls()
		say("真好听，我也要唱……", 79, 0)
		Cls()
	else
		say("小林子，等你练完功，再给我讲讲你们福州都有哪些好玩的好不好？", 79, 0)
		say("好啊，小师姐，等有时间我带你去转转，有很多好玩的地方呢。", 36, 1)
		Cls()
		say("好啊好啊。", 79, 0)
		Cls()
		say("岳姑娘，大师兄令狐冲在吗？", 0, 1)
		Cls()
		say("大师兄？哼，他居然跑到丽春院去了，把爹爹气坏了，现在被罚到后山思过去了。", 79, 0)
		Cls()

		if JY.Person[0].门派 == 4 then
			instruct_3(111, 11, 1, 0, 2018, 2018, 2018, 7624, 7654, 7624, -2, -2, -2)
		else
			addevent(111, 18, 0, 2017, 3, -2, -2, -2)
			addevent(111, 10, -2, -2, -2, 7044, -2, -2)
			instruct_3(111, 11, 1, 0, 2018, 2018, 2018, 7624, 7654, 7624, -2, -2, -2)
		end
	end
end
OEVENTLUA[2017] = function ()
	Cls()
	dark()
	null(-2, 18)
	light()
	say("老子今天心情不好，小子，赶快让开路，快点！", 29, 0)
	say("滚开！", 0, 1)
	say("哟呵？现在的年轻人都这么厉害吗？今天非得教训教训你！", 29, 0)

	if WarMain(349, 0) == false then
		instruct_15(0)
		instruct_0()

		return
	end

	dark()
	null(-2, 10)
	addevent(111, 12, -2, -2, -2, 5434, -2, -2)
	light()
	say("你不是横吗？我踢死你。", 0, 1)
	say("哎呦，哎呦...", 29, 0)
	DrawStrBox(-1, -1, "田伯光挨了两脚，居然心一横，往悬崖边滚去了。", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	dark()
	null(-2, 12)
	light()
	say("啊~~~，小子~，我记住你了~~你了~", 29, 0)
	say("哎？居然自己滚下悬崖？不怕摔死吗？", 0, 1)
end
OEVENTLUA[2018] = function ()
	Cls()

	JY.Person[35].武功1 = 196
	JY.Person[35].武功等级1 = 590

	if JY.Person[0].门派 == 4 then
		say("令狐兄，你在这儿练剑呢？", 0, 0)
		say(JY.Person[0].称呼 .. "，你来了。", 35, 1)
		dark()
		addevent(111, 16, -2, -2, -2, 7044, -2, -2)
		light()
		say("令狐兄弟，我来看你来了。我还带了一壶酒来，怎么样？够义气吧。", 29, 0)
		say("田兄，你也来了，正好，咱们三人一块喝一杯。", 35, 1)
		dark()
		light()
		say("好了，酒也喝过了，令狐兄弟，咱们再来打过一场。", 29, 0)
		say("怎么，上次输了你还不服气？", 35, 1)
		say("那是自然，来吧。", 29, 0)

		JY.Person[35].攻击力 = JY.Person[35].攻击力 + 100

		WarMain(355, 1)
		say("短短两月没见，你武功居然进步这么快！莫非你华山还有什么前辈在世，指导你的剑法？", 29, 0)
		say("田兄莫要乱猜，我华山哪有什么前辈在世？", 35, 1)
		say("这位田兄，我华山剑法神妙岂是你能猜度的？我来领教领教你的高招。", 0, 0)

		if WarMain(356, 0) == true then
			say("怎么样？服了吧？", 0, 1)
			say("佩服佩服，令狐兄，还有你，咱们再见！", 29, 0)
			dark()
			null(-2, 16)
			light()
			say("......", 0, 1)
			dark()
			addevent(111, 15, -2, -2, -2, 5184, -2, -2)
			light()
			say("大师兄，不好了，成不忧拿着左盟主的五岳令旗，要逼师父让出掌门之位。", 195, 0, "六猴儿")
			say("什么！走，马上去看看！", 35, 1)
			say(JY.Person[0].称呼 .. "，抱歉，我先去看看师父他们，咱们回头再聊。", 35, 0)
			dark()
			null(-2, 11)
			null(-2, 15)
			light()
			say("嵩山派越来越猛了啊，我也看看去。", 0, 1)
			null(-2, 5)
			null(-2, 6)
			null(-2, 2)
			null(-2, 15)
			instruct_3(57, 29, 0, 0, 0, 0, 2023, 0, 0, 0, -2, -2, -2)
			instruct_3(57, 17, 1, 0, 0, 0, 0, 7018, 7018, 7018, -2, -2, -2)
			instruct_3(57, 19, 1, 0, 0, 0, 0, 7150, 7150, 7150, -2, -2, -2)
			instruct_3(57, 20, 1, 0, 0, 0, 0, 7158, 7158, 7158, -2, -2, -2)
			instruct_3(57, 18, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
			instruct_3(57, 23, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
			instruct_3(57, 21, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
			instruct_3(57, 22, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
			instruct_3(57, 24, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
			instruct_3(57, 28, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
			instruct_3(57, 27, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
			instruct_3(57, 26, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
			instruct_3(57, 25, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)

			return
		end

		say("不对不对，我从未见过有人剑法能进步这么快的，连你的武功也是这样进步神速。定有问题，对了，风前辈，定是风清扬老前辈还在世。", 29, 0)
		say("什么风老前辈？", 0, 1)
		say("还装！难怪你华山如此势弱，嵩山派也不敢攻上来，原来如此。", 29, 0)
		say("不过可惜，即使有风前辈不断指点你两，今日你们也断断斗不过我的。", 29, 0)
		say("倘若我当真指点几招，难道还收拾不下你这小子？", 140, 1)
		dark()
		addevent(111, 17, -2, -2, -2, 5896, -2, -2)
		light()
		meet_self(140)
		say("风~，风老前辈？", 29, 0)
		say("难得世上居然还有人知道风某的名字。", 140, 1)
		say("你们两个过来，我只说一遍，能不能领会就看你们的机缘了。", 140, 1)
		dark()
		light()
		say("记住了吗？", 140, 1)
		say("记住了。", 35, 0)
		instruct_41(35, 114, 1)

		JY.Person[35].修炼物品 = 114

		if (JY.Person[0].悟性 >= 90 or JY.Base.主角职业 == 2 and JY.Person[0].御剑能力 >= 100) and (has_thing(114) == false or PersonKF(0, 47) == false) then
			say("记住了。", 0, 1)

			local var_68_0 = JY.Person[0].主功体

			stop_ng(0)

			JY.Person[0].武功2 = 47
			JY.Person[0].武功等级2 = 100

			star_ng(0, var_68_0)
			addthing(114, 1)
		else
			say("我...", 0, 1)
			say("好了，这武功不是人人可学的，不可强求！", 140, 0)
		end

		say("小子，再和他打一场！", 140, 0)
		say("是。", 35, 1)

		JY.Person[35].生命 = JY.Person[35].生命 + 100
		JY.Person[35].生命最大值 = JY.Person[35].生命最大值 + 100
		JY.Person[35].内力 = JY.Person[35].内力 + 100
		JY.Person[35].内力最大值 = JY.Person[35].内力最大值 + 100
		JY.Person[35].攻击力 = JY.Person[35].攻击力 + 50
		JY.Person[35].防御力 = JY.Person[35].防御力 + 10
		JY.Person[35].轻功 = JY.Person[35].轻功 + 50
		JY.Person[35].武功2 = 47
		JY.Person[35].武功等级2 = 100
		JY.Person[29].攻击力 = JY.Person[29].攻击力 - 200
		JY.Person[29].防御力 = JY.Person[29].防御力 - 100
		JY.Person[29].轻功 = JY.Person[29].轻功 - 100

		if WarMain(355, 1) == false then
			say("人各有命，不可强求。", 140, 0)
		end

		say("田兄，怎么样？", 35, 0)
		say("佩服佩服，令狐兄居然进步如此之快，咱们再见！", 29, 1)
		dark()
		null(-2, 16)
		light()
		say("......", 0, 1)
		say("有人来了，不要和人说见过我。", 140, 0)
		dark()
		null(-2, 17)
		light()

		JY.Person[29].攻击力 = JY.Person[29].攻击力 + 200
		JY.Person[29].防御力 = JY.Person[29].防御力 + 100
		JY.Person[29].轻功 = JY.Person[29].轻功 + 100
	else
		say(JY.Person[0].称呼 .. "，你来了？我新学了一套剑法，咱们来练练？", 35, 0)
		say("好啊。", 0, 1)
		instruct_41(35, 114, 1)

		JY.Person[35].修炼物品 = 114
		JY.Person[35].生命 = JY.Person[35].生命 + 100
		JY.Person[35].生命最大值 = JY.Person[35].生命最大值 + 100
		JY.Person[35].内力 = JY.Person[35].内力 + 100
		JY.Person[35].内力最大值 = JY.Person[35].内力最大值 + 100
		JY.Person[35].攻击力 = JY.Person[35].攻击力 + 50
		JY.Person[35].防御力 = JY.Person[35].防御力 + 10
		JY.Person[35].轻功 = JY.Person[35].轻功 + 50
		JY.Person[35].武功2 = 47
		JY.Person[35].武功等级2 = 100

		if WarMain(350, 1) == false then
			instruct_0()
		end

		say("这是什么剑法？好厉害。", 0, 1)
	end

	dark()
	addevent(111, 15, -2, -2, -2, 5184, -2, -2)
	light()
	say("大师兄，不好了，成不忧拿着左盟主的五岳令旗，要逼师父让出掌门之位。", 195, 0, "六猴儿")
	say("什么！走，马上去看看！", 35, 1)
	say(JY.Person[0].称呼 .. "，抱歉，我先去看看师父他们，咱们回头再聊。", 35, 0)
	dark()
	null(-2, 11)
	null(-2, 15)
	light()
	say("嵩山派越来越猛了啊，我也看看去。", 0, 1)
	null(-2, 5)
	null(-2, 6)
	null(-2, 2)
	null(-2, 15)
	instruct_3(57, 29, 0, 0, 0, 0, 2023, 0, 0, 0, -2, -2, -2)
	instruct_3(57, 17, 1, 0, 0, 0, 0, 7018, 7018, 7018, -2, -2, -2)
	instruct_3(57, 19, 1, 0, 0, 0, 0, 7150, 7150, 7150, -2, -2, -2)
	instruct_3(57, 20, 1, 0, 0, 0, 0, 7158, 7158, 7158, -2, -2, -2)
	instruct_3(57, 18, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
	instruct_3(57, 23, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
	instruct_3(57, 21, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
	instruct_3(57, 22, 1, 0, 0, 0, 0, 5182, 5182, 5182, -2, -2, -2)
	instruct_3(57, 24, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
	instruct_3(57, 28, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
	instruct_3(57, 27, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
	instruct_3(57, 26, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
	instruct_3(57, 25, 1, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)

	JY.Person[35].攻击力 = JY.Person[35].攻击力 - 100

	instruct_3(111, 0, 0, 0, 0, 0, 0, -2, -2, -2, -2, -2, -2)
	addevent(57, 5, 1, 2016, 1, -2, -2, -2)
	addevent(57, 6, 1, 2016, 1, -2, -2, -2)
	null(-2, 0)
end
OEVENTLUA[2020] = function ()
	Cls()

	if JY.Person[0].门派 == 5 then
		say("见过盟主大人。", 196, 0)
		say("唔，好。", 0, 1)
	else
		say("想不到刘长老会与魔教勾结，如今我衡山派威名尽丧。", 196, 0)
	end
end
OEVENTLUA[2023] = function ()
	Cls()
	instruct_14()
	instruct_13()
	instruct_25(25, 27, 19, 26)
	say("成兄，你们\"剑宗\"早已离开本门，自认不再是华山弟子，何以今日又来生事？", 19, 0)
	Cls()
	say("岳不群，气宗用卑鄙的手段战胜我们剑宗，你霸占华山派掌门之位，教弟子练气不练剑，以致我华山派声名日衰，我作为华山弟子不能置之不理。", 141, 1)
	say("再说左盟主身为五岳剑派的首领，他老人家也颁下令旗，要你让位，今日该得好好算一算这笔帐了。", 141, 1)
	Cls()
	say("我想其中必有蹊跷。左盟主向来见事极明，决不会突然颁下令旗，要华山派更易。", 19, 0)
	Cls()
	say("说来说去，你这掌门人之位是不肯让的了？那剑宗成不忧今日领教岳掌门的气功。", 141, 1)
	Cls()
	say("师父，先让弟子和他斗斗，倘若弟子的气功没练得到家，再请师父来打发他不迟。", 35, 0)
	Cls()
	say("好，是你狂妄自大，可不能怨我出手狠辣。", 141, 1)
	Cls()

	if WarMain(205, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	Cls()
	instruct_13()
	say("成师傅，承让了。", 35, 0)
	Cls()
	say("我，我，我竟然输在了一个二代弟子手里，……，哼，着！", 141, 1)
	Cls()
	say("啊——！", 35, 0)
	DrawStrBox(-1, -1, "却是成不忧趁令狐冲收剑，左掌重击在令狐冲胸口", C_ORANGE, CC.DefaultFont)
	DrawStrBox(-1, -1, "只听喀的一声，令狐冲身子一仰，立即翻倒，口中鲜血狂喷。", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	say("成兄，输了便是输了，你为何还要暗算我我徒儿！＜令狐冲这小子用的是什么剑法，我都没见过，难道……？＞", 19, 1)
	Cls()
	say("徒弟的剑法，恐怕比师父还要高些…………告辞了，我们走！", 141, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 6372, 6372, 6372, -2, -2, -2)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 6372, 6372, 6372, -2, -2, -2)
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 6372, 6372, 6372, -2, -2, -2)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 6372, 6372, 6372, -2, -2, -2)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 6372, 6372, 6372, -2, -2, -2)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 6372, 6372, 6372, -2, -2, -2)
	Cls()
	instruct_13()

	JY.Person[143].姓名 = "桃根仙"
	JY.Person[144].姓名 = "桃干仙"
	JY.Person[145].姓名 = "桃枝仙"
	JY.Person[146].姓名 = "桃叶仙"
	JY.Person[147].姓名 = "桃花仙"

	say("令狐冲要死啦，怎么办？", 143, 0)
	Cls()
	say("他只是受了伤，你怎知他一定会死？", 144, 1)
	Cls()
	say("我没说他一定会死，我说他可能要死了。", 143, 0)
	Cls()
	say("哎呀，好像真的要死了，我们去救他吧。", 145, 1)
	Cls()
	say("对，有我们桃谷六仙来救他，他就死不了。", 146, 0)
	Cls()
	say("住手！你们是什么人？快把人放下。", 19, 1)
	instruct_14()
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("爹，这六个怪物是什么人？他们把大师兄带走啦……", 79, 0)
	Cls()
	say("大家赶紧去找找冲儿。＜冲儿的剑法有些古怪，但应该不是辟邪剑谱，这辟邪剑谱恐怕……我得想想办法……＞", 19, 1)
	Cls()
	say("是！", 195, 0, "陆大有")
	Cls()
	instruct_14()
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	Cls()
	instruct_13()
	say("我也去找找令狐冲吧。", 0, 1)
	Cls()
	instruct_3(-2, 14, 1, 0, 2024, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(57, 31, 0, 0, 0, 0, 0, 6744, 6744, 6744, -2, -2, -2)
	instruct_3(57, 32, 0, 0, 0, 0, 0, 6744, 6744, 6744, -2, -2, -2)
	instruct_3(57, 33, 0, 0, 0, 0, 0, 6748, 6748, 6748, -2, -2, -2)
	instruct_3(57, 34, 0, 0, 0, 0, 0, 6748, 6748, 6748, -2, -2, -2)
	instruct_3(57, 35, 0, 0, 0, 0, 0, 6750, 6750, 6750, -2, -2, -2)
	instruct_3(57, 36, 0, 0, 0, 0, 0, 6750, 6750, 6750, -2, -2, -2)
	instruct_3(57, 37, 1, 0, 2025, 0, 0, 7148, 7148, 7148, -2, -2, -2)
	instruct_3(57, 38, 0, 0, 0, 0, 2026, 0, 0, 0, -2, -2, -2)
	Cls()
	instruct_25(19, 26, 25, 27)
end
OEVENTLUA[2024] = function ()
	Cls()
	say("＜辟邪剑谱……左冷禅……嘿嘿……＞啊，" .. JY.Person[0].称呼 .. "，找到冲儿了吗？", 19, 0)
end
OEVENTLUA[2025] = function ()
	if instruct_20() == false then
		say("令狐兄，我送你回去。", 0, 1)
		Cls()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(57, 16, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(57, 14, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(57, 15, 1, 0, 2027, 0, 0, 5182, 5182, 5182, -2, -2, -2)
		null(-2, 2)
		null(-2, 5)
		null(-2, 6)
		null(-2, 37)
		Cls()
		instruct_10(35)
		Cls()

		return
	end

	say("可惜，你的队伍已满，我无*法加入。", 35, 0)
	Cls()
	Cls()
end
OEVENTLUA[2026] = function ()
	Cls()
	instruct_14()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_13()

	JY.Person[143].姓名 = "桃根仙"
	JY.Person[144].姓名 = "桃干仙"
	JY.Person[145].姓名 = "桃枝仙"
	JY.Person[146].姓名 = "桃叶仙"
	JY.Person[147].姓名 = "桃花仙"

	meet_self(143)
	meet_self(144)
	meet_self(145)
	meet_self(146)
	meet_self(147)
	meet_self(148)
	say("我这股真气，从中渎而至风市、环跳，在他渊液之间来回，必能治好他的内伤。", 148, 0)
	Cls()
	say("不对不对，应该以真气游走他足厥阴肝经诸经脉……", 147, 1)
	Cls()
	say("还是我的法子好。这小子的内伤，是属于心包络，须得以真气通他肾络三焦。", 146, 0)
	Cls()
	say("这般以真气在他渊液间来回，我看不大妥当，还是先治他的足少阴肾经为是。", 144, 1)
	Cls()
	say("他胸口中掌，受了内伤，自然当以治他手太阳肺经为主。我用真气贯注他中府、尺泽、孔最、列缺、太渊、少商诸穴，最是对症。", 145, 0)
	Cls()
	say("这小子头脑发昏，心智胡涂，须得治他阳明胃经。", 143, 1)
	Cls()
	say("咱们便试一试，到底谁说得对。", 145, 0)
	Cls()
	say("你们六个怪物，还不快住手！", 0, 1)

	if WarMain(206, 0) == false then
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 31, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 33, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 34, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 35, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 36, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	My_Enter_SubScene(57, 11, 5, 0)
	instruct_46(35, -500)
	instruct_45(35, -100)
	instruct_48(35, -200)
	Cls()
	instruct_13()
	say("令狐兄，你感觉怎么样？", 0, 1)
	Cls()
	say("这六个家伙夹杂不清，稀里糊涂，本来是一片好心要为我治伤，可是各按各的治法，我现在体内真气乱窜，少侠快送我回华山。", 35, 0)
	Cls()
	say("好，令狐兄，我送你回去。", 0, 1)
	Cls()

	if instruct_20() == false then
		instruct_10(35)
		Cls()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(57, 16, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(57, 14, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		instruct_3(57, 15, 1, 0, 2027, 0, 0, 5182, 5182, 5182, -2, -2, -2)
		null(-2, 2)
		null(-2, 5)
		null(-2, 6)
		null(-2, 37)
		Cls()

		return
	end

	say("可惜，你的队伍已满，我无法加入。", 35, 0)
	instruct_3(57, 37, 1, 0, 2025, 0, 0, 7148, 7148, 7148, -2, -2, -2)
	Cls()
end
OEVENTLUA[2027] = function ()
	Cls()

	if instruct_16(35) == false then
		say("掌门已率领弟子上嵩山了。", 195, 0)
		Cls()

		return
	end

	say("六猴，师父呢？", 35, 0)
	Cls()
	say("师父说封不平等这几个剑宗*弃徒请到了五岳剑派的令旗*，咱们上嵩山去见左盟主，*和他评一评这个道理。", 195, 1, "陆大有")
	Cls()
	say("武林中说到评理，可并非单*是\"评\"一\"评\"就算了事*，一言不合，往往继之以动*武。", 35, 0)
	Cls()
	say("师父说让你回来好好养伤，*这是师父留给你的紫霞秘笈*。我也要去帮师父的忙了。", 195, 1, "陆大有")
	Cls()
	instruct_41(35, 67, 1)
	Cls()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	Cls()
	say("师父武功虽高，未必是左盟*主的对手，何况嵩山派左盟*主的师弟共有十余人之多，*武林中号称‘嵩山十三太保*”咱们贸然上嵩山去生事，*岂非太也卤莽？", 35, 0)
	Cls()

	if JY.Person[22].好感度 >= 55 then
		DrawStrBox(-1, -1, "岳不群居然又率众下了华山，这个消息左冷禅一定想知道，嘿嘿。", M_Blue, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()

		JY.Person[22].好感度 = JY.Person[22].好感度 + 1
	end

	say("那咱们就沿路找找他们吧，*看能不能帮上什么忙。", 0, 1)
	Cls()
	say("好，师父他们人多，走的慢*，咱们应该能追上他们。", 35, 0)
	Cls()
	instruct_3(103, 0, 0, 0, 0, 0, 2030, 0, 0, 0, -2, -2, -2)
	instruct_3(103, 2, 0, 0, 0, 0, 2030, 0, 0, 0, -2, -2, -2)
	instruct_3(103, 1, 0, 0, 0, 0, 2030, 0, 0, 0, -2, -2, -2)
end
OEVENTLUA[2030] = function ()
	Cls()

	if instruct_16(35) == false then
		do return end

		Cls()
	end

	instruct_14()
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 5958, 5958, 5958, -2, -2, -2)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 7018, 7018, 7018, -2, -2, -2)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 7154, 7154, 7154, -2, -2, -2)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 7160, 7160, 7160, -2, -2, -2)
	Cls()
	instruct_13()
	instruct_25(28, 46, 30, 23)
	say("哈哈哈，华山派一干人等，*已尽数被我点了穴道。岳不*群，你还有什么说的？", 141, 0)
	Cls()
	say("哼！", 19, 1)
	Cls()
	say("岳先生，我们和你无冤无仇*，今晚冒昧得罪，只不过想*借那《辟邪剑谱》一观。你*千方百计的将福威镖局的林*家少年收入门下，自然是在*图谋这部剑谱了。老朽好言*相劝，你还是献了出来罢！", 142, 0)
	Cls()
	say("岳某既然落入你手，要杀便*杀，辟邪剑谱跟本不在我身*上，你杀岳某容易，想要坏*我名誉，却是作梦！", 19, 1)
	Cls()
	say("不好，快救我师父他们！", 35, 0)

	if JY.Person[22].好感度 >= 55 then
		DrawStrBox(-1, -1, "令狐冲极讲义气，又学了高明剑法，可见华山派底蕴极深。左冷禅那儿也一直在敷衍我，得不到什么好东西，我还是帮助令狐冲更好些。", M_Blue, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
	end

	Cls()

	if WarMain(207, 0) == false then
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	instruct_19(29, 23)
	instruct_40(2)
	Cls()
	instruct_13()

	if JY.Person[0].门派 == 4 then
		say("师父，您怎么样了？", 0, 1)
	else
		say("岳掌门，您怎么样？", 0, 1)
	end

	Cls()
	say("师父，小师妹，你们都没事*吧？", 35, 0)
	Cls()
	say("哼，令狐少侠好剑法啊！", 19, 1)
	Cls()
	say("师父，我……", 35, 0)
	Cls()
	say("师父，成不忧，封不平先后*败在大师兄手下，他们没脸*再来争夺华山掌门之位，咱*们还去嵩山么？", 195, 1, "陆大有")
	Cls()
	say("师父，弟子外公金刀无敌王*元霸是洛阳人，我父母双亡，*很想去拜见外公、外婆，禀*告详情。不如到弟子外祖家*盘桓数日。然后咱们再慢慢*游山玩水，到福建舍下去走走。", 36, 0)
	Cls()
	say("金刀无敌威震中原，我一直*好生相敬，只是缘悭一面。*福建莆田是南少林所在之地*，自来便多武林高手。咱们*便到洛阳、福建走一遭。令*狐少侠，还肯屈尊跟我们一*起走吗？", 19, 1)
	Cls()
	Cls()

	if JY.Person[0].门派 == 4 then
		say("弟子当然跟随师父！", 35, 0)
		say("师父，等等我。", 0, 1)
	else
		say("弟子当然跟随师父！" .. JY.Person[0].称呼 .. "，那我就跟师父去了，咱们就此别过。", 35, 0)
		say("也好，岳掌门，那咱们后会有期！", 0, 1)
	end

	Cls()
	instruct_14()
	instruct_21(35)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(40, 43, 0, 0, 0, 0, 2031, 0, 0, 0, -2, -2, -2)
	instruct_3(40, 48, 0, 0, 0, 0, 0, 7018, 7018, 7018, -2, -2, -2)
	instruct_3(40, 47, 0, 0, 0, 0, 0, 7154, 7154, 7154, -2, -2, -2)
	instruct_3(40, 49, 0, 0, 0, 0, 0, 7158, 7158, 7158, -2, -2, -2)
	instruct_3(40, 41, 1, 0, 2032, 0, 0, 5958, 5958, 5958, -2, -2, -2)

	JY.Person[22].好感度 = JY.Person[22].好感度 - 1

	Cls()
	instruct_13()
end
OEVENTLUA[2031] = function ()
	Cls()
	instruct_14()
	null(-2, 43)
	instruct_13()
	say("爷爷，这本辟邪剑谱是我们*在令狐冲的身上搜出来的！", 208, 0, "金刀门人")
	Cls()
	say("让我看看。。。。令狐*，这部辟邪剑谱，你是从何*处得来的？", 106, 1)
	meet_self(106)
	say("你祖孙三代，口口声声的说*这是辟邪剑谱。你们见过辟*邪剑谱没有？怎知这便是辟*邪剑谱？", 35, 0)
	Cls()
	say("这部册子从你身上搜了出来*，上面记着古怪文字，岳掌*门又说这不是华山派的武功*书谱，却不是辟邪剑谱是甚*么？", 208, 1, "金刀门人")
	Cls()
	instruct_30(24, 14, 24, 7)
	say("参见王员外、岳掌门。*令狐兄，发生什么事了？", 0, 0)
	Cls()
	say("师父，" .. JY.Person[0].称呼 .. "，你们来看，*这明明是一本七弦琴的琴谱*，洞箫的箫谱，他王家目不*识丁，硬说是辟邪剑谱，天*下居然有这等大笑话。", 35, 1)
	Cls()
	say("武学秘笈的种类极多，有人*为了怕人偷窥，故意将武功*图谱写成曲谱模样，那也不*足为奇。", 106, 0)
	Cls()
	say("这个简单，附近可有什么人*会奏琴吹箫？不妨请他来看*看便知的。", 0, 1)
	Cls()
	say("东城的绿竹翁，他既会抚琴*，又会吹箫，咱们去问问他*便清楚了。", 106, 0)
	Cls()
	say("好，冲儿，咱们就走一趟，*如果真是剑谱，师父对你也*绝不轻饶。", 19, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 49, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 48, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 47, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 41, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 50, 0, 0, 0, 0, 0, 7164, 7164, 7164, -2, -2, -2)
	instruct_3(-2, 51, 0, 0, 0, 0, 0, 8214, 8214, 8214, -2, -2, -2)
	instruct_3(-2, 52, 0, 0, 0, 0, 0, 6098, 6098, 6098, -2, -2, -2)
	instruct_3(-2, 53, 0, 0, 0, 0, 0, 6098, 6098, 6098, -2, -2, -2)
	instruct_3(-2, 55, 0, 0, 0, 0, 0, 7158, 7158, 7158, -2, -2, -2)
	instruct_3(-2, 57, 0, 0, 0, 0, 0, 7150, 7150, 7150, -2, -2, -2)
	instruct_3(-2, 56, 0, 0, 0, 0, 0, 7166, 7166, 7166, -2, -2, -2)
	instruct_3(-2, 54, 0, 0, 0, 0, 0, 8222, 8222, 8222, -2, -2, -2)
	My_Enter_SubScene(40, 46, 11, 2)
	Cls()
	instruct_13()
	say("贵客枉顾蜗居，不知有何见*教。", 1023, 0, "绿竹翁")
	Cls()
	say("竹翁，这有一本奇怪的琴谱*箫谱，要请你老人家的法眼*鉴定鉴定。", 106, 1)
	Cls()
	say("有琴谱箫谱要我鉴定？这可*太瞧得起老朽了。好，你放*下罢。", 1023, 0, "绿竹翁")
	Cls()
	say("请问竹翁，这真的是曲谱，*还是什么武功秘诀，故意写*成了曲谱模样？", 106, 1)
	Cls()
	say("待我看看。。。咦？这琴谱*好生古怪，令人难以明白。", 1023, 0, "绿竹翁")
	Cls()
	say("什么曲谱？拿来我看。", 73, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 58, 1, 0, 2034, 0, 0, 7168, 7168, 7168, -2, -2, -2)
	instruct_3(-2, 59, 1, 0, 0, 0, 0, 7164, 7164, 7164, -2, -2, -2)
	instruct_3(-2, 50, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	Cls()
	instruct_13()
	say("师叔请看，这部琴谱可有些*古怪。", 1023, 0, "绿竹翁")
	Cls()
	instruct_66(0)
	say("（竹屋内响起了琴声）……琴音似止未止之际，却*有一二下极低极细的箫声在*琴音旁响了起来。回旋婉转*，箫声渐响，恰似吹箫人一*面吹，一面慢慢走近，箫声*清丽，忽高忽低，忽轻忽响*，低到极处之际，几个盘旋*之后，又再低沉下去，虽极*低极细，每个音节仍清晰可*闻。渐渐低音中偶有珠玉跳*跃，清脆短促，此伏彼起，*繁音渐增，先如鸣泉飞溅，*继而如群卉争艳，花团锦簇*，更夹着间关鸟语，彼鸣我*和，渐渐的百鸟离去，春残*花落，但闻雨声萧萧，一片*凄凉肃杀之象，细雨绵绵，*若有若无，终于万籁俱寂。", 0, 2)
	Cls()
	instruct_14()
	instruct_3(-2, 50, 1, 0, 2036, 0, 0, 7164, 7164, 7164, -2, -2, -2)
	instruct_3(-2, 59, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_19(46, 11)
	Cls()
	instruct_13()
	instruct_66(2)
	say("佩服，佩服！向我这种不懂*音律之人却也不禁心驰神醉*。冲儿，这是什么曲子？", 19, 0)
	Cls()
	say("这叫做《笑傲江湖曲》。", 35, 1)
	Cls()
	say("诸位，这确是琴谱箫谱，我*师叔适才奏过了，你们拿回*去罢！这曲谱中所记乐曲之*妙，世上罕有，此乃神物，*不可落入俗人手中。", 1023, 0, "绿竹翁")
	Cls()
	say("看来的确只是曲谱，令狐贤*侄，这可得罪了！曲谱请你*拿回去吧。", 106, 1)
	Cls()
	say("哼。。。", 35, 0)
	Cls()
	say("冲儿。师父错怪你了，咱们*回去吧。", 19, 1)
	Cls()
	say("弟子多耽一会便回去，请师*父先回去吧。", 35, 0)
	Cls()
	say("看这位小兄弟，我听你说话*，中气大是不足，少年人不*该如此，却是何故？最近是*生了大病呢，还是曾受重伤*？", 1023, 1, "绿竹翁")
	Cls()
	say("是受了极重的伤。", 35, 0)
	Cls()
	say("请公子过来，待我搭一搭脉*。。。", 73, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 51, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 52, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 53, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 54, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 55, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 56, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 57, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 60, 1, 0, 2035, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	instruct_3(-2, 61, 1, 0, 2033, 0, 0, 7142, 7142, 7142, -2, -2, -2)
	instruct_3(-2, 62, 1, 0, 2033, 0, 0, 7156, 7156, 7156, -2, -2, -2)

	JY.Person[106].好感度 = 51

	Cls()
	instruct_13()
end
OEVENTLUA[2032] = function ()
	Cls()
end
OEVENTLUA[2033] = function ()
	Cls()
	say("小林子，你教我唱福建山歌*好不好？", 79, 0)
	Cls()
	say("姊妹，上山采茶去～～", 36, 1)
	Cls()
	say("真好听，我也要唱……", 79, 0)
	Cls()
end
OEVENTLUA[2034] = function ()
	Cls()
	say("公子伤势过重，我只能传授*你一曲《清心普善咒》，盼*能助你调理体内真气。", 73, 0)
	Cls()
	say("多谢姑娘，在下自当认真学*习。", 35, 1)
	meet_self(73)
end
OEVENTLUA[2035] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，你也来听听吧，这琴声真好听，感觉身心都受到洗涤。", 35, 0)
	say("好啊。", 0, 1)
	dark()
	light()
	addtime(1)
	say("......", 0, 1)
	say("不知不觉一天过去了，令狐兄，我该走了。", 0, 1)
	say(JY.Person[0].称呼 .. "请便。", 35, 0)
	Cls()
	instruct_3(40, 43, 0, 0, 0, 0, 2037, 0, 0, 0, -2, -2, -2)
	null(-2, 41)
	null(-2, 61)
	null(-2, 62)
end
OEVENTLUA[2036] = function ()
	Cls()
	say("琴之道，在于静，入琴者需*心无滞碍、身无所系才真正*得琴之道。", 1023, 0, "绿竹翁")
	Cls()
end
OEVENTLUA[2037] = function ()
	Cls()
	dark()
	null(-2, 43)
	light()
	say("咦？华山派的人都走了？不知道令狐兄还在不在绿竹巷那儿学琴。", 0, 0)
	instruct_3(40, 31, 1, 0, 9403, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 58, 1, 0, 2039, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 60, 1, 0, 2039, 0, 0, -2, -2, -2, -2, -2, -2)

	if JY.Person[578].好感度 >= 60 then
		addevent(40, 28, 1, 6762, 1, 10190, -2, -2)
	end
end
OEVENTLUA[2039] = function ()
	Cls()
	instruct_26(40, 17, 1, 0, 0)
	say("令狐兄病情如何？", 0, 1)
	Cls()
	say("曲子已经学完。感觉身体略*有好转。", 35, 0)
	Cls()
	say("唉，虽然这首曲子对他的伤*稍有裨益，但毕竟没有解决*根本问题。现在能治你的病*的可能只有杀人名医平一指*了。你去找他吧，他定会全*力施救。", 73, 1)
	Cls()
	say("多谢姑娘，不知那平一指现在何处？", 35, 0)
	Cls()
	say("平一指家离泰山不远，在它的东南方向200余里。", 73, 1)
	instruct_39(30)
	say("多谢姑娘。", 35, 0)
	say("我这操琴之法传授与你，需*每日勤加练习。咱们就此别*过吧。", 73, 1)
	Cls()
	instruct_41(35, 180, 1)
	say("今日一别，不知何日得能再*聆姑娘雅奏。令狐冲但教不*死，定当再到洛阳，拜访姑*娘和竹翁。", 35, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 58, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 60, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 54, 1, 0, 2040, 0, 0, 7148, 7148, 7148, -2, -2, -2)
	My_Enter_SubScene(40, 44, 11, 2)
	Cls()
	instruct_13()
end
OEVENTLUA[2040] = function ()
	Cls()

	if instruct_20() == false then
		say("令狐兄，你如今身负重伤，行动不便，我陪你去找那平一指，定要将你内伤治好。", 0, 1)
		say("如此多谢了。", 35, 0)

		JY.Person[35].好感度 = JY.Person[35].好感度 + 10

		instruct_3(30, 0, 1, 0, 2045, 0, 0, -2, -2, -2, -2, -2, -2)
		addevent(60, 12, 1, 2049, 1, 7262, -2, -2)
		addevent(96, 5, 1, 2047, 1, 6804, -2, -2)
		Cls()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		Cls()
		instruct_10(35)
		Cls()

		return
	end

	say("可惜，你的队伍已满，我无*法加入。", 35, 0)
	Cls()
end
OEVENTLUA[2045] = function ()
	Cls()

	if instruct_16(35) == false then
		say("治一人，杀一人。这是为了*维护生态平衡。", 28, 0)
		Cls()

		return
	end

	instruct_26(40, 17, 1, 0, 0)
	instruct_26(40, 18, 1, 0, 0)
	meet_self(28)
	say("阁下想必就是令狐公子吧？", 28, 0)
	Cls()
	say("正是在下。", 35, 1)
	Cls()
	say("令狐公子，有人托我给你看*病，你伸手过来，老夫摸摸*你的脉象。", 28, 0)
	Cls()
	say("且慢。平大夫，在下听说平*大夫素有杀人名医的称号。*治一人，必须杀一人！", 0, 1)
	Cls()
	say("不错。但令狐少侠例外，因*为杀人这件事已经有人替他*办妥了。", 28, 0)
	Cls()
	say("我倒想请问平大夫，治好一*人就要杀一人，那么治不好*又如何？", 0, 1)
	Cls()
	say("哼，这天底下就没有我平一*指治不好的病！", 28, 0)
	Cls()
	say("平大夫此言未免过于托大，*万一治不好呢？", 0, 1)
	Cls()
	say("哼，令狐公子，你伸手过来*，老夫摸摸你的脉象。。。", 28, 0)
	Cls()
	instruct_14()
	instruct_13()
	say("这，这，这……你这伤势要*彻底治好，就算大罗金仙，*只怕也是难以办到，如能戒*酒、戒色、戒斗那么或许能*多活一二年。", 28, 0)
	Cls()
	say("平大夫，人生在世，会当畅*情适意，连酒也不能喝，女*人不能想，人家欺到头上不*能还手，还做什么人？不如*及早死了，来得爽快。", 35, 1)
	Cls()
	say("令狐公子，你的病我虽然治*不了，但也不见得就是毫无*办法。听说少林易筋经是无*上内功宝典，也许可将你体*内数种内力化解。", 28, 0)
	Cls()
	say("既然如此，告辞了。", 35, 1)
	Cls()
	say("等等，你这么乱跑可不行，说不定什么时候小命就没了。", 28, 0)
	Cls()
	say("生死有命，告辞。", 35, 1)
	Cls()
	say("等等！我虽然现在治不好你，可你也不能在我看过后还死了。我和你们一起走，总之吊着你一条命不死。", 28, 0)
	Cls()
	say("如此，多谢！", 35, 1)
	say("小子，你不用谢我，你应该谢...，嘿嘿。", 28, 0)

	if instruct_20() == false then
		instruct_10(28)
		instruct_14()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
		addevent(28, 78, 1, 2055, 1, -2)
		Cls()
		instruct_13()

		return
	end

	say("你的队伍已满，我无法加入。", 28, 0)
	instruct_3(30, 0, 1, 0, 2046, 0, 0, -2, -2, -2, -2, -2, -2)
	Cls()
end
OEVENTLUA[2046] = function ()
	say("救命如救火，你们还愣着干什么？咱们走！", 28, 0)
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(28)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			addevent(28, 78, 1, 2055, 1, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 28, 0)
		Cls()

		return
	end
end
OEVENTLUA[2047] = function ()
	Cls()
	meet_self(25)

	if instruct_16(35) == false then
		say("公子来到我们云南五仙教，*不知有什么事？", 25, 0)
		Cls()
		say("久闻五毒教大名，蓝教主貌*美风骚，在下特来拜见。", 0, 1)
		Cls()
		say("呵呵，你称赞我美貌，那可*要多谢你啦。", 25, 0)
		Cls()

		return
	end

	say("这位可是令狐公子？", 25, 0)
	Cls()
	say("正是在下。不知姑娘是……？", 35, 1)
	Cls()
	say("我是你好朋友的朋友，也就*是你的朋友啦。我知道你身*受重伤，就用我们苗家的办*法帮你治一治。", 25, 0)
	Cls()
	instruct_14()
	instruct_48(35, 100)
	instruct_13()
	say("你的病我虽然治不好，但给*你送了这许多血，是大有好*处的。令狐公子，你瞧我很*老了，是不是？", 25, 0)
	Cls()
	say("谁说你老了？你一点都不老*，要是你不生气，我就叫你*一声妹子啦。", 35, 1)
	Cls()
	say("你真好。怪不得，怪不得，*这个不把天下男人放在眼里*的人，也会对你这样好。", 25, 0)
	Cls()
	say("你若真的说我好，干嘛不叫*我令狐大哥？", 35, 1)
	Cls()
	say("呵呵，令狐大哥！", 25, 0)
	Cls()
	say("好妹子，乖妹子。", 35, 1)
	Cls()
	instruct_3(-2, -2, 1, 0, 2048, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 10, 1, 0, 0, 0, 0, 2286, 2286, 2286, -2, -2, -2)
end
OEVENTLUA[2048] = function ()
	Cls()

	if instruct_16(73) then
		say("凤凰，你毒功厉害，如今也该让江湖人都知道五仙教的威名了。", 73, 1)
		Cls()
		say("是，我听圣姑的。", 25, 0)
		Cls()

		if instruct_20() == false then
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			Cls()
			instruct_13()
			instruct_10(25)
			Cls()

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 25, 0)
		Cls()
		instruct_14()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 28, 1, 0, 113, 0, 0, 6804, 6804, 6804, -2, -2, -2)
		Cls()
		instruct_13()

		return
	end

	if instruct_16(35) then
		say("呵呵，令狐大哥！", 25, 0)
		Cls()
		say("好妹子，乖妹子。", 35, 0)
		Cls()
	end

	say("蓝教主可愿和在下一起闯荡江湖？", 0, 1)
	Cls()
	say("我们是日月神教的属下，我要听圣姑的。", 25, 0)
	Cls()
end
OEVENTLUA[2049] = function ()
	Cls()

	if instruct_16(35) then
		say("这位可是令狐公子？", 88, 0)
		say("敢问先生是？", 35, 1)
		say("果然是令狐公子，早就听说令狐公子风流潇洒，人中龙凤，今日一见，果然不俗。", 88, 0)
		say("......", 0, 1)
		say("我这有上好的美酒，不知公子可敢陪祖某喝上几杯？", 88, 0)
		say("有何不敢？", 35, 1)
		say("令狐兄，你如今身负重伤，喝酒只怕不妥。", 0, 0)
		say("无妨，我已命不久长，多活个一刻两刻的，也没多大分别，先生，请了。", 35, 1)
		say("果然好气概，你这朋友么？嘿嘿...我这酒却只赠有缘人，你自己到客栈先行休息吧。", 88, 0)
		say(JY.Person[0].称呼 .. "，无妨，我如今馋虫犯了，你且忍忍，我喝完酒就去找你。", 35, 1)
		say("......", 0, 0)
		instruct_21(35)
		dark()
		My_Enter_SubScene(60, 49, 14, 3)
		light()
		addtime(1)
		DrawStrBox(-1, -1, "一夜过去", C_ORANGE, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
		say("呼，一夜好睡，令狐兄呢？怎么还没有回来？", 0, 1)
		null(-2, 12)
		instruct_3(60, 17, 0, 0, 0, 0, 2050, 0, 0, 0, -2, -2, -2)
		instruct_3(60, 18, 1, 0, -2, 0, 0, 7170, 7170, 7170, -2, -2, -2)
		instruct_3(60, 19, 1, 0, -2, 0, 0, 10430, 10430, 10430, -2, -2, -2)
		instruct_3(60, 21, 1, 0, -2, 0, 0, 10238, 10238, 10238, -2, -2, -2)
	else
		say("老头子那个老东西，让他找的药材怎么到现在还没有找到？", 88, 0)
	end
end
OEVENTLUA[2050] = function ()
	Cls()
	dark()
	null(-2, 17)
	light()
	say("女儿啊，你别着急，等我把这小子的血都换到你身体里，你的病就好了。", 1148, 0)
	say("令狐兄？你怎么了？老头子，你在干什么？", 0, 1)
	say("干什么？换血啊，这小子把我女儿治病的药给喝了，我只好把他的血抽出来了。", 1148, 0)
	say("什么？快住手！", 0, 1)
	My_Enter_SubScene(60, 39, 15, 0)
	say("等...等等...", 35, 0)
	say(JY.Person[0].称呼 .. "，让他抽吧。", 35, 0)
	say("令狐兄，可是你...", 0, 1)
	say("我？我本来就要死了，现在能在死前换这小妹妹一条命有何不可，大赚特赚啊。", 1148, 0)
	say("......", 0, 1)
	say("......", 1148, 0)
	say("令狐兄弟，是我小看你了，你放心，我就抽你一半的血，绝不至于要了你的命。", 1148, 0)
	say("......", 0, 1)
	dark()
	light()
	say("好了，令狐兄弟，我欠你一个人情，定当厚报，这是一颗千年人参，留给你补补身体。告辞了。", 1148, 0)
	instruct_41(35, 16, 1)
	dark()
	null(-2, 19)
	null(-2, 21)
	light()
	say("令狐兄，你怎么样了？", 0, 1)
	say("呵呵，还死不了。", 35, 0)
	say("令狐兄，你现在伤的太严重，我先送你回华山吧？", 0, 1)
	say("不， 我要回去了，师父师娘他们也没有办法，只是让他们更难过而已。", 35, 0)
	say("......，好吧，令狐兄，这究竟是怎么回事啊？", 0, 1)
	say("昨天那个老先生和我喝完酒就走了，我身体虚，结果就醉倒在这里睡着了，然后就被这位老先生绑了，给他女儿治病了。", 35, 0)
	say("这些都是什么人？", 0, 1)
	say("不知道，江湖上奇人甚多，临死前能结识两个也是缘分。", 35, 0)
	instruct_3(-2, 18, 1, 0, 2051, 0, 0, -2, -2, -2, -2, -2, -2)
end
OEVENTLUA[2051] = function ()
	Cls()

	if instruct_20() == false then
		say("令狐兄，咱们走吧。", 0, 1)
		say("好。", 35, 0)

		JY.Person[35].好感度 = JY.Person[35].好感度 + 2

		Cls()
		instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		Cls()
		instruct_10(35)
		Cls()

		return
	end

	say("可惜，你的队伍已满，我无*法加入。", 35, 0)
	Cls()
end
OEVENTLUA[2055] = function ()
	Cls()

	if instruct_16(35) == false then
		say("阿弥陀佛，习武之道在于循序渐进，施主切忌操之过急。", 70, 0)

		do return end

		Cls()
	end

	dark()
	instruct_3(-2, 83, 1, 0, -2, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	light()
	say("华山派令狐冲拜见方丈大师。", 35, 1)
	say("原来是令狐少侠，不知令狐少侠此来少林是？", 70, 0)
	say("小子不幸，身体中有数股真气冲突，已然命不久矣，听闻少林有治疗之法，特来求助于方丈。", 35, 1)
	say("竟有此事？让我看看。", 70, 0)
	dark()
	light()
	say("令狐少侠，你这伤却是好生难办。", 70, 0)
	say("小子听闻少林易经筋可以纾解异种真气，不知可真？", 35, 1)
	say("这个，本寺还没有人出现过你这种情况，所以不知易经筋是否可以医治异种真气入体的情况。这易经筋乃是本寺秘传，即使是我，也是不能做主将此秘本外传。", 70, 0)
	say("不过令狐少侠这伤也不是没有它法，我送你几本静心咒，只要日日念诵，时刻保持心境平和，以后不动用内力，也是性命无忧的。", 70, 0)
	say("如是这样，活着又有什么意思。", 35, 1)
	say("方丈大师，少林慈悲为怀，你看...", 0, 0)
	say("即是如此，那便告辞了。", 35, 1)
	say("阿弥陀佛。", 70, 0)

	if instruct_16(28) then
		say("狗屁的少林寺？这就是佛家的慈悲为怀？", 28, 1)
		say("阿弥陀佛。", 70, 0)
	end

	dark()
	null(-2, 83)
	addevent(93, 26, 0, 2056, 3, -2)
	addevent(28, 78, 1, 9289, 1, -2)
	light()
end
OEVENTLUA[2056] = function ()
	Cls()
	dark()
	null(-2, 26)
	instruct_3(93, 31, 1, 0, -2, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	light()
	say("令狐兄，你怎么样了？", 0, 1)
	say("看来我这伤是治不好了，我想回华山看看，" .. JY.Person[0].称呼 .. "，你送我回去吧。", 35, 0)
	say("好。令狐兄，你也别灰心，我送你先回华山，再下山为你寻找治疗之法。", 0, 1)
	dark()
	null(-2, 31)
	light()
	instruct_3(57, 15, 1, 0, 2080, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	addevent(103, 0, 0, 2057, 3, -2)
	addevent(103, 1, 0, 2057, 3, -2)
	addevent(103, 2, 0, 2057, 3, -2)
	addevent(103, 26, -2, 2056, -2, 6818)
end
OEVENTLUA[2057] = function ()
	Cls()

	if instruct_16(35) == false then
		do return end

		Cls()
	end

	instruct_14()
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 8762, 8762, 8762, -2, -2, -2)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 6770, 6770, 6770, -2, -2, -2)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 6776, 6776, 6776, -2, -2, -2)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 6782, 6782, 6782, -2, -2, -2)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 6782, 6782, 6782, -2, -2, -2)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 6782, 6782, 6782, -2, -2, -2)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 6782, 6782, 6782, -2, -2, -2)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 6782, 6782, 6782, -2, -2, -2)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 5208, 5208, 5208, -2, -2, -2)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 9156, 9156, 9156, -2, -2, -2)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 9156, 9156, 9156, -2, -2, -2)
	instruct_3(-2, 31, 0, 0, 0, 0, 0, 7172, 7172, 7172, -2, -2, -2)
	Cls()
	instruct_13()
	instruct_25(28, 46, 30, 23)
	say("向问天，看你这回往哪儿跑！", 200, 0, "青城弟子")
	Cls()
	say("向右使，属下可要得罪了。", 202, 1, "日月教徒")
	Cls()
	say("向问天这魔教妖人，人人得而诛之。", 199, 0)
	Cls()
	say("邪魔外道，危害江湖，我辈中人除妖灭魔，责无旁贷！", 197, 1, "恒山弟子")
	Cls()
	say("哈哈哈哈，有本事就尽管来吧！", 366, 0, "向问天")
	Cls()
	say("这么多人打一个，好不要脸！", 35, 1)
	Cls()
	say("那边两个小子，胡说八道什么？", 202, 0, "日月教徒")
	Cls()
	say("八成是跟这姓向得一伙的，拿下他们再说！", 196, 1, "崆峒弟子")
	Cls()
	say("我……我不是……＜倒霉倒霉，令狐兄的一句话，就趟上了这趟混水……＞", 0, 0)
	Cls()

	if WarMain(210, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	My_Enter_SubScene(103, 29, 22, 1)
	instruct_3(103, 27, 1, 0, -2, 0, 0, 7146, 7146, 7146, -2, -2, -2)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 7, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 4, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 19, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 15, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	light()
	say("哈哈哈哈，想不到我向问天危难之际，还能有两位素不相识的朋友相助，好，好，哈哈哈……", 366, 0, "向问天")
	Cls()
	say("我反正是个快死之人了，倒是连累了这位" .. JY.Person[0].称呼 .. "。", 35, 1)
	Cls()
	say("＜该死的令狐冲，你还知道啊……＞哪里哪里。他们那么多人打一个，不是英雄好汉的行径。就算令狐大哥不说话，我也是要出手的。", 0, 0)
	Cls()
	say("哈哈哈，我向问天能结识两位，真乃三生有幸。这位令狐兄弟，我看你似乎内力全无，不知道是怎么回事？", 366, 1, "向问天")
	Cls()
	say("唉，我本来是受了重伤，那桃谷六仙又胡乱医治……", 35, 0)
	Cls()
	instruct_14()
	instruct_13()
	say("……就这样，我就变得内力全无了……", 35, 0)
	Cls()
	say("令狐兄弟的遭遇，当真是闻所未闻啊。不过，据我所知，有一个人能治好你的病。", 366, 1, "向问天")
	Cls()
	say("哦？还望向大哥赐教。", 35, 0)
	Cls()
	say("西湖梅庄之中，住着一位高人，他有一套奇异的武功，定可化解你体内的异种真气。", 366, 1, "向问天")
	Cls()
	say("令狐大哥，那咱们就上梅庄吧。", 0, 0)
	Cls()
	say("不过，想见到这位高人着实不易。梅庄还有四位庄主，你们必须将他四人打败，才有可能见到这位高人。", 366, 1, "向问天")
	Cls()
	say("哦，不就是打架嘛，这个简单。", 0, 0)
	Cls()
	say("我知道四位庄主分别对琴棋书画如痴如狂，只有用每个人喜好的东西来诱惑他们，他们才可能和你交手。我能帮你的就这么多，能不能见到这个人，就看你们的造化啦。", 366, 1, "向问天")
	Cls()
	say("多谢向大哥指点迷津。", 35, 0)
	Cls()
	say("咱们就此分手吧，有缘的话一定还会见面的。记住，在梅庄不要提起我的名字。", 366, 1, "向问天")
	Cls()
	say("既然如此，令狐兄，咱们这就去梅庄吧。", 0, 0)
	say("好。", 35, 1)
	instruct_14()
	null(-2, 0)
	null(-2, 1)
	null(-2, 2)
	null(-2, 27)
	null(-2, 31)
	instruct_39(55)
	instruct_17(55, 1, 30, 47, 0)
	Cls()
	instruct_13()
end
OEVENTLUA[2058] = function ()
	Cls()
	say("这位" .. JY.Person[0].称呼 .. "到梅庄来不知有何*见教？", 31, 0)
	Cls()
end
OEVENTLUA[2059] = function ()
	Cls()

	if instruct_4(215) == false then
		Cls()

		return
	end

	meet_self(31)
	say("啊！这是北宋范宽的真迹“溪山行旅图”，你……你是从何处得来的？", 31, 0)
	Cls()
	say("这个你不必管。我听江湖上传言，梅庄四庄主好酒，好画，好剑，人称三绝。那想必对我这幅画定是垂涎三尺了！", 0, 1)
	Cls()
	say("你这" .. JY.Person[0].称呼 .. "，到底有什么企图？", 31, 0)
	Cls()
	say("\"企图\"没有，\"行旅图\"倒是有一幅。", 0, 1)
	say("快给我。", 31, 0)

	if WarMain(43, 0) == false then
		instruct_15()
		Cls()

		return
	end

	say(JY.Person[0].称呼 .. "，你等着，待我去请我三哥。", 31, 0)
	Cls()
	instruct_14()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 8, 1, 0, 2060, 0, 0, 6048, 6048, 6048, -2, -2, -2)
	instruct_17(-2, 1, 37, 42, 0)
	Cls()
	instruct_13()
end
OEVENTLUA[2060] = function ()
	Cls()
	say("三哥，你一定要帮我出这口*气，将那幅“溪山行旅图”给抢过来。", 31, 0)
	Cls()
	say("四弟，你自己丢的面子还不*够啊！*这位" .. JY.Person[0].称呼 .. "，老夫不送了。", 32, 0)
	Cls()
end
OEVENTLUA[2061] = function ()
	Cls()

	if instruct_4(214) == false then
		Cls()

		return
	end

	meet_self(32)
	say("这……这是真迹！真是……真是唐朝……唐朝张旭的\"率意帖\"……假不了，假不了的！", 32, 0)
	Cls()
	say("三庄主果然是行家。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "，可否再借老夫一看？", 32, 0)
	Cls()
	say("秃老头，要看可以，先打赢我再说。", 0, 1)
	Cls()
	say("说什么？我最痛恨人家叫我秃子，你这" .. JY.Person[0].称呼 .. "太不知死活了。", 32, 0)
	Cls()
	say("秃头秃头，下雨不愁，人家有伞，我有秃头。", 0, 1)
	Cls()
	say("好，好，好，" .. JY.Person[0].称呼 .. "，我瞧你是活得不耐烦了，看看老夫怎么收拾你。", 32, 0)
	Cls()

	if WarMain(44, 0) == false then
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_13()
	addthing(183, 1)
	Cls()
	say(JY.Person[0].称呼 .. "，果然有两下子，可是那\"率意帖\"我是要定了。", 32, 0)
	Cls()
	say("三庄主，别自不量力了。我看这梅庄之中也没什么能手了，真是害我白走一趟。", 0, 1)
	Cls()
	say("四弟，咱们去求二哥帮忙。", 32, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 8, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 11, 1, 0, 2062, 0, 0, 6050, 6050, 6050, -2, -2, -2)
	instruct_3(-2, 10, 1, 0, 2062, 0, 0, 6054, 6054, 6054, -2, -2, -2)
	instruct_17(-2, 1, 21, 34, 0)
	Cls()
	instruct_13()
end
OEVENTLUA[2062] = function ()
	Cls()
	say("二哥，就是这个后辈小生来*找麻烦，*你一定要帮我们报仇。", 31, 0)
	Cls()
	say("是呀，二哥，你一定要帮我*把\"率意帖\"夺过来。", 32, 1)
	Cls()
	say("好了，三弟，四弟，不要再*多说了。" .. JY.Person[0].称呼 .. "你先请回吧，我是不会和你动手的。", 33, 0)
	Cls()
	Cls()
end
OEVENTLUA[2063] = function ()
	Cls()

	if instruct_4(213) == false then
		do return end

		Cls()
	end

	meet_self(33)
	say("这……这是……我在前人笔记之中见过这记载……上面说刘仲甫是当时国手，却在骊山麓给一个乡下老媪杀得大败，登时呕血数升，那局棋谱便称”呕血谱”。原想只道是个传闻，怎料世上竟然真有这局呕血谱？" .. JY.Person[0].称呼 .. "，可否借老夫抄录副本？", 33, 0)
	Cls()
	say("哈！哈！这”呕血棋谱”是我费尽千辛万苦才得来的，看一次五千万两黄金，看不看随你。", 0, 1)
	Cls()
	say("二哥你瞧，这" .. JY.Person[0].称呼 .. "就是这德性，完全没把我们梅庄放在眼里，先前还说梅庄中没人是他的对手，嚣张极了。", 31, 0)
	Cls()
	say(JY.Person[0].称呼 .. "，别敬酒不吃吃罚酒，我黑白子想要的东西从来没有得不到的，你还是乖乖地交出来吧。", 33, 1)
	Cls()
	say("二哥，别跟他多说废话，咱们三人联手，量他插翅也难飞。", 32, 0)
	Cls()
	say("枉费梅庄在江湖上的声名如此响亮，想不到尽是一群倚多欺少之辈，可笑可笑。", 0, 1)
	Cls()
	say("三弟，四弟，咱们梅庄可别让这个家伙瞧扁了，就让我来会一会，看他多大能耐。", 33, 0)
	Cls()

	if WarMain(45, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	Cls()
	instruct_13()
	addthing(181, 1)
	Cls()
	say("我就说嘛，你们这几个老头子根本就不够看，我瞧啊，那什么大庄主想必也没什么料。不过既然来了，就把他叫出和我比划比划。", 0, 1)
	Cls()
	say("臭" .. JY.Person[0].称呼 .. "！有种别跑！", 33, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 10, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 11, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 16, 1, 0, 2064, 0, 0, 6064, 6064, 6064, -2, -2, -2)
	instruct_3(-2, 17, 1, 0, 2064, 0, 0, 6052, 6052, 6052, -2, -2, -2)
	instruct_3(-2, 18, 1, 0, 2064, 0, 0, 6058, 6058, 6058, -2, -2, -2)
	instruct_17(-2, 1, 37, 34, 0)
	Cls()
	instruct_13()
end
OEVENTLUA[2064] = function ()
	Cls()
	say("看您老一脸英气凛然，王者之尊的样子，想必是梅庄的大庄主。", 0, 1)
	Cls()
	say("不敢当，正是老夫。不知" .. JY.Person[0].称呼 .. "到我梅庄来有何贵事？", 34, 0)
	Cls()
	say("我听江湖上传言贵庄内卧虎藏龙，高手如云，一时心生好奇，特来探个究竟。", 0, 1)
	Cls()
	say("我梅庄四友隐居江南已久，对江湖之事早已淡如轻烟，什么卧虎藏龙，高手如云，不过是武林中人随口胡诌罢了。", 34, 0)
	Cls()
	say("我看也是如此，其它那三位庄主真是废物点心，三两下就被我解决了。", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "，你！", 32, 0)
	Cls()
	say("这个我已听我那三个兄弟说过，不过对于外在的声名利禄我们早已抛诸脑后，也不会在乎武林上对我们的评论！" .. JY.Person[0].称呼 .. "请慢走，老夫不送了。", 34, 0)
	Cls()
end
OEVENTLUA[2065] = function ()
	Cls()

	if instruct_4(212) == false then
		do return end

		Cls()
	end

	meet_self(34)
	say("\"广陵散\"！！！这\"广陵散\"绝响于人间已久，今日得睹古人名谱，实是不胜之喜。妙极！和平中正，却又清绝幽绝。高量雅致，深藏玄机，便这么神游琴韵，片刻之间已然心怀大畅。", 34, 0)
	Cls()
	say("大庄主道号\"黄钟公\"，自是琴中高手。看大庄主读此琴谱时悠心自在，神情平和之状，果是不求声名利禄的世外高人，令小辈万分钦羡。此谱虽然难得，却也不是什么值钱的东西，我留在身上也没用，大庄主就拿去吧。", 0, 1)
	Cls()
	say("常言道：无功不受禄，你我素无渊源，焉可受你这等厚礼？听我那三个兄弟说道，只须本庄有人武功胜过你，便可得那四样东西，那老朽可不能白占这个便宜。小兄弟，咱们便来比划几招如何？", 34, 0)
	Cls()
	say("好，前辈请。", 0, 1)
	Cls()

	if WarMain(46, 0) == false then
		Cls()
		instruct_15()
		Cls()

		return
	end

	Cls()
	instruct_13()
	say("小兄弟武艺精深，令老朽衷心折服，那\"广陵散\"老夫是无福消受了。", 34, 0)
	Cls()
	say("大哥，为了那四样书画，也顾不得那么多了，咱们四兄弟一起上吧。", 32, 1)
	Cls()
	say("不可如此，咱们为了那些书画以老欺小已是不该，更岂可以多胜少。", 34, 0)
	Cls()
	say("那咱们就请地牢那个老怪……", 33, 1)
	Cls()
	say("＜终于说到正主了，嘿嘿……怎么在地牢里？……＞", 0, 0)
	Cls()
	say("二弟！住嘴！", 34, 1)
	Cls()
	say("大哥，没问题的，有我们在旁边守着，那老怪物跑不掉的。", 33, 0)
	Cls()
	say("二弟你还说！" .. JY.Person[0].称呼 .. "，敝庄中已无可胜你之人，你就请回吧。", 34, 1)
	Cls()
	instruct_3(-2, 15, -2, 0, 2066, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 14, -2, 0, 2066, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 13, 1, 0, 2066, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 12, -2, 0, 2066, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 16, -2, 0, 2067, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 18, -2, 0, 2068, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 17, -2, 0, 2069, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(-2, 0, 0, 0, 0, 0, 2072, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 2, 0, 0, 0, 0, 2072, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 1, 0, 0, 0, 0, 2072, 0, 0, 0, -2, -2, -2)
end
OEVENTLUA[2066] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，你请回吧。", 34, 0)
	Cls()
	Cls()
end
OEVENTLUA[2067] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，好样的，记得有空再来找我，咱们好好聊聊。", 33, 0)
	Cls()
	Cls()
end
OEVENTLUA[2068] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，\"率意帖\"可否借我*再看一眼？", 32, 0)
	Cls()
	Cls()
end
OEVENTLUA[2069] = function ()
	Cls()
	say("哼！", 31, 0)
	Cls()
	Cls()
end
OEVENTLUA[2070] = function ()
	Cls()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_2(22, 1)
	Cls()

	return
end
OEVENTLUA[2071] = function ()
	Cls()
	instruct_17(-2, 1, 13, 22, 0)
	instruct_17(-2, 1, 12, 22, 2898)
	Cls()
end
OEVENTLUA[2072] = function ()
	Cls()
	instruct_3(-2, 17, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 18, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 16, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 5, 1, 0, 2068, 0, 0, 5766, 5766, 5766, -2, -2, -2)
	instruct_3(-2, 6, 1, 0, 2068, 0, 0, 5768, 5782, 5768, -2, -2, -2)
	instruct_3(-2, 3, 1, 0, 2069, 0, 0, 5750, 5764, 5750, -2, -2, -2)
	instruct_3(-2, 9, 1, 0, 2073, 0, 0, 6062, 6062, 6062, -2, -2, -2)
	instruct_3(-2, 0, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	Cls()
end
OEVENTLUA[2073] = function ()
	Cls()

	if instruct_16(35) == false then
		say("我梅庄之中一定有人可以打败" .. JY.Person[0].称呼 .. "！", 33, 0)
		Cls()
		say("＜嘿嘿，我当然知道，向大哥都已经告诉我了……＞哦？不知是哪一位？", 0, 1)
		Cls()
		say("这个，这个，我再和我大哥说说，" .. JY.Person[0].称呼 .. "请稍后再来。", 33, 0)
		Cls()
		say("＜嗯，这位高人这么难见，一定是高人中的高人，下次来应该叫令狐大哥一起来，好为他治伤＞", 0, 1)
		Cls()

		return
	end

	say(JY.Person[0].称呼 .. "，好久不见，近来可好？", 33, 0)
	Cls()
	say("＜这么客气，一定有诈，还是小心得好＞托你的福，一切还好。", 0, 1)
	Cls()
	say("敝庄实另有一位朋友，听说" .. JY.Person[0].称呼 .. "的武功如此了得，说什么也要和你较量几手。", 33, 0)
	Cls()
	say("＜嘿嘿，终于……＞这样啊，好！没问题，就请二庄主替我引见引见。", 0, 1)
	Cls()
	say("那位朋友一向不习惯阳光下的生活，所以将自己关在梅庄下的地洞中。", 33, 0)
	Cls()
	say("＜天底下还有这种人，喜欢把自己关在地洞里，真不愧是高人啊，就是与众不同＞", 0, 1)
	Cls()
	instruct_14()
	instruct_3(-2, 3, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 6, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 5, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 14, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 9, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	instruct_3(-2, 25, 1, 0, 2074, 0, 0, 6066, 6066, 6066, -2, -2, -2)
	instruct_17(-2, 1, 29, 30, 0)
	instruct_19(20, 25)
	instruct_40(1)
	Cls()
	instruct_13()
	say("那人就在下面的地窖里，门我已经打开了，" .. JY.Person[0].称呼 .. "快下去吧。", 33, 0)
	addevent(82, 8, 1, 2075, 1, 6078)
	Cls()
end
OEVENTLUA[2074] = function ()
	Cls()
	say("那人就在下面的地窖里，门*我已经打开了，" .. JY.Person[0].称呼 .. "快下去*吧。", 33, 0)
	addevent(82, 8, 1, 2075, 1, 6078)
	Cls()
end
OEVENTLUA[2075] = function ()
	Cls()
	instruct_3(-2, 9, 1, 0, 0, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	meet_self(26)
	say("您就是不喜欢阳光，甘愿呆在地下的那位前辈高人吧？晚辈这厢有礼了。", 0, 1)
	Cls()
	say("不喜欢阳光？哈哈哈，这是天大的笑话！你以为老子是自愿呆在在西湖牢底的吗？" .. JY.Person[0].称呼 .. "，你是谁？怎么进来的？", 26, 0)
	Cls()
	say("梅庄的四位庄主想要在下的几样东西，但是却没本事打赢在下，所以就让在下来这地洞里向老前辈讨教。", 0, 1)
	Cls()
	say("几样东西？一定是琴棋书画之类的狗屁玩意，这四个家伙就喜欢附庸风雅。你能把他们打败，看来功夫还可以，有资格跟老子过几招。", 26, 0)
	Cls()
	say("其实晚辈此次到梅庄来，并非是为了与前辈比武较量，是向问天向大哥说……", 0, 1)
	Cls()
	say("向问天？是他叫你来的？＜向问天一向对我忠心耿耿，他叫此人来，一定是要想办法救我出去的＞", 26, 0)
	Cls()
	say("是的。这位令狐大哥受了重伤，内力全无，向大哥说老前辈有办法可以医治。", 0, 1)
	Cls()
	say("哦？让我看看……嗯，你体内有数个异种真气乱窜……嗯，我的确有一种神功可治此伤……你叫什么名字？是哪个门派的？", 26, 0)
	Cls()
	say("晚辈令狐冲，是华山门下。", 35, 1)
	Cls()
	say("华山派的掌门还是岳不群吧？这个人是个道貌岸然的伪君子，不值一提。不过华山派有一位风清扬风老剑客，剑术精湛，我一向是很佩服的。", 26, 0)
	Cls()
	say("晚辈有幸，曾得风老前辈传授剑术。", 35, 1)
	Cls()
	say("你是风清扬得传人？哈哈，好，好，我这吸星大法本不愿传给岳不群的徒弟，既然你是风清扬的传人，老夫就没什么顾忌啦。", 26, 0)
	Cls()
	instruct_41(35, 65, 1)
	Cls()
	say("小兄弟，梅庄那四个老家伙还在外面看着呢，我们不管真假总要比试比试。进招吧！", 26, 0)
	Cls()

	JY.Person[26].生命 = JY.Person[26].生命 - 500

	if WarMain(211, 0) == false then
		Cls()
	end

	JY.Person[26].生命 = JY.Person[26].生命 + 500

	Cls()
	instruct_13()
	say("小兄弟，你的功夫的确不错，再来试试老夫这套剑法……哈哈哈哈哈哈哈……", 26, 0)
	Cls()
	say("啊……", 35, 1)
	Cls()
	instruct_14()
	null(-2, 8)
	instruct_32(212, -1)
	instruct_32(214, -1)
	instruct_32(213, -1)
	instruct_32(215, -1)
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(55, 23, 0, 0, 0, 0, 0, 6074, 6074, 6074, -2, -2, -2)
	instruct_3(55, 22, 0, 0, 0, 0, 0, 6062, 6062, 6062, -2, -2, -2)
	instruct_3(55, 21, 0, 0, 0, 0, 0, 6050, 6050, 6050, -2, -2, -2)
	instruct_3(55, 20, 0, 0, 0, 0, 0, 6066, 6066, 6066, -2, -2, -2)
	instruct_3(55, 24, 0, 0, 0, 0, 2076, 0, 0, 0, -2, -2, -2)
	instruct_3(55, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("奇怪，刚才那位老前辈一声吼，我就晕过去了。他的功力真是深不可测啊。" .. JY.Person[0].称呼 .. "，你怎么样？", 35, 0)
	Cls()
	say("还好，还好，不知道这个老前辈是谁，武功真是厉害。", 0, 1)
	Cls()
	say("他传给你的吸星大法，我看像是真的，你以后练练试试，也许你的伤就能治好。", 0, 1)
	Cls()
	say("嗯，我想向大哥应该不会骗我们。", 35, 0)
	Cls()
	say("不过向大哥叫我们来这里似乎另有目的，我也说不清楚，感觉怪怪的，我们先出去吧。", 0, 1)
	Cls()
	say("好。", 35, 0)
	null(-2, 9)
	Cls()

	local var_112_0 = JY.Person[35].主功体

	stop_ng(35)
	instruct_35(35, 2, 88, 700)
	instruct_46(35, 600)
	instruct_45(35, 80)
	instruct_48(35, 100)
	star_ng(35, var_112_0)
end
OEVENTLUA[2076] = function ()
	Cls()
	say("你这臭" .. JY.Person[0].称呼 .. "，看你做了什么好事？", 33, 0)
	Cls()
	say("我早该知道天底下那有这么好的事情，原来这一切都是你设计出来的诡计。", 34, 1)
	Cls()
	say("你这" .. JY.Person[0].称呼 .. "，竟然利用我们所好，实在太可恶了。", 32, 0)
	Cls()
	say("你们在那你一言我一句的，唱双簧啊！", 0, 1)
	Cls()
	say(JY.Person[0].称呼 .. "，你真是太大胆了，竟敢把任老怪给放了，看我饶不饶你！", 31, 0)
	Cls()
	say("大哥，别跟这" .. JY.Person[0].称呼 .. "罗嗦了，此时再也顾不得什么以老欺小的狗屁道义了。先将这" .. JY.Person[0].称呼 .. "捉上黑木崖，向东方教主请罪，否则咱们可就吃不完兜着走了。", 33, 1)
	Cls()
	say("好，咱们一起上。", 34, 0)
	Cls()
	say("谁怕谁！乌龟怕铁鎚！四个一起上最好，省得我麻烦。", 0, 1)
	Cls()

	if WarMain(47, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	Cls()
	instruct_13()
	say(JY.Person[0].称呼 .. "，你可知你放走的是谁？", 31, 0)
	Cls()
	say("不就是一位不喜欢阳光，喜欢生活在地洞里的老前辈吗？", 0, 1)
	Cls()
	say("你是真不知还是假不知，你放走了任老怪，就是与东方教主和我日月神教为敌。", 32, 0)
	Cls()
	say("我们是奉教主之命，在此看守任老怪的，你居然利用我们的弱点救他出去。", 33, 1)
	Cls()
	say("你要知道，任老怪重出江湖，江湖上又将是一场血雨腥风。那个小子，你是华山派的吧，任我行重出江湖可能第一个要灭掉的就是你华山派！", 31, 0)
	Cls()
	say("什么……？", 35, 1)
	Cls()
	say("别说了，得赶紧回黑木崖向东方教主报告这件事。走！", 34, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 23, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 22, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 21, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 20, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	say("那个人，那个人就是任我行，日月神教的前任教主？？！！", 35, 0)
	Cls()
	say("令狐大哥，你接下来有什么打算？", 0, 1)
	Cls()
	say("你刚才也听到了，任我行重出江湖是一件大事，我要赶去福建，向我师父禀报。", 35, 0)
	Cls()
	say("那好吧，令狐大哥，咱们就此别过，后会有期。", 0, 1)
	Cls()
	instruct_3(128, 41, 0, 0, 0, 0, 2077, 0, 0, 0, -2, -2, -2)
	instruct_17(128, 1, 11, 4, 0)
	instruct_3(128, 38, 0, 0, 0, 0, 0, 5962, 5962, 5962, -2, -2, -2)
	instruct_3(128, 39, 0, 0, 0, 0, 0, 7166, 7166, 7166, -2, -2, -2)
	instruct_3(128, 40, 0, 0, 0, 0, 0, 7152, 7152, 7152, -2, -2, -2)
	instruct_3(128, 37, 0, 0, 0, 0, 0, 7148, 7148, 7148, -2, -2, -2)
	null(57, 15)
	addevent(128, 34, 1, 12813, 1, 10426)
	addevent(28, 78, 1, 9289, 1, -2)
	instruct_21(35)
end
OEVENTLUA[2077] = function ()
	Cls()
	instruct_14()
	null(-2, 3)
	instruct_3(-2, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_45(35, 40)
	instruct_35(19, 0, 48, 999)
	instruct_47(19, 80)
	instruct_35(36, 0, 48, 600)

	JY.Person[36].修炼物品 = 78

	instruct_47(36, 100)
	instruct_45(36, 100)
	instruct_46(36, 800)
	instruct_48(36, 300)
	instruct_35(79, 0, 34, 900)
	instruct_47(79, 100)
	instruct_46(79, 1000)
	instruct_48(79, 400)
	instruct_13()
	say("你终于醒了，你怎么会昏倒在林家的向阳老宅？", 19, 0)
	Cls()
	say("师父，徒儿得知任我行重出江湖，就想向师父通禀此事，当我到了福建的时候看到有人夺了去林师弟的辟邪剑谱，我杀了那人，抢了回来。可我也受了重伤，迷迷糊糊的昏了过去。师父，我怎么到了这里？是您救我回来的么？", 35, 1)
	Cls()
	say("今儿早晨到平之的向阳巷老宅去，在门外见你晕在地下。冲儿，辟邪剑谱你放在了什么地方？这是平之的物事，该当由他收管。", 19, 0)
	Cls()
	say("我受伤晕倒，蒙师父所救。此后这剑谱，便不在我身上。", 35, 1)
	Cls()
	say("令狐冲！依你说来，倒是师父私吞了剑谱？", 36, 0)
	Cls()
	say("弟子不敢。不过弟子昏迷后真的不知道剑谱的下落了。", 35, 1)
	Cls()
	say("哼！师父，定是令狐冲贪恋我家祖传的剑谱，私藏在秘密的地方，却跟咱们做戏。", 36, 0)
	Cls()
	say("＜这种情况，我要不要帮令狐冲呢？＞", 0, 1)
	Cls()

	if DrawStrBoxYesNo(-1, -1, "是否帮令狐冲？", C_WHITE, CC.DefaultFont) then
		say("令狐兄，林兄弟。", 0, 1)
		Cls()
		instruct_30(11, 4, 12, 4)
		say("林兄弟，你的祖传之物得而复失，这种心情我们可以理解，但是从我和令狐兄弟的交往过程中，我可以担保拿走剑谱的绝对另有其人，咱们慢慢调查，不能妄下结论，以免伤了同门之谊。", 0, 1)
		Cls()
		say("同门之谊？哼。他的剑法已经远高于我了，早已不将我当作他的师父了，他不仅不听师训，结交奸邪，还和魔教长老杀害我正派弟子，还会念什么同门之谊？从今日起，我把你逐出师门，以后不要再说你是我华山门下了。", 19, 0)
		Cls()
		say("……岳掌门，令狐兄弟的确做错了不少事，您可以按门规处罚，但是逐出门墙的责罚，是不是有些太重了？", 0, 1)
		Cls()
		say("魔教任教主的小姐对他照顾有加，他早已跟他们勾结在一起，还要我这师父干什么？", 19, 0)
		Cls()
		say("魔教任教主的小姐？师父这话不知从何说起？虽然听说那任我行有个女儿，可是弟子从来没见过。", 35, 1)
		Cls()
		say("孽徒，到了此刻，你又何必再说谎？那位任小姐召集平一指给你医病，还送你上少林，这你还能抵赖的掉么？", 19, 0)
		Cls()
		say("她……她……盈盈是任教主之女？这……这真是从何说起？弟子当真不知呀。", 35, 1)
		Cls()
		say("你聪明伶俐，何等机警，怎会猜想不到她便是任我行之女？令狐冲，今天念在你重伤在身，我不为难你，我已经搜过你的身上了，剑谱现在不在你的身上，限你三日之内把剑谱乖乖交出来，否则自古正邪不两立，下次再见面的时候不是我杀了你，就是你杀了我。你好自为之吧。姗儿，平之，我们走。", 19, 0)
		Cls()
		say("哼。", 36, 1)
		Cls()
		say("令狐冲，你以后就不再是我的大师兄了。你要是真拿了小林子的剑谱，最好趁早交出来！", 79, 0)
		Cls()
		say("师父、小师妹……", 35, 1)
		Cls()
		instruct_14()
		instruct_3(-2, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(-2, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		Cls()
		instruct_13()
		say("哎，事已至此，令狐大哥不必难过。不知令狐大哥的伤势如何了？", 0, 1)
		Cls()
		say("自从修习了任教主的吸星大法，已经好多了。唉……如今师父也不要我了，我真的做错了吗？。", 35, 0)
		Cls()
		say("尊师只是一时误会，我们一起去找剑谱，洗刷你的冤屈。", 0, 1)
		Cls()
		say("也只好如此了。好兄弟，陪我到附近的酒馆喝两杯怎么样？", 35, 0)
		Cls()
		say("好啊，咱们这就走。", 0, 1)
		Cls()
		addevent(128, 42, 1, 2085, 1, 5950)

		if instruct_20() == false then
			instruct_3(-2, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_10(35)
			Cls()

			return
		end

		say("你的队伍已满，我就直接去小村吧。", 35, 0)
		Cls()
		instruct_3(-2, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
		instruct_3(70, 15, 1, 0, 2211, 0, 0, 5722, 5748, 5722, -2, -2, -2)
		Cls()

		return
	end

	say("＜情况复杂了，呵呵。＞", 0, 1)
	Cls()
	say("师父，我是您从小看着长大的，难道您还信不过徒儿的为人吗？", 35, 0)
	Cls()
	say("哼！就因为从小看着你长大，我才会如此痛心。令狐冲啊令狐冲，你怎么就不明正邪之分呢？", 19, 1)
	Cls()
	say("师父，我……", 35, 0)
	Cls()
	say("不要再叫我师父。你的剑法早已超过我，我哪里还有资格做你的师父！魔教任教主的小姐对你照顾有加，你早已跟他们勾结在一起，还要我这师父干什么？", 19, 1)
	Cls()
	say("魔教任教主的小姐？师父这话不知从何说起？虽然听说那任我行有个女儿，可是弟子从来没见过。", 35, 0)
	Cls()
	say("孽徒，到了此刻，你又何必再说谎？那位任小姐召集平一指给你医病，还送你上少林，这你还能抵赖的掉么？", 19, 1)
	Cls()
	say("她……她……盈盈是任教主之女？这……这真是从何说起？弟子当真不知呀。", 35, 0)
	Cls()
	say("你聪明伶俐，何等机警，怎会猜想不到她便是任我行之女？令狐冲，今天念在你重伤在身，我不为难你，我已经搜过你的身上了，剑谱现在不在你的身上，限你三日之内把剑谱乖乖交出来，否则自古正邪不两立，下次再见面的时候不是我杀了你，就是你杀了我。你好自为之吧。姗儿，平之，我们走。", 19, 1)
	Cls()
	say("哼。", 36, 0)
	Cls()
	say("令狐冲，你以后就不再是我的大师兄了。你要是真拿了小林子的剑谱，最好趁早交出来！", 79, 1)
	Cls()
	say("师父、小师妹……。", 35, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	Cls()
	instruct_13()
	instruct_30(11, 4, 12, 4)
	say("令狐大哥，你的内伤好些了吗？", 0, 1)
	Cls()
	say("小兄弟，是你啊。自从修习了任教主的吸星大法，已经好多了。唉……如今师父也不要我了，我真的做错了吗？。", 35, 0)
	Cls()
	say("令狐大哥，我不知道你是不是真的拿了那什么辟邪剑谱。如果你真的拿了，又不想让别人知道，小弟一定替你保密，你放心好了。", 0, 1)
	Cls()
	say("你……连你也不信我？师父、师妹、师弟都不相信我，小兄弟你也不相信我，难道这世上便没有人相信我令狐冲了吗？………………不，不，还有盈盈，我要去找她，我要去找盈盈！", 35, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	addevent(57, 5, 1, 2120, 1, 7018)
	addevent(57, 6, 1, 2120, 1, 5862)
	Cls()
	instruct_13()
end
OEVENTLUA[2080] = function ()
	Cls()

	if instruct_16(35) then
		say("大师兄，师傅知道你上少林求易经经，特地给少林寺方丈送了信，请他传授你易经经治疗伤势，你抓紧去一趟少林吧。", 195, 0, "陆大有")
		say("好，多谢师傅。", 35, 1)
		instruct_3(28, 78, 1, 0, 2081, 0, 0, -2, -2, -2, -2, -2, -2)
	else
		say("见着大师兄了吗？", 195, 0, "陆大有")
	end
end
OEVENTLUA[2081] = function ()
	Cls()

	if instruct_16(35) then
		say("方丈大师，我又来叨扰了。", 35, 0)
		say("令狐少侠，来，让我看看你现在身体如何了。", 70, 1)
		dark()
		light()
		say("令狐少侠，既然只有易筋经可以治疗你的伤势，看来天意如此。", 70, 0)
		say("方丈大师，你愿意传授令狐兄易筋经了？", 0, 1)
		say("阿弥陀佛，救人一命胜造七级浮屠。只是有一样，易筋经乃少林不传之秘，不可外传，因此经老衲与达摩堂各长老商议，由老衲亲收令狐少侠为徒，不知令狐少侠可愿意？", 70, 0)
		say("方丈大师是要我退出华山派，改投少林？", 35, 1)
		say("令狐少侠，性命为重，我想令师也是不会反对的。", 70, 0)
		say("此事绝无可能，我从小就长在华山，师父师娘对我恩重如山，我绝不会退出华山改投他派。", 35, 1)
		say("令狐兄...", 0, 0)
		say("阿弥陀佛。", 70, 1)
	else
		say("阿弥陀佛，习武之道在于循序渐进，施主切忌操之过急。", 70, 0)
	end
end
OEVENTLUA[2085] = function ()
	Cls()

	if instruct_16(35) == false then
		say("唉，有多少风流，便有多少*罪孽。", 20, 0)

		do return end

		Cls()
	end

	meet_self(20)
	say("唉，有多少风流，便有多少*罪孽。", 20, 0)
	Cls()
	say("晚辈令狐冲拜见莫师伯。", 35, 1)
	Cls()
	say("令狐兄弟，魔教的任大小姐*对你情深一往，你可千万不*能辜负她啊。我劝你尽管去*少林将那位任大小姐救了出*来，娶她为妻便是。别人不*来喝你的喜酒，我莫大偏来*喝你三杯。", 20, 0)
	Cls()
	say("去少林救任小姐？莫师伯，*到底少林派为什么要拘留任*小姐？", 35, 1)
	Cls()
	say("你是当真不知，还是明知故*问？你的内伤后来怎地却好*了？是修习了少林派的‘易*筋经’神功，是不是？", 20, 0)
	Cls()
	say("不是。少林派方丈玄慈大师*慈悲为怀，答允传授少林派*无上内功。只是小侄不愿改*投少林派，而这门少林神功*又不能传授派外之人，只好*辜负了方丈大师的一番美意*。", 35, 1)
	Cls()
	say("少林派和你向来并无渊源，*决不能随便传人以本门的无*上神功。玄慈大师答应以‘*易筋经’相授，是因为那日*那日黑木崖任大小姐求见方*丈，说道只须方丈救了你的*性命，她便任由少林寺处置*，要杀要剐，绝不皱眉。这*位任大小姐虽然出身魔教，*但待你的至诚至情，她去到*少林，自无生还之望，但为*了救你，她……她是全不顾*己了。玄慈大师不愿就此杀*她，却也不能放她，因此将*她囚禁在少林寺后的山洞之*中。", 20, 0)
	Cls()
	say("原来如此。盈盈对我情意深*重，我这就去去闯少林，能*救得出她来，那是最好，如*救不出来盈盈，我宁愿死在*少林。", 35, 1)
	Cls()
	say("好，这才是有情有意的真丈*夫！", 20, 0)
	Cls()
	instruct_14()
	null(-2, 42)
	instruct_3(28, 78, 1, 0, 2086, -2, 0, -2, -2, -2, -2, -2, -2)
	Cls()
	instruct_13()
end
OEVENTLUA[2086] = function ()
	Cls()

	if instruct_16(35) == false then
		say("阿弥陀佛，习武之道在于循序渐进，施主切忌操之过急。", 70, 0)
		Cls()

		return
	end

	say("令狐少侠光临敝寺是否是为了任小姐的事情？", 70, 0)
	Cls()
	say("正是，希望大师高抬贵手，放盈盈下山吧。", 35, 1)
	Cls()
	say("你这畜生，竟然为了魔教教主之女而前来少林滋事！", 19, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 77, 0, 0, 0, 0, 0, 5234, 5234, 5234, -2, -2, -2)
	instruct_3(-2, 79, 0, 0, 0, 0, 0, 5958, 5958, 5958, -2, -2, -2)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 5966, 5966, 5966, -2, -2, -2)
	instruct_3(-2, 82, 0, 0, 0, 0, 0, 5950, 5950, 5950, -2, -2, -2)
	instruct_3(-2, 80, 0, 0, 0, 0, 0, 5934, 5934, 5934, -2, -2, -2)
	instruct_3(-2, 81, 0, 0, 0, 0, 0, 5926, 5926, 5926, -2, -2, -2)
	instruct_19(15, 28)
	instruct_40(2)
	Cls()
	instruct_13()
	say("任先生复出，江湖上从此多事，只怕将有无数人命伤在任先生手下。老衲有意屈留任小姐等任先生来救女儿，老纳也好趁机劝说任先生改恶向善，屈留他在敝寺盘桓，诵经礼佛，教江湖上得以太平。", 70, 0)
	Cls()
	say("＜原来他们早已经聚集了高手，就等把任我行引来了＞", 0, 1)
	Cls()
	say("玄慈大师，您心地过于善良，令狐冲是任老怪的乘龙快婿，既然您已经告诉他真相了，咱们也不能放他们下山，免得他们向任老怪通风报信。", 22, 0)
	Cls()

	if WarMain(218, 0) == false then
		Cls()
		instruct_15()
		Cls()

		return
	end

	instruct_3(-2, 83, 0, 0, 0, 0, 0, 7168, 7168, 7168, -2, -2, -2)
	Cls()
	instruct_13()
	say("善哉善哉，看来天意如此，老纳好久不在江湖走动，现在真是后生可畏呀。你们把任小姐带下山去，请几位施主下山后转告任先生以天下苍生的性命为重，少开杀戒。阿弥陀佛。", 70, 0)
	Cls()
	say("冲哥，我就知道你会来救我。方丈大师，您慈悲为怀，小女子永世不忘。", 73, 1)
	Cls()
	say("请方丈放心，我们定会转告，告辞。", 0, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 77, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 82, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 81, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 80, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 79, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 12, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 83, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)

	JY.Person[35].好感度 = JY.Person[35].好感度 + 5

	instruct_3(-2, 78, 1, 0, 9289, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(93, 26, 0, 0, 0, 0, 2087, 0, 0, 0, -2, -2, -2)
	Cls()
	instruct_13()
end
OEVENTLUA[2087] = function ()
	Cls()
	dark()
	light()
	instruct_3(-2, 31, 0, 0, 0, 0, 0, 7656, 7656, 7656, -2, -2, -2)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 7168, 7168, 7168, -2, -2, -2)
	say("冲哥，我想去找我爹爹，你陪我一起去吗？", 73, 0)
	say("好。", 35, 0)
	say(JY.Person[0].称呼 .. "，我陪盈盈走一趟，告辞。", 35, 0)
	say("好", 0, 1)
	instruct_21(35)
	instruct_3(40, 8, 1, 0, 2088, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(40, 9, 1, 0, 2088, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 52, 1, 0, 2088, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 53, 1, 0, 2088, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 54, 1, 0, 2088, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(27, 1, 1, 0, 2089, 0, 0, 5202, 5202, 5202, -2, -2, -2)
	instruct_3(27, 62, 0, 0, 0, 0, 2090, 0, 0, 0, -2, -2, -2)
	instruct_3(27, 33, 0, 0, 0, 0, 0, 5202, 5202, 5202, -2, -2, -2)
	instruct_3(27, 32, 0, 0, 0, 0, 0, 5202, 5202, 5202, -2, -2, -2)
	instruct_3(27, 31, 0, 0, 0, 0, 0, 5202, 5202, 5202, -2, -2, -2)
	instruct_3(27, 30, 0, 0, 0, 0, 0, 5202, 5202, 5202, -2, -2, -2)
	instruct_3(27, 29, 0, 0, 0, 0, 0, 5202, 5202, 5202, -2, -2, -2)
	instruct_3(27, 38, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	instruct_3(27, 37, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	instruct_3(27, 36, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	instruct_3(27, 35, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	instruct_3(27, 42, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(27, 41, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(27, 40, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(27, 39, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(27, 46, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(27, 45, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(27, 44, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(27, 43, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(27, 50, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(27, 49, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(27, 48, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(27, 47, 0, 0, 0, 0, 0, 5180, 5180, 5180, -2, -2, -2)
	instruct_3(27, 24, 0, 0, 0, 0, 0, 5232, 5232, 5232, -2, -2, -2)
	instruct_3(27, 25, 0, 0, 0, 0, 0, 5954, 5954, 5954, -2, -2, -2)
	instruct_3(27, 26, 0, 0, 0, 0, 0, 5968, 5968, 5968, -2, -2, -2)
	instruct_3(27, 27, 0, 0, 0, 0, 0, 5960, 5960, 5960, -2, -2, -2)
	instruct_3(27, 28, 0, 0, 0, 0, 0, 5942, 5942, 5942, -2, -2, -2)
	null(-2, 26)
	null(-2, 31)
	null(-2, 32)
end
OEVENTLUA[2088] = function ()
	Cls()
	say("听说最近五岳剑派又要召开五岳剑派联盟大会了。", math.random(1130, 1142), 0, "酒客")
	say("这有什么的？五岳剑派5年开一次联盟大会，这次又有什么特别的？", math.random(1130, 1142), 1, "酒客")
	say("自然是有的，据说左冷禅修成了寒冰真气，这次要将五派合一，将其他四派变成嵩山四堂。", math.random(1130, 1142), 0, "酒客")
	say("不会吧，其他四派能乐意吗？", math.random(1130, 1142), 1, "酒客")
	say("这可难说了。谁知道呢？", math.random(1130, 1142), 0, "酒客")
end
OEVENTLUA[2089] = function ()
	Cls()

	if JY.Person[0].门派 == 4 then
		say("原来是华山派的师兄，赶快进去吧，大会已经开始了。", 198, 0, "嵩山弟子")
		My_Enter_SubScene(27, 47, 29, 2)
	else
		say("五岳联盟大会，非五岳弟子勿进！", 198, 0, "嵩山弟子")
		instruct_3(27, 58, 0, 0, 0, 0, 2098, 0, 0, 0, -2, -2, -2)
		instruct_3(27, 59, 0, 0, 0, 0, 2098, 0, 0, 0, -2, -2, -2)
		instruct_3(27, 53, 1, 0, 2110, 0, 0, 5704, 5704, 5704, -2, -2, -2)
		instruct_3(27, 54, 1, 0, 2110, 0, 0, 5706, 5706, 5706, -2, -2, -2)
		instruct_3(58, 10, 1, 0, 2111, 0, 0, 5700, 5700, 5700, -2, -2, -2)
		instruct_3(58, 11, 1, 0, 2111, 0, 0, 5702, 5702, 5702, -2, -2, -2)
		null(31, 0)
		null(31, 1)
		instruct_3(31, 14, 1, 0, 2115, 0, 0, 7002, 7002, 7002, -2, -2, -2)
		instruct_3(31, 15, 1, 0, 2115, 0, 0, 7148, 7148, 7148, -2, -2, -2)
		instruct_3(29, 0, 1, 0, 2113, 0, 0, 5710, 5710, 5710, -2, -2, -2)
		instruct_3(29, 1, 1, 0, 2113, 0, 0, 5708, 5708, 5708, -2, -2, -2)
		instruct_3(57, 14, 1, 0, 2114, 0, 0, 5696, 5696, 5696, -2, -2, -2)
		instruct_3(57, 16, 1, 0, 2114, 0, 0, 5694, 5694, 5694, -2, -2, -2)
		instruct_3(40, 8, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
		instruct_3(40, 9, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
		instruct_3(119, 52, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
		instruct_3(119, 53, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
		instruct_3(119, 54, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	end
end
OEVENTLUA[2090] = function ()
	Cls()
	instruct_14()
	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_13()
	instruct_25(47, 29, 33, 29)
	say("我五岳剑派同气连枝，百余年来携手结盟，早便如同一家。兄弟忝为五派盟主，亦已多历年所。只是近来武林中出了不少大事，兄弟与五岳剑派的前辈师兄们商量，均觉若非连成一派，统一号令，来日大难，只怕不易抵挡。", 22, 0)
	Cls()
	say("不知左盟主和那一派的前辈师兄们商量过了？怎地我莫某人不知其事？", 20, 1)
	Cls()
	say("兄弟适才说到，武林中出了不少大事，五派非合而为一不可。其中一件大事，便是咱们五派中人，自相残杀，不顾同盟义气。莫大先生，我嵩山派弟子费师弟，在衡山城外丧命。有人亲眼目睹，说是你莫大先生下的毒手，不知此事可真？", 22, 0)
	Cls()
	say("并无其事！谅莫某这一点微末道行，怎杀得了那大嵩阳手？", 20, 1)
	Cls()
	say("莫兄，这件事你也不用太过担心，等我五派合并之后，莫兄和我也是师兄弟了。死者已矣，活着的人又何必再逞凶杀，多造杀孽？莫兄，你说是不是呢？", 22, 0)
	Cls()
	say("哼！", 20, 1)
	Cls()
	say("南岳衡山派于并派之议，是无意见了。东岳泰山派天门道兄，贵派意思如何？", 22, 0)
	Cls()
	say("泰山派自祖师爷东灵道长创派以来，已三百余年。贫道无德无能，不能发扬光大泰山一派，可是这三百多年的基业，说什么也不能自贫道手中断绝。并派之议，万万不能从命。", 23, 1)
	Cls()
	say("道兄此言差矣。五派合并后我五岳派声势壮大，其下各个弟子，那一个不沾到光？道兄何必为这区区泰山派掌门一职的私心，而阻扰了全派的大业。", 22, 0)
	Cls()
	say("我这掌门人，做不做有什么干系？只是泰山一派，恁说也不能在我手中给人并吞。", 23, 1)
	Cls()
	say("道兄说了这么多，心中却就是为了放不下掌门人的名位。", 22, 0)
	Cls()
	say("你真道我是如此私心？好，从此刻起，我这掌门人不做了……", 23, 1)
	Cls()
	say("道兄既然不是泰山掌门，那泰山派的事自然不是由道兄做主了，泰山派的诸位可有反对的么？", 22, 0)
	Cls()
	say("我等没有异议。", 1034, 0)
	say("你们…………", 23, 1)
	Cls()
	say("＜这老道性子太急了，一被激就着了人家的道＞", 0, 0)
	Cls()
	say("左盟主已然身为五岳剑派盟主，位望何等尊崇，何必定要并五派，由一人任掌门。", 21, 1)
	Cls()
	say("师太此言差矣。左某只是提议五派合并。这掌门之位，当然还是要由我五派之人推举出来。", 22, 0)
	Cls()
	instruct_25(33, 29, 47, 29)
	instruct_30(47, 29, 35, 29)
	say("我看别讨论了，学武之人，就在武功下见真章。", 0, 1)
	Cls()
	say("这位华山派的弟子怎么如此着急？照如此说，岳先生是赞成这“比剑夺帅”的方法了？", 22, 0)
	Cls()
	say("比剑夺帅，原也是一法，但只可点到为止，以免伤了和气。", 19, 1)
	Cls()
	say("原来华山派是赞成并派的，我天门就先来领教你华山派的高招。", 23, 0)
	Cls()
	instruct_45(19, 200)
	instruct_47(19, 100)

	if DrawStrBoxYesNo(-1, -1, "是否要观看岳不群挑战其他四派的详实剧情？", C_ORANGE, CC.DefaultFont) then
		WarMain(30)
		Cls()
		instruct_13()
		say("让我定闲来领教领教华山派的高招。", 21, 0)
		Cls()
		WarMain(31)
		Cls()
		instruct_13()
		say("让我莫大来领教领教华山派的高招。", 20, 1)
		Cls()
		WarMain(32)
		Cls()
		instruct_13()
		say("真所谓“长江后浪推前浪”华山派岳先生为了今天，想必已筹划很久了吧。若左某也败了，我嵩山派自当奉岳先生为掌门。", 22, 0)
		Cls()
		WarMain(33)
		Cls()
		instruct_13()
	end

	dark()
	light()
	say("......", 22, 0)
	Cls()
	DrawStrBox(-1, -1, "一番大战，岳不群武功厉害，一举打败了其它几派掌门人", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	say("我不该低估你的。岳不群。想不到你的心计比我还深，左某是输你一筹。", 22, 0)
	say("侥幸，侥幸。不知在座各位是否还有异议？", 19, 1)

	if has_thing(321) or has_thing(320) then
		DrawStrBox(-1, -1, "你忽然意识到，这是一个千载难得的机会，这是一个一步登天的机会", C_ORANGE, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
		DrawStrBox(-1, -1, "可是你在五岳派根基浅薄，如是比武胜利后没有人认可", C_ORANGE, CC.DefaultFont)
		DrawStrBox(-1, -1, "就会成为孤家寡人，人人喊打", C_ORANGE, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
		DrawStrBox(-1, -1, "很冒险，你不由的犹豫不决", C_ORANGE, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()

		if yesno("要冒险出头吗？") then
			for iter_122_0 = 1, 40 do
				NewDrawString(-1, -1, "五岳盟主剧情---开启", C_GOLD, CC.DefaultFont + iter_122_0 * 2)
				ShowScreen()

				if iter_122_0 == 40 then
					lib.Delay(2000)
				else
					lib.Delay(1)
				end
			end

			say("等等！", 0, 1)
			say("岳不群，你刚才使得是辟邪剑法？", 0, 1)
			say("休的胡说，还不退下。各位，小孩子不懂事，还望各位见谅。", 19, 0)
			say("你若不承认，不如让我们较量一下，让各师伯师叔再仔细看看。", 0, 1)
			say("今日乃是五岳联盟大会，你不要胡闹。", 19, 0)
			say("我看这可不是胡闹，岳不群，原来你真偷了林家的辟邪剑法？", 22, 1)
			say("今日大会乃是比武夺帅，和使用什么武功可无什么关系。", 19, 0)
			say("咱们可也没说其他人不能参加，只要是五岳剑派的弟子，人人都可参加比武？各位认为如何？", 22, 1)
			say("正是，人人都可参加比武，你华山派的小弟子也是可以的。", 23, 0)
			say("不错。", 20, 0)
			say("我也同意。", 21, 1)
			say("既如此，那就让你们再看看我华山的气功。", 19, 0)

			if WarMain(35, 0) == false then
				instruct_15()
				Cls()

				do return end

				Cls()
			end

			say("......", 19, 0)
			say("恭喜" .. JY.Person[0].称呼 .. "了，从今日起你就是五岳剑派的掌门了。", 22, 0)
			say(JY.Person[0].称呼 .. "，恭喜", 20, 1)
			say(JY.Person[0].称呼 .. "，恭喜", 21, 0)
			say(JY.Person[0].称呼 .. "，恭喜", 23, 1)
			say("各位可是真心恭喜我做掌门？", 0, 1)
			say("自然是真的。", 22, 0)
			say("好了，我知道你们是觉得我年纪小，好欺瞒，才推我当这个掌门的。这个却先不提，最近任我行重出江湖，必会去黑木崖找东方不败夺回魔教教主之位，这却是我五岳剑派消灭魔教的良机。", 0, 1)
			say("不知掌门有何打算？", 22, 0)
			say("今日已经晚了，还请各位移驾华山，我们详细商谈一下，如何趁此机会消灭了魔教。", 0, 1)
			say("如此甚好。", 20, 0)
			say("如此甚好。", 23, 1)

			JY.Person[0].门派 = 5
			JY.Person[0].门派等级 = 5
			JY.Person[0].中原罪恶值 = 0

			AddPersonAttrib(0, "声望", 50)
			Cls()
			dark()
			null(27, 53)
			null(27, 54)
			null(29, 0)
			null(29, 1)
			null(31, 0)
			null(31, 1)
			null(57, 14)
			null(57, 16)
			null(58, 10)
			null(58, 11)
			addevent(57, 29, 0, 2092, 3, -2)
			instruct_3(57, 18, 0, 0, 0, 0, 0, 5232, 5232, 5232, -2, -2, -2)
			instruct_3(57, 20, 0, 0, 0, 0, 0, 5970, 5970, 5970, -2, -2, -2)
			instruct_3(57, 25, 0, 0, 0, 0, 0, 5944, 5944, 5944, -2, -2, -2)
			instruct_3(57, 26, 0, 0, 0, 0, 0, 5952, 5952, 5952, -2, -2, -2)
			addevent(57, 5, 1, 2217, 1, 7018)
			addevent(57, 6, 1, 2215, 1, 5862)
			addevent(57, 0, 1, 2101, 1)
			addevent(57, 43, 1, 2101, 1, 5178)
			addevent(57, 44, 1, 2101, 1, 5178)
			addevent(57, 15, 1, 2101, 1, 5178)
			addevent(57, 45, 1, 2101, 1, 5180)
			addevent(57, 46, 1, 2101, 1, 5182)
			addevent(57, 47, 1, 2101, 1, 5182)
			instruct_3(57, 55, 1, 0, 2091, 0, 0, 5960, 5960, 5960, -2, -2, -2)

			JY.Person[19].好感度 = 0

			instruct_3(-2, 49, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 46, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			instruct_3(-2, 62, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
			light()

			return
		else
			say("君子不立危墙之下，还是算了。", 0, 1)
		end
	end

	say("嗯，五岳派今日新创，百废待举，在下只能总领其事，各派的事务，还是由各派原任掌门主持。咱们五岳派今日合并，若不能和衷同济，那么五派合并云云，也只是虚名而已。在下无德无能，暂且执掌本门门户，种种兴革，还须和众位兄弟从长计议，在下不敢自专。现下天色已晚，各位都辛苦了，今天就到此为止，他日再到华山来共商大事。", 19, 0)
	dark()
	instruct_3(27, 53, 1, 0, 2110, 0, 0, 5704, 5704, 5704, -2, -2, -2)
	instruct_3(27, 54, 1, 0, 2110, 0, 0, 5706, 5706, 5706, -2, -2, -2)
	instruct_3(58, 10, 1, 0, 2111, 0, 0, 5700, 5700, 5700, -2, -2, -2)
	instruct_3(58, 11, 1, 0, 2111, 0, 0, 5702, 5702, 5702, -2, -2, -2)
	null(31, 0)
	null(31, 1)
	instruct_3(31, 14, 1, 0, 2115, 0, 0, 7002, 7002, 7002, -2, -2, -2)
	instruct_3(31, 15, 1, 0, 2115, 0, 0, 7148, 7148, 7148, -2, -2, -2)
	instruct_3(29, 0, 1, 0, 2113, 0, 0, 5710, 5710, 5710, -2, -2, -2)
	instruct_3(29, 1, 1, 0, 2113, 0, 0, 5708, 5708, 5708, -2, -2, -2)
	instruct_3(57, 14, 1, 0, 2114, 0, 0, 5696, 5696, 5696, -2, -2, -2)
	instruct_3(57, 16, 1, 0, 2114, 0, 0, 5694, 5694, 5694, -2, -2, -2)
	instruct_3(40, 8, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(40, 9, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 52, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 53, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 54, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	light()
	instruct_3(-2, 49, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 46, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 62, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
end
OEVENTLUA[2091] = function ()
	Cls()

	if has_thing(67) == false then
		say("师傅，咱们华山派的紫霞秘籍呢？徒儿想观摩一下。", 0, 1)
		say("你这个逆徒，你到底想干什么？", 19, 0)
		say("师傅，识时务者为俊杰，你就好好在华山呆着，我相信你不会置华山于不顾的。", 0, 1)
		say("哼！", 19, 0)
		addthing(67, 1)
	elseif has_thing(93) then
		say("师傅，你过得怎么样了？", 0, 1)
		say("哼。", 19, 0)
		say("师傅，你也别生气了，以后华山派发扬光大了，你也是功臣之一。", 0, 1)
	else
		say("师傅，你过得怎么样了？", 0, 1)
		say("你这个逆徒，我要看看你是怎么把华山派毁掉的。", 19, 0)
		say("师傅，你不用担心，我会将华山派发扬光大的。", 0, 1)
		say("不过师傅，你也知道我年轻识浅，现在初任五岳掌门，只怕镇压不住阵脚，还需要师父帮忙啊。", 0, 1)
		say("逆徒，你还想我帮你？", 19, 0)
		say("无论如何，现在华山派统一了五岳剑派，师父要是想华山派此次失败，从此一蹶不振，甚至派毁人亡，那也由得师父。", 0, 1)
		say("你到底要做什么？", 19, 0)
		say("我要趁此良机，攻打魔教。", 0, 1)
		say("你疯了？", 19, 0)
		say("还请师父相助。", 0, 1)
		say("哼，你想得倒好。", 19, 0)
	end
end
OEVENTLUA[2092] = function ()
	Cls()
	null(-2, 29)
	dark()
	light()
	say("各位都到了啊。", 0, 1)
	My_Enter_SubScene(57, 16, 26, 1)
	say("那咱们五岳派第一次长老会议就开始吧。", 0, 0)
	say("......", 20, 1)
	say("......", 21, 0)
	say("......", 22, 1)
	say("......", 23, 0)
	say("怎么？难道昨天的五岳大会是过家家？今天就全都不认我这个掌门了？", 0, 0)
	say("哼，我是支持少侠做这个掌门的。", 21, 1)
	say("老夫也支持少侠。", 20, 0)
	say("我也支持少侠，总比岳不群那个伪君子，还有旁边这个阴谋家要好。", 23, 0)
	say("多谢三位，那就是有四家支持我做这个掌门了，左先生怎么说？", 0, 1)
	say("哼，认赌服输，我也支持少侠做五岳掌门。", 22, 0)
	say("很好。不过我也知道我年纪太轻，你们心里是不服气的。", 0, 1)
	say("此次任老魔重出江湖，我料定他必会重上黑木崖，找东方不败一雪前耻，此是我五岳剑派从未有过的良机。", 0, 1)
	say("咱们要齐上黑木崖，将魔教打个落花流水。", 0, 1)
	say("少侠可有把握？", 23, 0)
	say("放心，咱们等任老魔和东方不败打个两败俱伤，然后出手，必然成功。", 0, 1)
	say("此次攻打黑木崖，咱们看谁出力最多，依功行赏。如有功劳比我大的，我也可以让出这掌门之位。", 0, 1)
	say("掌门，此事不可。", 21, 0)
	say("是啊，老父也只支持少侠。", 20, 1)
	say("不错。", 23, 0)
	say("掌门金口玉言，岂可收回，你们敢不听掌门号令么？", 22, 0)
	say("好了好了，武林之中，强者为尊，也没什么？不过左先生，如果你这次还输了又怎么说？", 0, 1)
	say("那自然是唯掌门马首是尊，以后你要打谁我就打谁。", 22, 0)
	say("呵呵。好。", 0, 1)
	say("战斗之前，军情为首，左先生，你多派探子出去打探黑木崖情形，有消息立刻通知各人，咱们悄悄上黑木崖。", 0, 1)
	say("莫大师伯，你联系少林武当两派，请他们派高手相助。", 0, 1)
	say("师太请准备粮草伤药，到时候一番大战，必定用得上。", 0, 1)
	say("天门师伯派人在江湖上放出消息，就说五岳大会纷争不断，家师和左先生相争双双重伤，迷惑一下武林诸派。", 0, 1)
	say("我华山派居中联络，事关重大，还请诸位小心。", 0, 1)
	say("好。", 20, 0)
	say("好。", 21, 1)
	say("好。", 23, 0)
	say("尊掌门号令。", 22, 1)
	null(-2, 18)
	null(-2, 20)
	null(-2, 25)
	null(-2, 26)
	instruct_3(26, 82, 1, 0, 2093, 0, 0, 5178, 5178, 5178, -2, -2, -2)
end
OEVENTLUA[2093] = function ()
	Cls()
	say("拜见掌门。", 195, 0)
	say("怎么样了？", 0, 1)
	say("任老魔已经上了黑木崖，几位师叔师伯已经跟了进去，我奉命在这儿接应掌门。", 195, 0)
	say("很好。你带人守好这里，不要放走一个魔教中人。", 0, 1)
	say("是，掌门。", 195, 0)
	dark()
	My_Enter_SubScene(26, 47, 28, 2)
	instruct_3(26, 3, 0, 0, 0, 0, 0, 5232, 5232, 5232, -2, -2, -2)
	instruct_3(26, 2, 0, 0, 0, 0, 0, 5954, 5954, 5954, -2, -2, -2)
	instruct_3(26, 1, 0, 0, 0, 0, 0, 5968, 5968, 5968, -2, -2, -2)
	instruct_3(26, 0, 0, 0, 0, 0, 0, 5944, 5944, 5944, -2, -2, -2)
	instruct_3(26, 4, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(26, 5, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(26, 6, 0, 0, 0, 0, 0, 5204, 5204, 5204, -2, -2, -2)
	instruct_3(26, 7, 0, 0, 0, 0, 0, 5204, 5204, 5204, -2, -2, -2)
	instruct_3(26, 8, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(26, 9, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(26, 10, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	instruct_3(26, 11, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	light()
	say("大家都到了啊。", 0, 1)
	say("不错，我们已经看到任老魔带人打入了黑木崖，如今黑木崖一片混乱，正是咱们一举扫灭魔教的良机。", 21, 0)
	say("还等什么？咱们赶快进去吧。", 23, 0)
	say("少林武当来人了吗？", 0, 1)
	say("我看还是别等了，他们是不会派人来的，或者等咱们打完了他们就会出现了。", 22, 0)
	dark()
	instruct_3(26, 12, 0, 0, 0, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	light()
	say("禀掌门，武当三代大弟子宋青书派人传信，说武当发现了打伤张无忌的玄冥二老，张三丰已经带人下山追杀去了，希望各位见谅。", 195, 0)
	say("玄冥二老？", 0, 1)
	say("什么玄冥二老，没听说过。我就说了他们不会来，咱们五岳派一向没指望过别人，咱们进去吧。", 22, 0)
	dark()
	null(-2, 12)
	instruct_3(26, 32, 0, 0, 0, 0, 0, 5420, 5420, 5420, -2, -2, -2)
	light()
	say("阿弥陀佛，少林慧聪见过各位掌门，朝廷九王爷要上少林礼佛，方丈大师和各位长老忙于接待，实在不能脱身，特派小僧前来相助各位攻打魔教。", 210, 0, "少林弟子")
	say("哼。", 23, 1)
	say("哼。", 22, 0)
	say("好了，咱们进去吧，请各位师伯带人分别从四门攻入。小和尚，你在这儿守着，协助我们这儿的弟子围剿魔教逃散之人可好。", 0, 1)
	say("是。", 210, 0, "少林弟子")
	say("给我冲。", 23, 1)
	say("跟我走。", 20, 0)
	say("跟我走。", 21, 1)
	say("跟我来。", 22, 0)
	dark()
	null(-2, 0)
	null(-2, 1)
	null(-2, 2)
	null(-2, 3)
	null(-2, 4)
	null(-2, 5)
	null(-2, 6)
	null(-2, 7)
	null(-2, 8)
	null(-2, 9)
	null(-2, 10)
	null(-2, 11)
	null(-2, 32)
	addevent(26, 33, 0, 2094, 3, -2)
	addevent(26, 34, 0, 2094, 3, -2)
	addevent(26, 35, 0, 2094, 3, -2)
	addevent(26, 13, 0, 0, 0, 8274)
	addevent(26, 14, 0, 0, 0, 10224)
	addevent(26, 19, 1, 0, 0, 10212)
	addevent(26, 20, 1, 0, 0, 10204)
	addevent(26, 21, 1, 0, 0, 10214)
	addevent(26, 22, 1, 0, 0, 10198)
	addevent(26, 23, 1, 0, 0, 10212)
	addevent(26, 24, 1, 0, 0, 10198)
	addevent(26, 25, 1, 0, 0, 10212)
	addevent(26, 26, 1, 0, 0, 10204)
	addevent(26, 15, 0, 0, 0, 8214)
	addevent(26, 16, 0, 0, 0, 7172)
	addevent(26, 17, 0, 0, 0, 7656)
	addevent(26, 18, 0, 0, 0, 7168)
	addevent(26, 27, 0, 0, 0, 5894)
	addevent(26, 28, 0, 0, 0, 5894)
	addevent(26, 29, 0, 0, 0, 5894)
	addevent(26, 30, 0, 0, 0, 5894)
	addevent(26, 31, 0, 0, 0, 5894)
	instruct_3(26, 82, 1, 0, 2101, 0, 0, 5178, 5178, 5178, -2, -2, -2)
	light()
end
OEVENTLUA[2094] = function ()
	Cls()
	dark()
	light()
	say("东方不败，今日终于……终于教你落在我手里。", 26, 0)
	say("卑鄙，如不是你们用莲弟威胁，即使你们一起上，也不是我的对手。", 27, 1)
	meet_self(27)
	say("不错，你武功比我高，我很是佩服。", 26, 0)
	say("可惜，你练了那“葵花宝典”，照着宝典上的秘方，自宫练气，连性子也变了。不然又如何能受我威胁，导致今日一败涂地。", 26, 0)
	say("我知你当年传我《葵花宝典》没安好心，不过我却是感激你的，整日在江湖上争权夺利有什么意思？我终于知道自己想要的是什么，即使几天死了也不后悔，我只求你救救莲弟。", 27, 1)
	say("哈哈哈，你要我救他，我偏要他死，你将我关在西湖地下时没想到会有今日吧，哈哈哈哈哈。", 26, 0)
	Cls()
	say("哈哈哈。", 0, 1)
	say("哈哈哈哈哈。", 0, 1)
	say("什么人？", 26, 0)
	My_Enter_SubScene(26, 18, 28, 1)
	say(JY.Person[0].称呼 .. "，你怎么也来了？", 35, 1)
	say("哎，令狐兄，你怎么也来凑这热闹来了？", 0, 0)
	say("不过你这次却是帮错人啦！", 0, 0)
	say("我...", 35, 1)
	say("我知道你为人侠义，至情至性，不过", 0, 1)
	say("你知道这位任先生是魔教老魔头，你可知道他杀过多少人？在他的命令下又多少人家破人亡？", 0, 1)
	say(JY.Person[0].称呼 .. "我...", 35, 0)
	say("哎，令狐兄，你好好想想，咱们到西湖去救出任老魔就真的是碰巧么？", 0, 1)
	say("如果没有我在你一个人会怎么样？会不会被关在地牢里永远出不来？我两冒着奇险将他救了出来，可你再看看他，可有半分感激的模样？", 0, 1)
	say("我...", 35, 0)
	say(JY.Person[0].称呼 .. "，爹爹不会害令狐大哥的。", 73, 1)
	say("不错，你不要挑拨我们的关系。", 26, 0)
	say("任小姐，你十分了解你的爹爹，你真的觉得他为了自己的安危也不会害令狐兄？", 0, 1)
	say("......", 73, 0)
	say(JY.Person[0].称呼 .. "，不知你来黑木崖是为了帮我们还是帮东方不败？", 366, 1, "向问天")
	say("我？我自然是为了覆灭魔教而来，现在魔教首脑全在这儿，正好免了我一个一个寻找。", 0, 0)
	say("哈哈哈，好狂的小子，你不会以为自己就能灭了我魔教数万人吧？", 26, 1)
	say("自然不会，我此行带了五岳剑派数千人齐至，你魔教虽然人多势众，不过现在一场火并，不知道还有几人能够战斗的？", 0, 0)
	say("好奸猾的小子，我怎么没有早看出来你如此阴险？", 366, 1, "向问天")
	say("闭嘴，没让你说话。", 0, 0)
	say("令狐兄，你是帮魔教消灭华山派？还是帮我们华山派消灭魔教？", 0, 0)
	say("我...", 35, 1)
	say("很遗憾，我不想逼你，不过你应该明白今日的情况已经不可避免，众位师叔师伯现在已经和魔教在生死相博，就现在这功夫，已经不知道死了多少人了。", 0, 0)
	say("我...我是华山派弟子，我不会背叛华山派的。", 35, 1)
	say("只是，只是盈盈对我恩深义重，不知可否放过她？", 35, 1)
	say("放心，我不是嗜杀之人，不止是任小姐，即使是任先生，如是愿意放下屠刀，不造杀孽，也不是不能饶他一命。", 0, 0)
	say("狂妄的小子，我先领教领教你的功夫。", 366, 1, "向问天")
	say("等等，向左使，你受伤颇重，你先疗伤，我来领教领教这位" .. JY.Person[0].称呼 .. "的功夫。", 26, 0)
	say("等等。", 22, 1)
	dark()
	instruct_3(26, 48, 0, 0, 0, 0, 0, 5944, 5944, 5944, -2, -2, -2)
	instruct_3(26, 49, 0, 0, 0, 0, 0, 5204, 5204, 5204, -2, -2, -2)
	instruct_3(26, 50, 0, 0, 0, 0, 0, 5204, 5204, 5204, -2, -2, -2)
	light()
	say("掌门，我没来晚吧？不如这个任老魔交给我吧。", 22, 1)
	say("掌门？", 366, 0, "向问天")
	say("好叫任先生向先生得知，我五岳剑派已经并为一派，这是我五岳剑派的第一任掌门。", 22, 1)
	say("哦？想不到，想不到，" .. JY.Person[0].称呼 .. "，不如我们合作如何？你我联手，少林武当只怕也得望风而逃，到时我是武林盟主，你是武林副盟主，那是何等威风？", 26, 0)
	say("哈哈哈，哈哈哈，真是坐井观天，你真以为自己有那么厉害？左先生，你来试试任先生的功夫吧。（你似笑非笑的看了左冷禅一眼）", 0, 1)
	say("好，任我行，请！", 22, 0)

	JY.Person[26].攻击力 = JY.Person[26].攻击力 + 200

	if WarMain(351, 0) == false then
		Cls()
	end

	JY.Person[26].攻击力 = JY.Person[26].攻击力 - 200

	say("哎，左先生，你这心比天高，却是一败再败，你将自己看得太高了，没有摆正自己的位置啊！", 0, 1)
	say("我...", 22, 0)
	DrawStrBox(-1, -1, "只见任我行吸了左冷禅的寒冰真气，虽然强制压制，仍是手掌微微颤抖。", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	say("好了，你看看我是怎么打败任老魔的。", 0, 1)
	say("要车轮战吗？教主，不要上当，大家一起上！", 366, 0, "向问天")
	dark()
	addevent(26, 51, 0, 0, 0, 5968)
	addevent(26, 52, 0, 0, 0, 5172)
	addevent(26, 53, 0, 0, 0, 5172)
	light()
	say("掌门，我们来了。", 23, 0)
	dark()
	addevent(26, 54, 0, 0, 0, 5954)
	addevent(26, 55, 0, 0, 0, 5190)
	addevent(26, 56, 0, 0, 0, 5190)
	light()
	say("掌门，我们来了。", 20, 0)
	dark()
	addevent(26, 57, 0, 0, 0, 5940)
	addevent(26, 58, 0, 0, 0, 5200)
	addevent(26, 59, 0, 0, 0, 5200)
	light()
	say("掌，掌门...", 21, 0)
	say("师太你受伤了，先行疗伤要紧。", 0, 1)
	say("我没事，此战关系重大，先将魔教消灭再说。", 21, 0)
	say("你们几个照顾好师太。", 0, 1)
	say("是。", 197, 0)
	say("好了，任先生，你魔教确实是人数众多，可是现在高手还剩下几个呢？现在，我给你一个轰轰烈烈的结局。或者，你直接投降？", 0, 1)
	say("哼。", 26, 0)
	say("教主，你先走！", 366, 1, "向问天")
	say("保护教主。", 202, 0, "日月教徒")
	say("教主，你先走，我们拼死挡住他们。", 202, 1, "日月教徒")
	say("向问天，我早想和你较量一下了。", 23, 0)

	if WarMain(352, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	null(-2, 27)
	null(-2, 28)
	null(-2, 29)
	null(-2, 30)
	null(-2, 31)
	addevent(26, 16, 0, 0, 0, 10204)
	addevent(26, 15, 0, 0, 0, 10212)
	addevent(26, 27, 1, 0, 0, 10198)
	addevent(26, 28, 1, 0, 0, 10212)
	addevent(26, 29, 1, 0, 0, 10204)
	light()
	say(JY.Person[0].称呼 .. "，别杀我爹爹！", 73, 1)
	say("放心，看在令狐兄和你的面子上，我不会杀他，不过他刚才重伤情况下又吸了我那么多内力，只怕已经活不了啦！", 0, 0)
	say("任教主，如果你愿意，我还是有办法保你一命的。", 0, 0)
	say("成王败寇，你杀了我吧。", 26, 1)
	say(JY.Person[0].称呼 .. "，求你救救我爹爹！", 73, 0)
	DrawStrBox(-1, -1, "你一指向任我行丹田点去。", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	say("啊~，你，你废了我武功？你好狠~", 26, 0)
	say("你体内根本容不下我那么多的真气。再不处置只怕马上就会爆炸，我既然答应了要救你，你自然不会死。", 0, 1)
	say("你，你好阴险...", 366, 0, "向问天")
	say("嗯？你命倒是大，居然还没有死？", 0, 1)
	say("哼...", 366, 0, "向问天")
	say("来人，请任教主到华山山下小农庄养老，从此远离江湖是非，享受人生。", 0, 1)
	addevent(26, 35, 1, 2101, 1, 5180)
	addevent(26, 33, 1, 2101, 1, 5182)
	say("是，掌门。任教主，请了！", 1075, 0, "武当弟子")
	say("等等，把我也带走，我要保护教主。", 366, 1, "向问天")
	dark()
	null(-2, 15)
	null(-2, 16)
	light()

	if has_thing(65) == false then
		say("哦？任教主还将这本秘籍贴身收藏，是什么？", 0, 1)
		say("你休~", 26, 0)
		say("哼，拿来吧你。", 0, 1)
		say("你~", 26, 0)
		addthing(65, 1)
	end

	say("哎，任教主也是一代人杰，如此能安享晚年也算不错。任小姐，你放心，你随时可以去华山脚下看你爹爹。", 0, 1)
	say("多谢" .. JY.Person[0].称呼 .. "，我爹爹现在受了如此打击，想是会心灰意冷，我要去陪陪他。", 73, 0)
	say("盈盈，我陪你一起去，" .. JY.Person[0].称呼 .. "，告辞。", 35, 1)
	say("告辞。令狐兄，我现在是掌门，我收回师父对你的惩罚。记得回华山。", 0, 0)
	dark()
	null(-2, 17)
	null(-2, 18)
	light()
	My_Enter_SubScene(26, 18, 28, 2)
	say("东方不败，任我行已经完了，你想我怎么处理你？或者你还有力气和我打一场？", 0, 1)
	say("我想请你救救莲弟，他快死了。", 27, 0)

	if JY.Person[0].医疗能力 >= 250 or instruct_16(28) or instruct_16(16) then
		say("如果我能救活他，你愿意听从我号令吗？", 0, 1)
		say("哈哈哈，我东方不败统领魔教，威压江湖，如何能听从他人命令？", 27, 0)
		say("不过我可以答应你，为你出手一次，算是报你救命之恩。", 27, 0)
		say("也好。", 0, 1)
		dark()
		null(-2, 14)
		addevent(26, 14, 0, 0, 0, 10444)
		light()
		say("我，我没死？", 1126, 0)
		say("莲弟，莲弟，你醒了？太好了。", 27, 1)
		say("好了，回去好好休养一段时间就可以康复了。听说你练的是葵花宝典", 0, 0)
		say("怎么？你也想练？", 27, 1)
		say("给你！我很期待多一个姐妹呢。", 27, 1)
		say("......", 0, 0)
		addthing(93, 1)
		say("东方不败，我想邀请你去小村安居，那是个山清水秀的地方，没有世俗干扰。", 0, 1)
		say("也好，给我安排一个安静的地方，没事不要来打扰我。", 27, 0)
		say("没问题，没问题。我安排人带你过去。", 0, 1)
		dark()
		null(-2, 13)
		null(-2, 14)
		addevent(70, 118, 1, 2219, 1, 8278)
		addevent(70, 124, 1, 2096, 1, 10446)
		addevent(70, 127, 1, 2097, 1, -2)
		light()

		JY.Person[27].好感度 = 55
	else
		say("他？没救了。", 0, 1)
		say("是吗？真可惜啊！", 27, 0)
		say("哼，想偷袭我？", 0, 1)

		JY.Person[27].生命 = JY.Person[26].生命 - 900
		JY.Person[27].生命最大值 = JY.Person[26].生命最大值 - 900

		if WarMain(353, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		if JY.Person[0].暗器技巧 == 299 then
			say("好厉害的功夫。", 0, 1)
			say("你只感觉以前的关隘豁然开朗。", 0, 2)
			write_nump(5, 3)

			JY.Person[0].暗器技巧 = 300
		end

		JY.Person[27].生命 = JY.Person[26].生命 + 900
		JY.Person[27].生命最大值 = JY.Person[26].生命最大值 + 900

		dark()
		null(-2, 13)
		addevent(26, 13, 0, 0, 0, 7966)
		light()
		say("可惜，可惜。", 0, 1)
		addthing(93, 1)
		addthing(151, 1)
		say("这是？《笑傲江湖》，原来在这儿。", 0, 1)
	end

	My_Enter_SubScene(26, 18, 28, 1)
	say("好了，这儿大事已定，留一些弟子收拾善后。", 0, 1)
	say("好，掌门，这次真是大快人心啊。", 23, 0)

	JY.Person[23].好感度 = 70

	say("不错。", 20, 1)
	say("咳咳...，掌，掌门...，咱们完成了祖师们多年没有完成的心愿，即使死了也值得了。", 21, 0)
	say("咱们伤亡如何？", 0, 1)
	say("禀掌门，嵩山伤亡187人，衡山伤亡123人，泰山伤亡158人，恒山伤亡92人，华山伤亡55人。", 195, 0)
	say("哦？", 0, 1)
	say("你华山怎么伤亡这么少？", 22, 0)
	say("嗯？", 0, 1)
	say("对对，是咱们华山怎么伤亡这么少？", 22, 0)
	say("禀掌门，是因为岳老掌门一直在暗中出手相助，很多弟子都是他救下的。", 195, 1)
	say("嗯，师父毕竟对华山感情深厚啊！", 0, 0)
	say("各位师叔师伯，先回各自驻地整顿一下，下月15咱们再汇聚华山，商议下一步行止。", 0, 0)
	say("师太，你先回去好好休养，身体要紧。", 0, 0)
	say("左先生，你怎么样了？", 0, 0)
	say("无妨。", 22, 1)
	say("很好，咱们走吧。", 0, 0)
	dark()
	null(-2, 33)
	null(-2, 34)
	null(-2, 35)
	null(-2, 48)
	null(-2, 49)
	null(-2, 50)
	null(-2, 48)
	null(-2, 49)
	null(-2, 50)
	null(-2, 51)
	null(-2, 52)
	null(-2, 53)
	null(-2, 54)
	null(-2, 55)
	null(-2, 56)
	null(-2, 57)
	null(-2, 58)
	null(-2, 59)
	null(-2, 82)
	addevent(26, 5, 1, 2101, 1, 5180)
	addevent(26, 9, 1, 2101, 1, 5182)
	addevent(26, 35, 1, 2101, 1, 5180)
	addevent(26, 33, 1, 2101, 1, 5182)
	addevent(57, 29, 0, 2102, 3, -2)
	instruct_3(57, 18, 0, 0, 0, 0, 0, 7158, 7158, 7158, -2, -2, -2)
	instruct_3(57, 20, 0, 0, 0, 0, 0, 5954, 5954, 5954, -2, -2, -2)
	instruct_3(57, 25, 0, 0, 0, 0, 0, 5944, 5944, 5944, -2, -2, -2)
	instruct_3(57, 26, 0, 0, 0, 0, 0, 5968, 5968, 5968, -2, -2, -2)
	addevent(57, 43, 1, 2100, 1, 5178)
	addevent(57, 44, 1, 2100, 1, 5178)
	addevent(57, 15, 1, 2100, 1, 5178)
	addevent(57, 48, 1, 2100, 1, 5178)
	addevent(57, 49, 1, 2100, 1, 5178)
	addevent(26, 82, 0, 2117, 3, -2)
	light()
end
OEVENTLUA[2096] = function ()
	Cls()
	say("真是憋闷，给我倒壶酒来！", 1126, 0)
	say("来了来了，莲弟，你要觉得烦闷了咱们就去扬州玩玩怎么样？", 27, 1)
	say("哼，你做的菜不够香，我得去外面打打牙祭。", 1126, 0)
	say("好，咱们就去。莲弟，我会好好练习厨艺的，总会让你过得像大老爷一样。", 27, 1)
end
OEVENTLUA[2097] = function ()
	Cls()
	addthing(151, 1)
	null(-2, 127)
end
OEVENTLUA[2098] = function ()
	Cls()
	instruct_3(-2, 49, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 50, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 48, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 47, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 46, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 45, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 44, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 43, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 42, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 41, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 40, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 39, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 38, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 37, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 36, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 35, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 34, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 33, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 32, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 31, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 30, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 29, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 28, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 26, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 25, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 24, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	instruct_3(-2, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	null(-2, 58)
	null(-2, 59)
	null(-2, 62)
end
OEVENTLUA[2099] = function ()
	Cls()
	say("岳不群居然做了五岳剑派的新一任盟主了。", 1130, 0, "酒客")
	say("奇怪啊奇怪。", 1131, 1, "酒客")
	say("左冷禅居然败在岳不群手里，看来以前是高看他了。", 1132, 0, "酒客")
end
OEVENTLUA[2100] = function ()
	Cls()

	local var_131_0 = math.random(5)

	if var_131_0 == 1 then
		say("掌门好。", 192, 0, "五岳弟子")
	elseif var_131_0 == 2 then
		say("我们五岳剑派灭了魔教，武当少林也是远远不如的。", 193, 0, "五岳弟子")
	elseif var_131_0 == 3 then
		say("听说新掌门武功高强，打败了任老魔，还收服了东方不败。", 196, 0, "五岳弟子")
		say("啊，掌门好。", 196, 0, "五岳弟子")
	elseif var_131_0 == 4 then
		say("现在已经开始招收新弟子了，报名人数远远超过往年，这是要大兴之兆啊！", 208, 0, "五岳弟子")
	else
		say("现在少林在积极联系崆峒青城昆仑等门派，咱们可得小心在意。", 204, 0, "五岳弟子")
	end
end
OEVENTLUA[2101] = function ()
	Cls()

	if math.random(3) == 1 then
		say("掌门好。", 192, 0, "五岳弟子")
	else
		say("拜见掌门。", 192, 0, "五岳弟子")
	end
end
OEVENTLUA[2102] = function ()
	Cls()
	dark()
	light()
	say("各位都到了啊。", 0, 1)
	My_Enter_SubScene(57, 16, 26, 1)
	say("令狐兄？你这是？", 0, 1)
	say("定闲师太上次受伤太重，回山不久就离世了。临走前委托我暂代处理恒山事宜。", 35, 0)
	say("竟有此事？真是可惜，宣布下去，咱们五岳剑派全体为师太举丧一个月。", 0, 1)
	say("是。", 192, 0, "五岳剑派")
	say("那咱们五岳派第二次长老会议就开始吧。", 0, 1)
	say("首先，我宣布，咱们五岳剑派成立长老会，四位师叔师伯并令狐兄成为第一任长老，各位可有意见？", 0, 1)
	say("掌门，我等无有意见。", 35, 0)
	say("无有意见。", 20, 0)
	say("无有意见。", 23, 1)
	say("左先生呢？", 0, 0)
	say("无有意见。", 22, 1)
	say("很好。", 0, 0)
	say("华山派成为我五岳剑派总堂，四派原驻地成为五岳剑派分堂，仍由你们自己安排弟子管理，每月往总堂上交部分资源即可。", 0, 0)
	say("如此甚好。", 35, 1)
	say("五岳剑派成立剑阁，令狐兄为第一任剑阁阁主。其余几位长老并入剑阁一同进行剑法研究创新，并弟子训练。", 0, 0)
	say("尊掌门法旨。", 35, 1)
	say("没有意见。", 20, 0)
	say("没有意见。", 23, 1)
	say("没有意见。", 22, 0)
	say("另外，安排人手，帮我在江湖上寻找天书。", 0, 1)
	say("天书？传说中得到就会无敌天下的天书？", 22, 1)
	say("不要多问，暗中进行就好，下来各位长老好好训练弟子。以后每月会安排弟子进行比试的。", 0, 1)
	say("好。", 20, 0)
	say("好。", 23, 1)
	say("好。", 22, 0)
	dark()
	null(-2, 18)
	null(-2, 20)
	null(-2, 25)
	null(-2, 26)
	null(-2, 29)
	addevent(57, 50, 1, 2103, 1, 5944)
	addevent(57, 51, 1, 2104, 1, 5954)
	addevent(57, 52, 1, 2105, 1, 5968)
	addevent(57, 53, 1, 2211, 1, 7158)
	addevent(57, 54, 1, 2213, 1, 7002)
	addevent(57, 2, 1, 2100, 1, 5172)
	addevent(57, 45, 1, 2100, 1, 5204)
	addevent(57, 46, 1, 2100, 1, 5198)
	addevent(57, 47, 1, 2100, 1, 5198)
	addevent(27, 63, 1, 2100, 1, -2)
	addevent(27, 65, 1, 2100, 1, -2)
	addevent(27, 66, 1, 2100, 1, -2)
	addevent(58, 12, 1, 2100, 1, -2)
	addevent(58, 13, 1, 2100, 1, -2)
	addevent(29, 3, 1, 2100, 1, -2)
	addevent(29, 4, 1, 2100, 1, -2)
	addevent(29, 13, 1, 2100, 1, -2)
	addevent(31, 3, 1, 2100, 1, -2)
	addevent(31, 6, 1, 2100, 1, -2)
	addevent(31, 7, 1, 2100, 1, -2)
	light()
end
OEVENTLUA[2103] = function ()
	Cls()

	if has_thing(128) == false then
		say("掌门，这是我嵩山派剑谱，还请掌门参详。", 22, 0)
		say("很好，你有心了。", 0, 1)
		addthing(128, 1)

		return
	end

	say("不知掌门还有什么安排，不会让我一直做这点小事吧？", 22, 0)
	say("不要着急，先好好训练弟子，以后有的你忙的。", 0, 1)
end
OEVENTLUA[2104] = function ()
	Cls()

	if JY.Person[0].门派 == 10 then
		say("盟主，你的成就不得不让人佩服。", 20, 0)
	else
		say("掌门，你又来剑阁视察了？", 20, 0)
		say("来看看，来看看。", 0, 1)
		say("掌门人武功高强，实在让人佩服。", 20, 0)
	end
end
OEVENTLUA[2105] = function ()
	Cls()

	if JY.Person[0].门派 == 10 then
		say("盟主，我会紧紧跟紧你的脚步的。", 23, 0)
	else
		say("想不到左冷禅这个阴谋家也落到这个地步，爽啊！", 23, 0)
		say("掌门人，你有什么事吗？", 23, 0)
		say("没有，没有，你忙你的。", 0, 1)
	end
end
OEVENTLUA[2110] = function ()
	Cls()
	say("哼！岳不群这老贼平时道貌岸然的样子，没想到城府这么深。真是小看他了。", 22, 0)
end
OEVENTLUA[2111] = function ()
	Cls()
	say("真是惭愧，我五岳剑派闹了这么多的风波，让" .. JY.Person[0].称呼 .. "见笑了。左冷禅和岳不群这两人为争权夺利，弄得五岳剑派人仰马翻，我得和另外两位掌门去制止他们。", 20, 0)
end
OEVENTLUA[2113] = function ()
	Cls()
	say("真是惭愧，我五岳剑派闹了这么多的风波，让" .. JY.Person[0].称呼 .. "见笑了。左冷禅和岳不群这两人为争权夺利，弄得五岳剑派人仰马翻，我得和另外两位掌门去制止他们。", 23, 0)
end
OEVENTLUA[2114] = function ()
	Cls()
	say("左冷禅，你想不到吧，我华山派又成为五岳盟主了，哼哼哼。", 19, 0)
end
OEVENTLUA[2115] = function ()
	Cls()
	null(27, 1)
	null(27, 62)
	say("令狐兄？你怎么在这里。", 0, 1)
	say("定闲师伯上次受到嵩山派的人袭击受了内伤，后来又带伤参加五岳大会，回来后不久就病倒了。临去世前委托我暂代处理恒山事宜。", 35, 0)
	say("原来如此。", 0, 1)
	say("任姑娘你好。", 0, 1)
	say(JY.Person[0].称呼 .. "，你好。", 73, 0)
	say("禀告掌门，外面有人求见。", 197, 0)
	say("让他进来吧。", 35, 0)
	dark()
	addevent(31, 16, -2, -2, -2, 5892)
	light()
	say("属下参见圣姑。", 202, 0, "日月教徒")
	say("有什么事？", 73, 1)
	say("任教主召集了帮众前往了黑木崖，请圣姑并令狐少侠前往黑木崖汇合。", 202, 0, "日月教徒")
	say("知道了，你回去吧。", 73, 1)
	say("是。", 202, 0, "日月教徒")
	dark()
	null(-2, 16)
	light()
	say("令狐大哥，你看？", 73, 1)
	say("咱们也去吧，也能帮帮你爹爹和向大哥的忙。", 35, 0)
	say("令狐兄，我来帮你。", 0, 1)
	say("多谢，我先赶过去，咱们黑木崖汇合。", 35, 0)
	dark()
	null(-2, 14)
	null(-2, 15)
	null(26, 82)
	addevent(26, 33, 0, 2116, 3, -2)
	addevent(26, 34, 0, 2116, 3, -2)
	addevent(26, 35, 0, 2116, 3, -2)
	addevent(26, 13, 0, 0, 0, 8274)
	addevent(26, 14, 1, 0, 0, 10224)
	addevent(26, 19, 0, 0, 0, 5888)
	addevent(26, 20, 0, 0, 0, 5888)
	addevent(26, 21, 0, 0, 0, 5888)
	addevent(26, 22, 0, 0, 0, 5888)
	addevent(26, 23, 0, 0, 0, 5888)
	addevent(26, 24, 0, 0, 0, 5888)
	addevent(26, 25, 0, 0, 0, 5888)
	addevent(26, 26, 0, 0, 0, 5888)
	addevent(26, 15, 0, 0, 0, 8214)
	addevent(26, 16, 0, 0, 0, 7172)
	addevent(26, 17, 0, 0, 0, 7656)
	addevent(26, 18, 0, 0, 0, 7168)
	addevent(26, 27, 0, 0, 0, 5894)
	addevent(26, 28, 0, 0, 0, 5894)
	addevent(26, 29, 0, 0, 0, 5894)
	addevent(26, 30, 0, 0, 0, 5894)
	addevent(26, 31, 0, 0, 0, 5894)
	light()
end
OEVENTLUA[2116] = function ()
	Cls()
	dark()
	null(-2, 82)
	null(-2, 33)
	null(-2, 34)
	null(-2, 35)
	light()
	say("莲弟~莲弟~，你们居然敢伤了莲弟，今天一个也别想走了。", 27, 0)
	say("东方不败，没想到你变成了这个鬼样子，居然会为了这个废物受伤。", 26, 1)
	meet_self(27)
	say("任我行，你找我算账可以，但你不该伤了莲弟的。", 27, 0)
	say(JY.Person[0].称呼 .. "，你来了。", 35, 1)
	My_Enter_SubScene(26, 18, 27, 2)
	say("我来了，令狐兄，你们怎么都受伤了。嗯？这个老妖婆是谁？", 0, 0)
	say("找死~", 27, 1)
	say(JY.Person[0].称呼 .. "，小心！", 26, 0)

	if WarMain(54, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	addevent(26, 19, 1, 0, 0, 10212)
	addevent(26, 20, 1, 0, 0, 10204)
	addevent(26, 21, 1, 0, 0, 10214)
	addevent(26, 22, 1, 0, 0, 10198)
	addevent(26, 23, 1, 0, 0, 10212)
	addevent(26, 24, 1, 0, 0, 10214)
	addevent(26, 25, 1, 0, 0, 10212)
	addevent(26, 26, 1, 0, 0, 10214)
	light()
	say("东方不败，今日终于……终于教你落在我手里。", 26, 0)
	say("任教主，终究是……是……终究是……是我输了。", 27, 1)
	say("哈！哈！你这大号，可得改一改罢？", 26, 0)
	say("倘若单打独斗，你们是不能打败我的。", 27, 1)
	say("不错，你武功比我高，我很是佩服。", 26, 0)
	say("你能这么说，足见男子汉大丈夫气概。唉，冤孽，冤孽，我练了那“葵花宝典”，照着宝典上的秘方，自宫练气，炼丹服药，渐渐的胡子没有了，说话声音变了，性子也变了。我从此不爱女子，把七个小妾都杀了，却……却把全副心意放在莲弟身上。倘若我生为女儿身，那就好了。任教主，你快把我杀了！", 27, 1)
	say("我现在不想杀你了，我也找个地方安养你好了。来人啊，把他带下去。", 26, 0)
	say("你好狠毒！", 27, 0)
	Cls()
	instruct_14()
	instruct_3(-2, 13, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
	My_Enter_SubScene(26, 18, 27, 1)
	instruct_13()
	say("恭喜教主，今日诛却大逆。从此我教在教主庇荫之下，扬威四海。教主千秋万载，一统江湖。", 33, 1)
	say("胡说八道！什么千秋万载？哈！哈！哈！《葵花宝典》啊《葵花宝典》，你终于又回到我手里了，可惜，这并不是常人可以练的。", 26, 0)
	say("这话怎讲？", 0, 1)
	say("这宝典的第一页就注明着，“欲练神功，引刀自宫”，老夫可不会没了脑子，去干这等傻事。哈哈，哈哈……可是宝典上所载的武功实在厉害，任何学武之人，一见之后却不能不动心。东方不败，饶你奸诈似鬼，也猜不透老夫传你“葵花宝典”的用意。你野心勃勃，意存拔扈，难道老夫瞧不出来吗？哈哈，哈哈！", 26, 0)
	say("＜原来当初任教主以“葵花宝典”传他，当初便没怀善意，两人尔虞我诈各怀心机＞", 0, 1)
	say("任我行将那《葵花宝典》放在双掌中一搓，功力到处，原已十分陈旧的册页登时化为碎片。", 0, 2)
	say("等等~，该死！", 0, 1)
	say("你干什么？谁让你将秘籍毁了的。", 0, 1)
	say("大胆，敢如此和教主说话。", 33, 0)
	say(JY.Person[0].称呼 .. "，你？", 26, 0)
	say("东方不败是我打败的，他的战利品自然是我的，谁让你将它毁了的？", 0, 1)
	say(JY.Person[0].称呼 .. "，你想要葵花宝典？如果想要你早说啊，现在却说什么都晚了。对了，东方不败身上还有一本书，让我看看。", 26, 0)
	say("这是...，这是无字天书？ 哈哈哈哈哈~运气，运气，想不到东方不败还能找到这本奇书。", 26, 0)
	say("给我。", 0, 1)
	say("你说什么？大胆！", 33, 0)
	say("闭嘴。" .. JY.Person[0].称呼 .. "，你可知道这是什么书？这不是你能拥有的东西？", 26, 0)
	say("真是不知感恩啊。拿出来，或者死！", 0, 1)
	say(JY.Person[0].称呼 .. "，你...", 35, 0)
	say("令狐兄，这件事你不要管了。", 0, 1)
	say(JY.Person[0].称呼 .. "，不要以为你打败了东方不败就无敌了。", 26, 0)

	if WarMain(55, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	addevent(26, 15, 1, 0, 0, 10212)
	addevent(26, 16, 1, 0, 0, 10204)
	addevent(26, 27, 1, 0, 0, 10214)
	addevent(26, 28, 1, 0, 0, 10198)
	addevent(26, 29, 1, 0, 0, 10212)
	addevent(26, 30, 1, 0, 0, 10214)
	addevent(26, 31, 1, 0, 0, 10212)
	light()
	say(JY.Person[0].称呼 .. "，你别杀我爹爹！", 73, 0)
	say(JY.Person[0].称呼 .. "，你...", 35, 0)
	say("放心，看在令狐兄和你的面子上，我不会杀他，不过他刚才重伤情况下又吸了我那么多内力，只怕已经活不了啦！", 0, 1)
	say("任教主，如果你愿意，我还是有办法保你一命的。", 0, 1)
	say("成王败寇，你杀了我吧。", 26, 0)
	say(JY.Person[0].称呼 .. "，求你救救我爹爹！", 73, 1)
	DrawStrBox(-1, -1, "你一指向任我行丹田点去。", C_ORANGE, CC.DefaultFont)
	ShowScreen()
	lib.Delay(2000)
	Cls()
	say("啊~，你，你废了我武功？你好狠~", 26, 0)
	say("你体内根本容不下我那么多的真气。再不处置只怕马上就会爆炸，我既然答应了要救你，你自然不会死。", 0, 1)
	say("你，你好阴险...", 366, 0, "向问天")
	addevent(26, 16, 0, 0, 0, 7174)
	say("嗯？你命倒是大，居然还没有死？", 0, 1)
	say("哼...", 366, 0, "向问天")
	say("任教主，你已经老了，已经看不清江湖的形势了，我看你还是找个地方养老吧，还能多享受享受人生。", 0, 1)
	say("教...,教主，我们走。", 366, 0, "向问天")
	dark()
	null(-2, 15)
	null(-2, 16)
	light()

	if has_thing(65) == false then
		addthing(65, 1)
	end

	addthing(151, 1)
	say("哎，任教主也是一代人杰，如此能安享晚年也算不错。", 0, 1)
	say("多谢" .. JY.Person[0].称呼 .. "手下留情，我爹爹现在受了如此打击，想是会心灰意冷，我要去陪陪他。", 73, 0)
	say("盈盈，我陪你一起去，" .. JY.Person[0].称呼 .. "，告辞。", 35, 1)
	say("告辞。", 0, 1)
	dark()
	null(-2, 17)
	null(-2, 18)
	light()
	say("可惜，可惜，东方不败，任老魔都不在了，偌大的魔教只怕就此树倒猢狲散了。", 0, 1)
	addevent(26, 82, 0, 2117, 3, -2)
end
OEVENTLUA[2117] = function ()
	Cls()
	dark()
	null(-2, 82)
	light()

	if JY.Person[634].好感度 == 51 then
		say("这就是主上说的乱世之人了，杀~", 363, 0, "隐世杀手2")

		if WarMain(539, 0) == false then
			instruct_15(0)
			instruct_0()

			return
		end

		say("这又是哪方的高手，埋伏在这儿要刺杀我？", 0, 1)

		if math.random(3) == 1 and JY.Person[634].罪恶值 == 1 and has_thing(93) then
			addevent(70, 21, 0, 35, 3, -2, -2, -2)
			addevent(70, 22, 0, 35, 3, -2, -2, -2)
			addevent(70, 44, -2, -2, -2, 7156, -2, -2)
		end
	end

	null(-2, 2)
	null(-2, 12)
	null(-2, 14)
	null(-2, 19)
	null(-2, 20)
	null(-2, 21)
	null(-2, 22)
	null(-2, 23)
	null(-2, 24)
	null(-2, 25)
	null(-2, 26)
	null(-2, 27)
	null(-2, 28)
	null(-2, 29)
	null(-2, 30)
	null(-2, 31)
	null(-2, 32)
	null(-2, 57)
	null(-2, 58)
	null(-2, 59)
end
OEVENTLUA[2120] = function ()
	Cls()
	say("小林子，你别练功了，陪我玩玩吧。", 79, 0)
	say("......", 36, 1)
	say("小林子，你再不说话我就生气了。", 79, 0)
	say("岳姑娘，怎么华山派就你们在？", 0, 1)
	say("爹爹他们去参加五岳大会去了。", 79, 0)
	say("林兄弟这是？", 0, 1)
	say("我的武功太低了，我要给我爹爹妈妈报仇。", 36, 0)
	say("林兄弟，如果你愿意，我可以帮忙，包你能报了此仇。", 0, 1)
	say("父母之仇不可戴天，还请" .. JY.Person[0].称呼 .. "相助！", 36, 0)
	say("小林子，我也去帮你。", 79, 1)
	say("......", 36, 0)
	say("师姐，我的剑谱早已尽数交给你爹*爹了，自己没私自留下一招*半式，你又何必苦苦的跟着*我？", 36, 1)
	say("你老是疑心我爹爹图你的剑*谱，当真好没来由。你如此*损我爹爹，当我是什么人了*？", 79, 0)
	say("哼，令狐冲在福州抢到了剑*谱，毕竟还是拿不去，却落*入了你爹爹手中……", 36, 1)
	say("不，不会的！爹爹说，剑谱*给大师哥拿了去，我曾求他*还给你，他说什么也不肯。", 79, 0)
	say("现下说与你知，也不相干。*那日在福州，那几人抢了剑*谱，却被令狐冲杀死。剑谱*自然是令狐冲得去了。可是*当他身受重伤、昏迷不醒之*际，我搜他身上，剑谱却已*不知去向。剑谱既不在令狐*冲身上，定是给你爹娘取了*去。一回华山，我每晚都躲*在你爹娘卧室之侧的悬崖上*，要从他们的谈话之中，查*知剑谱的所在。", 36, 1)
	say("每天晚上？你真有毅力。", 79, 0)
	say("为报大仇，不得不然。有一*天晚上，你妈妈问你爹爹你*为何要冤枉冲儿偷了我的辟*邪剑谱？说那日令狐冲受伤*昏迷，你妈妈替他止血治伤*时，曾经看到过剑谱，第二*次替他换药，那剑谱就不见*了，其时令狐冲仍然昏迷未*醒。那段时候除了你父母二*人，并无别人进房。还说你*爹爹苦心焦虑，为了保全本*派。只是那辟邪剑法练之有*损无益，劝你爹爹万万不要*修炼。你爹爹说要听你娘的*劝，找时间就设法把剑谱交*给我，再慢慢想法替令狐冲*洗刷清白。你娘说这剑谱于*人有损，不可让我见到，让*你爹爹毁去为是。你爹爹同*意把剑谱毁去，然后立刻开*窗把剑谱扔下天生崖，老天*有眼，剑谱挂在树丫上，我*捡了回来。正是我家祖传的*辟邪剑谱。", 36, 1)
	say("妈妈只道爹爹将剑谱掷入了*天声峡中，其实爹爹早将剑*法记熟，剑谱于他已然无用*，却让你因此而学得了剑法*，是不是？嗯，天意如此。*冥冥之中，老天爷一切早有*安排，要你由此而报你父母*的仇了。那……那……那也*很好，也好。", 79, 0)
	say("你爹爹处心积虑，就是要得*到这辟邪剑谱。从他派你和*令狐冲去福州，到收我为徒*，再把你许配于我，一起去*福建，彻头彻尾都是你爹爹*的阴谋，他把一切都推倒令*狐冲身上，目的就是要得到*我林家的辟邪剑谱。嘿嘿，*君子剑，好一个君子剑！", 36, 1)
	say("我爹爹，我爹爹，他……", 79, 0)
	say("你别跟着我了。" .. JY.Person[0].称呼 .. "，我们走吧！", 36, 1)
	say("小林子，我已经嫁给你了，*我就是你的妻子，今后你走*到哪，我就跟你到哪。", 79, 0)
	addevent(57, 6, 1, 2122, 1, 5862)
	addevent(57, 5, 1, 2217, 1, 7018, -2, -2)
	addevent(27, 1, 1, 2134, 1, -2)
end
OEVENTLUA[2121] = function ()
	Cls()

	if instruct_16(36) then
		say("平之，你来了，听说任我行重出江湖，他必会找东方不败报仇，你如今武功已经小成，就下山去黑木崖打探一下消息吧。", 19, 0)
		say("是，师父。", 36, 1)
		null(26, 82)
		addevent(26, 82, 0, 2125, 3, -2)
		addevent(26, 33, 0, 2126, 3, -2)
		addevent(26, 34, 0, 2126, 3, -2)
		addevent(26, 35, 0, 2126, 3, -2)
		addevent(26, 4, 1, 0, 0, 10212)
		addevent(26, 2, 1, 0, 0, 10204)
		addevent(26, 32, 1, 0, 0, 10214)
		addevent(26, 58, 1, 0, 0, 10198)
	else
		say("左冷禅，你想不到吧，我华山派又成为五岳盟主了，哼哼哼。", 19, 0)
	end
end
OEVENTLUA[2122] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，我们走吧！", 36, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(36)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 36, 0)
		addevent(57, 6, 1, 2122, 1, 5862)
		Cls()

		return
	end
end
OEVENTLUA[2123] = function ()
	Cls()
	say(JY.Person[0].称呼 .. "，我们走吧。", 79, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(79)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 79, 0)
		addevent(57, 6, 1, 2123, 1, 5862)
		Cls()

		return
	end
end
OEVENTLUA[2124] = function ()
	Cls()
	say("令狐兄？你怎么在这里。", 0, 1)
	say("定闲师伯上次受到嵩山派的人袭击受了内伤，后来又带伤参加五岳大会，回来后不久就病倒了。临去世前委托我暂代处理恒山事宜。", 35, 0)
	say("原来如此。", 0, 1)
	say("任姑娘你好。", 0, 1)
	say(JY.Person[0].称呼 .. "，你好。", 73, 0)
end
OEVENTLUA[2125] = function ()
	Cls()
	dark()
	light()
	say("怎么这么多尸体？难道我们来晚了？五岳派已经攻上黑木崖了？", 36, 0)
	null(-2, 82)
end
OEVENTLUA[2126] = function ()
	Cls()

	if instruct_16(36) then
		dark()
		light()
		null(-2, 33)
		null(-2, 34)
		null(-2, 35)
		say("不好，有埋伏！", 0, 1)
		dark()
		addevent(26, 13, 0, 0, 0, 8274)
		addevent(26, 19, 0, 0, 0, 5888)
		addevent(26, 20, 0, 0, 0, 5888)
		addevent(26, 21, 0, 0, 0, 5888)
		addevent(26, 22, 0, 0, 0, 5888)
		addevent(26, 23, 0, 0, 0, 5888)
		addevent(26, 24, 0, 0, 0, 5888)
		addevent(26, 25, 0, 0, 0, 5888)
		addevent(26, 26, 0, 0, 0, 5888)
		addevent(26, 57, 0, 0, 0, 5894)
		addevent(26, 58, 0, 0, 0, 5894)
		addevent(26, 59, 0, 0, 0, 5894)
		light()
		meet_self(27)
		say("胆敢闯我黑木崖！全部给我杀了！", 27, 0)
		say("等等，误会啊！", 0, 1)

		if WarMain(54, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		dark()
		My_Enter_SubScene(26, 17, 27, 2)
		addevent(26, 19, 1, 0, 0, 10212)
		addevent(26, 20, 1, 0, 0, 10204)
		addevent(26, 21, 1, 0, 0, 10214)
		addevent(26, 22, 1, 0, 0, 10198)
		addevent(26, 23, 1, 0, 0, 10212)
		addevent(26, 24, 1, 0, 0, 10214)
		addevent(26, 25, 1, 0, 0, 10212)
		addevent(26, 26, 1, 0, 0, 10214)
		addevent(26, 57, 1, 0, 0, 10214)
		addevent(26, 58, 1, 0, 0, 10214)
		addevent(26, 59, 1, 0, 0, 10214)
		light()
		say("你是谁？你武功很高啊。", 0, 1)
		say("你~，你不知道我是谁？那你为何闯我黑木崖？", 27, 0)
		say("哈哈哈，妙啊！", 26, 1)
		dark()
		addevent(26, 15, 0, 0, 0, 8214)
		addevent(26, 16, 0, 0, 0, 7172)
		addevent(26, 17, 0, 0, 0, 7656)
		addevent(26, 18, 0, 0, 0, 7168)
		addevent(26, 27, 0, 0, 0, 5894)
		addevent(26, 28, 0, 0, 0, 5894)
		addevent(26, 29, 0, 0, 0, 5894)
		addevent(26, 30, 0, 0, 0, 5894)
		addevent(26, 31, 0, 0, 0, 5894)
		light()
		say("令狐兄？", 0, 1)
		My_Enter_SubScene(26, 17, 27, 1)
		say(JY.Person[0].称呼 .. "，你怎么和东方不败打起来了？", 26, 0)
		say("我...", 0, 1)
		say("东方不败，没想到你也有今天。", 26, 0)
		say("任我行~，这都是你的阴谋吧？", 27, 1)
		say("哈哈哈，来人啊，把他带下去。", 26, 0)
		say("任我行~，你要报仇就来吧，杀了我！", 27, 1)
		say("我现在不想杀你了，我也找个地方安养你好了。", 26, 0)
		say("你好狠毒！", 27, 1)
		dark()
		null(-2, 13)
		null(-2, 30)
		null(-2, 31)
		light()
		say("恭喜教主，今日诛却大逆。从此我教在教主庇荫之下，扬威四海。教主千秋万载，一统江湖。", 366, 0, "向问天")
		say("胡说八道！什么千秋万载？哈！哈！哈！《葵花宝典》啊《葵花宝典》，你终于又回到我手里了，可惜，这并不是常人可以练的。", 26, 1)
		say("这话怎讲？", 0, 0)
		say("这宝典的第一页就注明着，“欲练神功，引刀自宫”，老夫可不会没了脑子，去干这等傻事。哈哈，哈哈……可是宝典上所载的武功实在厉害，任何学武之人，一见之后却不能不动心。东方不败，饶你奸诈似鬼，也猜不透老夫传你“葵花宝典”的用意。你野心勃勃，意存拔扈，难道老夫瞧不出来吗？哈哈，哈哈！", 26, 1)
		say("任我行将那《葵花宝典》放在双掌中一搓，功力到处，原已十分陈旧的册页登时化为碎片。", 0, 2)
		say("等等~，该死！", 0, 0)
		say("你干什么？谁让你将秘籍毁了的。", 0, 0)
		say("大胆，敢如此和教主说话。", 366, 1)
		say(JY.Person[0].称呼 .. "，你？", 26, 0)
		say("东方不败是我打败的，他的战利品自然是我的，谁让你将它毁了的？", 0, 1)
		say(JY.Person[0].称呼 .. "，你想要葵花宝典？如果想要你早说啊，现在却说什么都晚了。对了，东方不败身上还有一本书，让我看看。", 26, 0)
		say("这是...，这是无字天书？ 哈哈哈哈哈~运气，运气，想不到东方不败还能找到这本奇书。", 26, 0)
		say("给我。", 0, 1)
		say("你说什么？大胆！", 366, 0)
		say("闭嘴。" .. JY.Person[0].称呼 .. "，你可知道这是什么书？这不是你能拥有的东西？", 26, 0)
		say("真是不知感恩啊。拿出来，或者死！", 0, 1)
		say(JY.Person[0].称呼 .. "，你...", 35, 0)
		say("令狐兄，这件事你不要管了。", 0, 1)
		say(JY.Person[0].称呼 .. "，不要以为你打败了东方不败就无敌了。", 26, 0)

		if WarMain(55, 0) == false then
			instruct_15()
			Cls()

			do return end

			Cls()
		end

		dark()
		addevent(26, 15, 1, 0, 0, 10212)
		addevent(26, 16, 1, 0, 0, 10204)
		addevent(26, 27, 1, 0, 0, 10214)
		addevent(26, 28, 1, 0, 0, 10198)
		addevent(26, 29, 1, 0, 0, 10212)
		light()
		say(JY.Person[0].称呼 .. "，你别杀我爹爹！", 73, 0)
		say(JY.Person[0].称呼 .. "，你...", 35, 0)
		say("放心，看在令狐兄和你的面子上，我不会杀他，不过他刚才重伤情况下又吸了我那么多内力，只怕已经活不了啦！", 0, 1)
		say("任教主，如果你愿意，我还是有办法保你一命的。", 0, 1)
		say("成王败寇，你杀了我吧。", 26, 0)
		say(JY.Person[0].称呼 .. "，求你救救我爹爹！", 73, 1)
		DrawStrBox(-1, -1, "你一指向任我行丹田点去。", C_ORANGE, CC.DefaultFont)
		ShowScreen()
		lib.Delay(2000)
		Cls()
		say("啊~，你，你废了我武功？你好狠~", 26, 0)
		say("你体内根本容不下我那么多的真气。再不处置只怕马上就会爆炸，我既然答应了要救你，你自然不会死。", 0, 1)
		say("你，你好阴险...", 366, 0, "向问天")
		addevent(26, 16, 0, 0, 0, 7174)
		say("嗯？你命倒是大，居然还没有死？", 0, 1)
		say("哼...", 366, 0, "向问天")
		say("任教主，你已经老了，已经看不清江湖的形势了，我看你还是找个地方养老吧，还能多享受享受人生。", 0, 1)
		say("教...,教主，我们走。", 366, 0, "向问天")
		dark()
		null(-2, 15)
		null(-2, 16)
		light()

		if has_thing(65) == false then
			addthing(65, 1)
		end

		addthing(151, 1)
		say("哎，任教主也是一代人杰，如此能安享晚年也算不错。", 0, 1)
		say("多谢" .. JY.Person[0].称呼 .. "手下留情，我爹爹现在受了如此打击，想是会心灰意冷，我要去陪陪他。", 73, 0)
		say("盈盈，我陪你一起去，" .. JY.Person[0].称呼 .. "，告辞。", 35, 1)
		say("告辞。", 0, 1)
		dark()
		null(-2, 17)
		null(-2, 18)
		light()
		say("可惜，可惜，东方不败，任老魔都不在了，偌大的魔教只怕就此树倒猢狲散了。", 0, 1)
		addevent(26, 82, 0, 2117, 3, -2)
		say(JY.Person[0].称呼 .. "，刚才他们把东方不败带到什么地方去了？", 36, 0)
		say("怎么？", 0, 1)
		say("东方不败练了葵花剑法，据说和我家的辟邪剑法颇有关系，我想去看看。", 36, 0)
		say("唔，那咱们找找看有没有什么线索。", 0, 1)
		addevent(26, 12, 0, 2127, 3, -2)
		addevent(26, 60, 0, 2127, 3, -2)
		addevent(26, 61, 0, 2127, 3, -2)
		addevent(26, 62, 0, 2127, 3, -2)
		addevent(26, 63, 0, 2127, 3, -2)
		addevent(26, 64, 0, 2127, 3, -2)
		addevent(26, 65, 0, 2127, 3, -2)
		addevent(55, 27, 1, 2130, 1, 5890)
		addevent(55, 28, 1, 2130, 1, 5890)
		addevent(55, 29, 1, 2130, 1, 5890)
		addevent(55, 30, 1, 2130, 1, 5890)
		addevent(55, 31, 1, 2130, 1, 5890)
		addevent(55, 32, 1, 2130, 1, 5890)
		addevent(55, 33, 1, 2130, 1, 5890)
		addevent(55, 25, 1, 2131, 1, 5888)
		addevent(82, 8, 1, 2132, 1, 8278)
		instruct_3(57, 14, 1, 0, 2128, 0, 0, 5696, 5696, 5696, -2, -2, -2)
		instruct_3(57, 16, 1, 0, 2128, 0, 0, 5694, 5694, 5694, -2, -2, -2)
		null(31, 14)
		null(31, 15)
	end
end
OEVENTLUA[2127] = function ()
	Cls()
	null(-2, 12)
	null(-2, 60)
	null(-2, 61)
	null(-2, 62)
	null(-2, 63)
	null(-2, 64)
	null(-2, 65)
	dark()
	light()
	say("站住！", 19, 0)
	dark()
	instruct_3(26, 32, 0, 0, 0, 0, 0, 5958, 5958, 5958, -2, -2, -2)
	instruct_3(26, 3, 0, 0, 0, 0, 0, 5232, 5232, 5232, -2, -2, -2)
	instruct_3(26, 2, 0, 0, 0, 0, 0, 5954, 5954, 5954, -2, -2, -2)
	instruct_3(26, 1, 0, 0, 0, 0, 0, 5968, 5968, 5968, -2, -2, -2)
	instruct_3(26, 0, 0, 0, 0, 0, 0, 5944, 5944, 5944, -2, -2, -2)
	instruct_3(26, 4, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(26, 5, 0, 0, 0, 0, 0, 5172, 5172, 5172, -2, -2, -2)
	instruct_3(26, 6, 0, 0, 0, 0, 0, 5204, 5204, 5204, -2, -2, -2)
	instruct_3(26, 7, 0, 0, 0, 0, 0, 5204, 5204, 5204, -2, -2, -2)
	instruct_3(26, 8, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(26, 9, 0, 0, 0, 0, 0, 5190, 5190, 5190, -2, -2, -2)
	instruct_3(26, 10, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	instruct_3(26, 11, 0, 0, 0, 0, 0, 5198, 5198, 5198, -2, -2, -2)
	light()
	say(JY.Person[0].称呼 .. "，把葵花宝典交出来，这不是你能拿的东西？", 19, 0)
	say("......", 0, 1)
	say("<和林兄弟在一起后，我的运气似乎变差了啊>", 0, 1)
	say("什么葵花宝典，我没有见到。", 0, 1)
	say("你拿的不是葵花宝典，那是什么？", 19, 0)
	say("那是一本没有字的书，给你也没有用。", 0, 1)
	say("没有字的书？难道是天书？交出来，你就可以安全离开！", 19, 0)
	say("交出来是，不可能的，让路！", 0, 1)
	say(JY.Person[0].称呼 .. "，何必呢？为了一本书和武林为敌值得吗？", 19, 0)
	say("废话少说，要打就打！", 0, 1)

	if instruct_16(79) then
		say("爹爹，你们不要打了！", 79, 0)
		say("灵珊，你过来，别和这些逆贼在一起。", 19, 1)
		say("我不，我要和平之在一起！", 79, 0)
	end

	if instruct_16(36) then
		say("平之，你过来，别和这些逆贼在一起。", 19, 0)
		say("师父，这么久了，你终于露出真面目了吗？", 36, 1)
		say("放肆~", 19, 0)
	end

	if WarMain(56, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	say(JY.Person[0].称呼 .. "果然武功高强，只是今日你拿了天书，以后在江湖行走只怕无有宁日，还请三思，你若改变了想法，可来华山找我。", 19, 0)
	say("各位，今日魔教已灭，咱们走！", 19, 0)
	dark()
	null(-2, 32)
	null(-2, 0)
	null(-2, 1)
	null(-2, 2)
	null(-2, 3)
	null(-2, 4)
	null(-2, 5)
	null(-2, 6)
	null(-2, 7)
	null(-2, 8)
	null(-2, 9)
	null(-2, 10)
	null(-2, 11)
	light()
	say("哼，想要我的天书，有胆就来拿吧。", 0, 1)
	instruct_3(57, 14, 0, 0, 2128, 0, 0, 5696, 5696, 5696, -2, -2, -2)
	instruct_3(57, 16, 0, 0, 2128, 0, 0, 5694, 5694, 5694, -2, -2, -2)
end
OEVENTLUA[2128] = function ()
	Cls()

	if Rnd(2) == 1 then
		say(JY.Person[0].称呼 .. "，你想通了？不如将天书交给我给你保管吧。", 19, 0)
	else
		say("时隔多年，我华山派终于又成为五岳盟主了。", 19, 0)
	end
end
OEVENTLUA[2130] = function ()
	Cls()
	say("什么人？敢来梅庄打探。来人啊~", 202, 0, "日月教徒")

	if WarMain(357, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	null(-2, 27)
	null(-2, 28)
	null(-2, 29)
	null(-2, 30)
	null(-2, 31)
	null(-2, 32)
	null(-2, 33)
	light()
end
OEVENTLUA[2131] = function ()
	Cls()
	say("什么人？敢来梅庄打探。", 202, 0, "日月教徒")

	if WarMain(358, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	dark()
	null(-2, 25)
	light()
end
OEVENTLUA[2132] = function ()
	Cls()
	say("莲弟，莲弟，我和你们拼了~", 27, 0)
	say("等等~，该死！你疯了？", 0, 1)

	if WarMain(359, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	say("莲弟，莲弟，我来陪你了~", 27, 0)
	addevent(82, 8, -2, -2, -2, 7966)
	say("......", 0, 1)
	addevent(82, 2, 1, 2133, 1, -2)
end
OEVENTLUA[2133] = function ()
	Cls()
	addthing(93, 1)
	say("欲练此功，必先自宫？原来如此。", 0, 1)

	if yesno("要修炼此功吗？") then
		say("我就想修炼这个功法，我找你很久了。", 0, 1)
	else
		say("这样的武功不练也罢。", 0, 1)

		if instruct_16(36) then
			say("林兄弟，这葵花宝典你看看吧。", 0, 1)
			dark()
			light()
			say("果然，这似乎就是一部功法，而我家的辟邪剑法只是其中一部分。", 36, 0)
			say(JY.Person[0].称呼 .. "，你就不想得到这辟邪剑法？", 36, 0)
			say("我是不会练的，这武功对我略有些参考价值，不过也只是扩展我武学眼界吧了。", 0, 1)
			say(JY.Person[0].称呼 .. "如此大度，却是我想偏了，这辟邪剑谱" .. JY.Person[0].称呼 .. "你看看。", 36, 0)
			say("林兄弟？", 0, 1)
			say(JY.Person[0].称呼 .. "，你一直在帮我，我是领情的。", 36, 0)
			addthing(78, 1)
		end
	end

	null(-2, 2)
end
OEVENTLUA[2134] = function ()
	Cls()
	say("五岳大会已经结束了，没啥可看的，快离开。", 198, 0, "嵩山弟子")
	instruct_3(27, 58, 0, 0, 0, 0, 2098, 0, 0, 0, -2, -2, -2)
	instruct_3(27, 59, 0, 0, 0, 0, 2098, 0, 0, 0, -2, -2, -2)
	instruct_3(27, 53, 1, 0, 2110, 0, 0, 5704, 5704, 5704, -2, -2, -2)
	instruct_3(27, 54, 1, 0, 2110, 0, 0, 5706, 5706, 5706, -2, -2, -2)
	instruct_3(58, 10, 1, 0, 2111, 0, 0, 5700, 5700, 5700, -2, -2, -2)
	instruct_3(58, 11, 1, 0, 2111, 0, 0, 5702, 5702, 5702, -2, -2, -2)
	null(31, 0)
	null(31, 1)
	instruct_3(31, 14, 1, 0, 2124, 0, 0, 7002, 7002, 7002, -2, -2, -2)
	instruct_3(31, 15, 1, 0, 2124, 0, 0, 7148, 7148, 7148, -2, -2, -2)
	instruct_3(29, 0, 1, 0, 2113, 0, 0, 5710, 5710, 5710, -2, -2, -2)
	instruct_3(29, 1, 1, 0, 2113, 0, 0, 5708, 5708, 5708, -2, -2, -2)
	instruct_3(57, 14, 1, 0, 2121, 0, 0, 5696, 5696, 5696, -2, -2, -2)
	instruct_3(57, 16, 1, 0, 2121, 0, 0, 5694, 5694, 5694, -2, -2, -2)
	instruct_3(40, 8, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(40, 9, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 52, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 53, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	instruct_3(119, 54, 1, 0, 2099, 0, 0, -2, -2, -2, -2, -2, -2)
	Cls()

	if instruct_5() == false then
		do return end

		Cls()
	end

	if WarMain(29, 0) == false then
		instruct_15()
		Cls()

		do return end

		Cls()
	end

	instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
	Cls()
	instruct_13()
end
OEVENTLUA[2150] = function ()
	Cls()
	dark()
	null(-2, 59)
	light()

	if inteam(35) then
		say("我们又回来了。", 35, 0)
		instruct_21(35)
		null(70, 15)
	end

	if inteam(73) then
		instruct_21(73)
		null(70, 35)
	end

	say("不知掌门还有什么安排，不会让我一直做这点小事吧？", 22, 0)
	say("左长老，如今机会来了。", 0, 1)
	say("武林正派可能会对光明教出手，我命令你带领五岳剑派的高手潜伏进光明顶附近，相机行事。一有机会，咱们就灭了明教，建立咱们西域分舵。", 0, 1)
	say("正该如此。", 22, 0)
	say("掌门，我们呢？", 20, 0)
	say("是啊掌门，如今众弟子训练有素，也该他们见见血了。", 23, 0)

	JY.Person[23].好感度 = 75

	say("不要着急，都去。有我师父在华山，可保华山无忧，咱们这次倾巢出动，一定要做票大的。", 0, 1)
	say("掌门你到是好气魄。", 22, 0)
	say("怎么？你不想去？", 0, 1)
	say("去去，我如今对掌门人可是佩服的紧。", 22, 0)
	say("很好，都下去安排去吧。", 0, 1)
	say("是，掌门。", 20, 0)
	say("是，掌门。", 23, 0)
	say("掌门，盈盈就留在华山吧？", 35, 0)
	say("我要和你一起。", 73, 0)
	say("呵呵，这个你们自己定。", 0, 1)
	say("注意隐藏身份，我们要关键时刻出手，一举立功。", 0, 1)
	say("正该如此。", 22, 0)
	dark()
	null(-2, 50)
	null(-2, 51)
	null(-2, 52)
	null(-2, 53)
	null(-2, 54)
	light()
end
OEVENTLUA[2202] = function ()
	Cls()
	say("石兄弟，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	say("好。", 38, 0)
	Cls()
	instruct_21(38)
	instruct_3(70, 16, 1, 0, 2203, 0, 0, 6410, 6410, 6410, -2, -2, -2)
	instruct_3(70, 58, 1, 0, 2203, 0, 0, 6412, 6412, 6412, -2, -2, -2)
end
OEVENTLUA[2203] = function ()
	Cls()

	if JY.Person[0].耍刀技巧 == 99 then
		say("你刀法似乎可以更进一步了，需要我帮忙吗？", 38, 0)
		say("好啊。", 0, 1)
		dark()
		light()
		say("原来如此。", 0, 1)
		say("你只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(3, 1)

		JY.Person[0].耍刀技巧 = 100

		return
	end

	say("需要我帮忙吗？", 38, 0)

	if instruct_9() then
		say("好啊。", 0, 1)

		if instruct_20() == false then
			instruct_14()
			null(70, 16)
			null(70, 58)
			Cls()
			instruct_13()
			instruct_10(38)

			return
		end

		say("你的队伍已满，我无法加入。", 38, 0)
	end
end
OEVENTLUA[2204] = function ()
	say("贝大夫，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	Cls()
	instruct_21(85)
	instruct_3(70, 49, 1, 0, 2205, 0, 0, 7028, 7028, 7028, -2, -2, -2)
end
OEVENTLUA[2205] = function ()
	Cls()

	if has_thing(191) == false and JY.Person[0].医疗能力 >= 40 then
		say("贝大夫，听说你的医术不错，我对医术略有研究，不知可否借阅一下你的医术典籍让我看看？", 0, 1)
		say("医书？好说，你拿去吧。", 85, 0)
		addthing(191)

		return
	end

	say("有需要我帮忙的地方吗？", 85, 0)
	Cls()

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(85)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 85, 0)
		Cls()

		return
	end
end
OEVENTLUA[2210] = function ()
	Cls()

	if JY.Person[0].门派 == 5 then
		say("令狐兄，你先回华山，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(35)
		addevent(57, 53, 1, 2211, 1, 7158)
	else
		say("令狐兄，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(35)
		instruct_3(70, 15, 1, 0, 2211, 0, 0, 5722, 5748, 5722, -2, -2, -2)
	end
end
OEVENTLUA[2211] = function ()
	Cls()

	if JY.Person[0].御剑能力 == 99 then
		say("你的剑法似乎到了一个关隘。", 9, 0)
		say("不错，你有什么法子？", 0, 1)
		dark()
		light()
		say("原来如此。", 0, 1)
		say("你只感觉以前的关隘豁然开朗。", 0, 2)
		write_nump(2, 1)

		JY.Person[0].御剑能力 = 100

		return
	end

	if JY.Person[0].门派 == 5 then
		say("掌门人，你有什么吩咐？", 35, 0)
	else
		say("需要我帮忙吗？", 35, 0)
	end

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(35)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 35, 0)
		Cls()

		return
	end
end
OEVENTLUA[2212] = function ()
	Cls()

	if JY.Person[0].门派 == 5 then
		say("任姑娘，你先回华山，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(73)
		addevent(57, 54, 1, 2213, 1, 7002)
	else
		say("任姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(73)
		instruct_3(70, 35, 1, 0, 2213, 0, 0, 7002, 7002, 7002, -2, -2, -2)
	end
end
OEVENTLUA[2213] = function ()
	Cls()
	say("我要和令狐大哥一起。", 73, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(73)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 73, 0)
		Cls()

		return
	end
end
OEVENTLUA[2214] = function ()
	Cls()

	if JY.Person[0].门派 == 5 then
		say("林兄弟，你先回华山，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(36)
		addevent(57, 6, 1, 2215, 1, 5862)
	else
		say("林兄弟，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(36)
		instruct_3(70, 25, 1, 0, 2215, 0, 0, 5862, 5862, 5862, -2, -2, -2)
	end
end
OEVENTLUA[2215] = function ()
	Cls()

	if JY.Person[0].门派 == 5 and JY.Person[36].好感度 < 90 then
		say("林兄弟，你武功练得如何了？", 0, 1)
		say("掌门好，我今日武功大进，只是要找余沧海报仇还是没有完全把握。", 36, 0)
		say("无妨，我去帮你压阵，保证没有问题。", 0, 1)
		say("多谢掌门。", 36, 0)
	elseif JY.Person[0].门派 == 5 and JY.Person[36].好感度 >= 90 then
		say("掌门好。", 36, 0)
	else
		say(JY.Person[0].称呼 .. "，你来了。", 36, 0)
	end

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(36)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 36, 0)
		Cls()

		return
	end
end
OEVENTLUA[2216] = function ()
	Cls()

	if JY.Person[0].门派 == 5 then
		say("岳姑娘，你先回华山，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(79)
		addevent(57, 5, 1, 2217, 1, 7018)
	else
		say("岳姑娘，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
		Cls()
		instruct_21(79)
		instruct_3(70, 125, 1, 0, 2217, 0, 0, 7018, 7018, 7018, -2, -2, -2)
	end
end
OEVENTLUA[2217] = function ()
	Cls()

	if JY.Person[0].门派 == 5 then
		say("掌门好，带我跟你们一块出去玩吧。", 79, 0)
	else
		say(JY.Person[0].称呼 .. "，要我帮忙吗？", 79, 0)
	end

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(79)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 79, 0)
		Cls()

		return
	end
end
OEVENTLUA[2218] = function ()
	Cls()
	say("东方不败，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	say("哼。", 27, 0)
	Cls()
	instruct_21(27)
	addevent(70, 118, 1, 2219, 1, 8278)
end
OEVENTLUA[2219] = function ()
	Cls()

	if JY.Person[27].好感度 >= 55 then
		say("需要我出手吗？", 27, 0)

		if instruct_9() then
			say("正是。", 0, 1)
			say("走。", 27, 0)
			Cls()

			if instruct_20() == false then
				instruct_14()
				instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0)
				Cls()
				instruct_13()
				instruct_10(27)

				return
			end

			say("你的队伍满了，我无法加入。", 27, 0)
			Cls()

			return
		end
	else
		say("我不欠你人情了，以后不要来打扰我。", 27, 0)
	end
end
OEVENTLUA[2220] = function ()
	Cls()
	say("平医生，你先回小村，有需*要时，我再去找你帮忙。", 0, 1)
	say("好。", 28, 0)
	Cls()
	instruct_21(28)
	addevent(70, 34, 1, 2221, 1, 5906)
end
OEVENTLUA[2221] = function ()
	say("又需要我帮忙？", 28, 0)
	Cls()

	if has_thing(187) == false and JY.Person[0].医疗能力 >= 50 then
		say("平医生，我对医术略有研究，不知可否向你学习医术？", 0, 1)
		say("医术？看你能不能学会吧，这个拿去自己看。", 28, 0)
		addthing(187)

		return
	end

	say("又需要我帮忙？", 28, 0)

	if instruct_9() then
		if instruct_20() == false then
			instruct_10(28)
			instruct_14()
			instruct_3(-2, -2, 0, 0, 0, 0, 0, 0, 0, 0, -2, -2, -2)
			Cls()
			instruct_13()

			return
		end

		say("你的队伍已满，我无法加入。", 28, 0)
		Cls()

		return
	end
end
